tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register SYS_STATUS_HI
**/
#define SYS_STATUS_HI_ID                     0x48                 
#define SYS_STATUS_HI_LEN                    (4U)                
#define SYS_STATUS_HI_MASK                   0xFFFFFFFFUL        
#define SYS_STATUS_HI_CCA_FAIL_BIT_OFFSET    (12U)               
#define SYS_STATUS_HI_CCA_FAIL_BIT_LEN       (1U)                
#define SYS_STATUS_HI_CCA_FAIL_BIT_MASK      0x1000U              
#define SYS_STATUS_HI_SPI_COLLISION_BIT_OFFSET (11U)               
#define SYS_STATUS_HI_SPI_COLLISION_BIT_LEN  (1U)                
#define SYS_STATUS_HI_SPI_COLLISION_BIT_MASK 0x800U               
#define SYS_STATUS_HI_SPI_UNF_BIT_OFFSET     (10U)               
#define SYS_STATUS_HI_SPI_UNF_BIT_LEN        (1U)                
#define SYS_STATUS_HI_SPI_UNF_BIT_MASK       0x400U               
#define SYS_STATUS_HI_SPI_OVF_BIT_OFFSET     (9U)                
#define SYS_STATUS_HI_SPI_OVF_BIT_LEN        (1U)                
#define SYS_STATUS_HI_SPI_OVF_BIT_MASK       0x200U               
#define SYS_STATUS_HI_CMD_ERR_BIT_OFFSET     (8U)                
#define SYS_STATUS_HI_CMD_ERR_BIT_LEN        (1U)                
#define SYS_STATUS_HI_CMD_ERR_BIT_MASK       0x100U               
#define SYS_STATUS_HI_AES_ERR_BIT_OFFSET     (7U)                
#define SYS_STATUS_HI_AES_ERR_BIT_LEN        (1U)                
#define SYS_STATUS_HI_AES_ERR_BIT_MASK       0x80U                
#define SYS_STATUS_HI_AES_DONE_BIT_OFFSET    (6U)                
#define SYS_STATUS_HI_AES_DONE_BIT_LEN       (1U)                
#define SYS_STATUS_HI_AES_DONE_BIT_MASK      0x40U                
#define SYS_STATUS_HI_GPIO_BIT_OFFSET        (5U)                
#define SYS_STATUS_HI_GPIO_BIT_LEN           (1U)                
#define SYS_STATUS_HI_GPIO_BIT_MASK          0x20U                
#define SYS_STATUS_HI_VT_DET_BIT_OFFSET      (4U)                
#define SYS_STATUS_HI_VT_DET_BIT_LEN         (1U)                
#define SYS_STATUS_HI_VT_DET_BIT_MASK        0x10U                
#define SYS_STATUS_HI_ESYNC_RST_BIT_OFFSET   (3U)                
#define SYS_STATUS_HI_ESYNC_RST_BIT_LEN      (1U)                
#define SYS_STATUS_HI_ESYNC_RST_BIT_MASK     0x8U                 
#define SYS_STATUS_HI_RXPREJ_BIT_OFFSET      (1U)                
#define SYS_STATUS_HI_RXPREJ_BIT_LEN         (1U)                
#define SYS_STATUS_HI_RXPREJ_BIT_MASK        0x2U                 
#define SYS_STATUS_HI_RXSCE_BIT_OFFSET       (0U)                
#define SYS_STATUS_HI_RXSCE_BIT_LEN          (1U)                
#define SYS_STATUS_HI_RXSCE_BIT_MASK         0x1U                 

/******************************************************************************
* @brief Bit definitions for register RX_FINFO
**/
#define RX_FINFO_ID                          0x4c                 
#define RX_FINFO_LEN                         (4U)                
#define RX_FINFO_MASK                        0xFFFFFFFFUL        
#define RX_FINFO_RXP2SS_BIT_OFFSET           (20U)               
#define RX_FINFO_RXP2SS_BIT_LEN              (12U)               
#define RX_FINFO_RXP2SS_BIT_MASK             0xfff00000UL         
#define RX_FINFO_RXPSR_BIT_OFFSET            (18U)               
#define RX_FINFO_RXPSR_BIT_LEN               (2U)                
#define RX_FINFO_RXPSR_BIT_MASK              0xc0000UL            
#define RX_FINFO_RXPRF_BIT_OFFSET            (16U)               
#define RX_FINFO_RXPRF_BIT_LEN               (2U)                
#define RX_FINFO_RXPRF_BIT_MASK              0x30000UL            
#define RX_FINFO_RNG_BIT_OFFSET              (15U)               
#define RX_FINFO_RNG_BIT_LEN                 (1U)                
#define RX_FINFO_RNG_BIT_MASK                0x8000U              
#define RX_FINFO_RXBR_BIT_OFFSET             (13U)               
#define RX_FINFO_RXBR_BIT_LEN                (1U)                
#define RX_FINFO_RXBR_BIT_MASK               0x2000U              
#define RX_FINFO_RXNSPL_BIT_OFFSET           (11U)               
#define RX_FINFO_RXNSPL_BIT_LEN              (2U)                
#define RX_FINFO_RXNSPL_BIT_MASK             0x1800U              
#define RX_FINFO_RXFLEN_BIT_OFFSET           (0U)                
#define RX_FINFO_RXFLEN_BIT_LEN              (10U)               
#define RX_FINFO_RXFLEN_BIT_MASK             0x3ffU               

/******************************************************************************
* @brief Bit definitions for register RX_FQUAL_LO
**/
#define RX_FQUAL_LO_ID                       0x50                 
#define RX_FQUAL_LO_LEN                      (4U)                
#define RX_FQUAL_LO_MASK                     0xFFFFFFFFUL        
#define RX_FQUAL_LO_RX_SNR_BIT_OFFSET        (16U)               
#define RX_FQUAL_LO_RX_SNR_BIT_LEN           (16U)               
#define RX_FQUAL_LO_RX_SNR_BIT_MASK          0xffff0000UL         
#define RX_FQUAL_LO_RX_FOM_BIT_OFFSET        (0U)                
#define RX_FQUAL_LO_RX_FOM_BIT_LEN           (16U)               
#define RX_FQUAL_LO_RX_FOM_BIT_MASK          0xffffU              

/******************************************************************************
* @brief Bit definitions for register RX_FQUAL_HI
**/
#define RX_FQUAL_HI_ID                       0x54                 
#define RX_FQUAL_HI_LEN                      (4U)                
#define RX_FQUAL_HI_MASK                     0xFFFFFFFFUL        
#define RX_FQUAL_HI_PERF_DIAG1_BIT_OFFSET    (16U)               
#define RX_FQUAL_HI_PERF_DIAG1_BIT_LEN       (16U)               
#define RX_FQUAL_HI_PERF_DIAG1_BIT_MASK      0xffff0000UL         
#define RX_FQUAL_HI_PERF_DIAG0_BIT_OFFSET    (0U)                
#define RX_FQUAL_HI_PERF_DIAG0_BIT_LEN       (16U)               
#define RX_FQUAL_HI_PERF_DIAG0_BIT_MASK      0xffffU              

/******************************************************************************
* @brief Bit definitions for register RX_TTCKO_LO
**/
#define RX_TTCKO_LO_ID                       0x5c                 
#define RX_TTCKO_LO_LEN                      (4U)                
#define RX_TTCKO_LO_MASK                     0xFFFFFFFFUL        
#define RX_TTCKO_LO_RNG_CAR_PHASE_BIT_OFFSET (0U)                
#define RX_TTCKO_LO_RNG_CAR_PHASE_BIT_LEN    (7U)                
#define RX_TTCKO_LO_RNG_CAR_PHASE_BIT_MASK   0x7fU                

