tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register RX_TTCKO_HI
**/
#define RX_TTCKO_HI_ID                       0x60                 
#define RX_TTCKO_HI_LEN                      (4U)                
#define RX_TTCKO_HI_MASK                     0xFFFFFFFFUL        
#define RX_TTCKO_HI_RSMP_DEL_BIT_OFFSET      (0U)                
#define RX_TTCKO_HI_RSMP_DEL_BIT_LEN         (8U)                
#define RX_TTCKO_HI_RSMP_DEL_BIT_MASK        0xffU                

/******************************************************************************
* @brief Bit definitions for register RX_TIME_0
**/
#define RX_TIME_0_ID                         0x64                 
#define RX_TIME_0_LEN                        (4U)                
#define RX_TIME_0_MASK                       0xFFFFFFFFUL        
#define RX_TIME_0_RX_ADJUSTED_TIMESTAMP_LO_BIT_OFFSET (0U)                
#define RX_TIME_0_RX_ADJUSTED_TIMESTAMP_LO_BIT_LEN (32U)               
#define RX_TIME_0_RX_ADJUSTED_TIMESTAMP_LO_BIT_MASK 0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register RX_TIME_1
**/
#define RX_TIME_1_ID                         0x68                 
#define RX_TIME_1_LEN                        (4U)                
#define RX_TIME_1_MASK                       0xFFFFFFFFUL        
#define RX_TIME_1_LE_RESULT1_LO_BIT_OFFSET   (24U)               
#define RX_TIME_1_LE_RESULT1_LO_BIT_LEN      (8U)                
#define RX_TIME_1_LE_RESULT1_LO_BIT_MASK     0xff000000UL         
#define RX_TIME_1_LE_RESULT0_BIT_OFFSET      (8U)                
#define RX_TIME_1_LE_RESULT0_BIT_LEN         (16U)               
#define RX_TIME_1_LE_RESULT0_BIT_MASK        0xffff00UL           
#define RX_TIME_1_RX_ADJUSTED_TIMESTAMP_HI_BIT_OFFSET (0U)                
#define RX_TIME_1_RX_ADJUSTED_TIMESTAMP_HI_BIT_LEN (8U)                
#define RX_TIME_1_RX_ADJUSTED_TIMESTAMP_HI_BIT_MASK 0xffU                

/******************************************************************************
* @brief Bit definitions for register RX_TIME_2
**/
#define RX_TIME_2_ID                         0x6c                 
#define RX_TIME_2_LEN                        (4U)                
#define RX_TIME_2_MASK                       0xFFFFFFFFUL        
#define RX_TIME_2_LE_RESULT1_HI_BIT_OFFSET   (0U)                
#define RX_TIME_2_LE_RESULT1_HI_BIT_LEN      (8U)                
#define RX_TIME_2_LE_RESULT1_HI_BIT_MASK     0xffU                

/******************************************************************************
* @brief Bit definitions for register RX_TIME_3
**/
#define RX_TIME_3_ID                         0x70                 
#define RX_TIME_3_LEN                        (4U)                
#define RX_TIME_3_MASK                       0xFFFFFFFFUL        
#define RX_TIME_3_RX_UNADJUSTED_TIMESTAMP_BIT_OFFSET (0U)                
#define RX_TIME_3_RX_UNADJUSTED_TIMESTAMP_BIT_LEN (32U)               
#define RX_TIME_3_RX_UNADJUSTED_TIMESTAMP_BIT_MASK 0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register TX_TIME_LO
**/
#define TX_TIME_LO_ID                        0x74                 
#define TX_TIME_LO_LEN                       (4U)                
#define TX_TIME_LO_MASK                      0xFFFFFFFFUL        
#define TX_TIME_LO_TX_ADJUSTED_TIMESTAMP_LO_BIT_OFFSET (0U)                
#define TX_TIME_LO_TX_ADJUSTED_TIMESTAMP_LO_BIT_LEN (32U)               
#define TX_TIME_LO_TX_ADJUSTED_TIMESTAMP_LO_BIT_MASK 0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register TX_TIME_HI
**/
#define TX_TIME_HI_ID                        0x78                 
#define TX_TIME_HI_LEN                       (4U)                
#define TX_TIME_HI_MASK                      0xFFFFFFFFUL        
#define TX_TIME_HI_TX_ADJUSTED_TIMESTAMP_HI_BIT_OFFSET (0U)                
#define TX_TIME_HI_TX_ADJUSTED_TIMESTAMP_HI_BIT_LEN (8U)                
#define TX_TIME_HI_TX_ADJUSTED_TIMESTAMP_HI_BIT_MASK 0xffU                

/******************************************************************************
* @brief Bit definitions for register TX_TIME_2
**/
#define TX_TIME_2_ID                         0x10000              
#define TX_TIME_2_LEN                        (4U)                
#define TX_TIME_2_MASK                       0xFFFFFFFFUL        
#define TX_TIME_2_TX_UNADJUSTED_TIMESTAMP_BIT_OFFSET (0U)                
#define TX_TIME_2_TX_UNADJUSTED_TIMESTAMP_BIT_LEN (32U)               
#define TX_TIME_2_TX_UNADJUSTED_TIMESTAMP_BIT_MASK 0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register TX_ANTD
**/
#define TX_ANTD_ID                           0x10004              
#define TX_ANTD_LEN                          (4U)                
#define TX_ANTD_MASK                         0xFFFFFFFFUL        
#define TX_ANTD_ANTD_BIT_OFFSET              (0U)                
#define TX_ANTD_ANTD_BIT_LEN                 (16U)               
#define TX_ANTD_ANTD_BIT_MASK                0xffffU              

/******************************************************************************
* @brief Bit definitions for register ACK_RESP
**/
#define ACK_RESP_ID                          0x10008              
#define ACK_RESP_LEN                         (4U)                
#define ACK_RESP_MASK                        0xFFFFFFFFUL        
#define ACK_RESP_ACK_TIM_BIT_OFFSET          (24U)               
#define ACK_RESP_ACK_TIM_BIT_LEN             (8U)                
#define ACK_RESP_ACK_TIM_BIT_MASK            0xff000000UL         
#define ACK_RESP_WAIT4RESP_TIM_BIT_OFFSET    (0U)                
#define ACK_RESP_WAIT4RESP_TIM_BIT_LEN       (20U)               
#define ACK_RESP_WAIT4RESP_TIM_BIT_MASK      0xfffffUL            

