tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register TX_POWER
**/
#define TX_POWER_ID                          0x1000c              
#define TX_POWER_LEN                         (4U)                
#define TX_POWER_MASK                        0xFFFFFFFFUL        
#define TX_POWER_TX_CP_PWR_BIT_OFFSET        (24U)               
#define TX_POWER_TX_CP_PWR_BIT_LEN           (8U)                
#define TX_POWER_TX_CP_PWR_BIT_MASK          0xff000000UL         
#define TX_POWER_TX_SHR_PWR_BIT_OFFSET       (16U)               
#define TX_POWER_TX_SHR_PWR_BIT_LEN          (8U)                
#define TX_POWER_TX_SHR_PWR_BIT_MASK         0xff0000UL           
#define TX_POWER_TX_PHR_PWR_BIT_OFFSET       (8U)                
#define TX_POWER_TX_PHR_PWR_BIT_LEN          (8U)                
#define TX_POWER_TX_PHR_PWR_BIT_MASK         0xff00U              
#define TX_POWER_TX_DATA_PWR_BIT_OFFSET      (0U)                
#define TX_POWER_TX_DATA_PWR_BIT_LEN         (8U)                
#define TX_POWER_TX_DATA_PWR_BIT_MASK        0xffU                

/******************************************************************************
* @brief Bit definitions for register CHAN_CTRL
**/
#define CHAN_CTRL_ID                         0x10014              
#define CHAN_CTRL_LEN                        (4U)                
#define CHAN_CTRL_MASK                       0xFFFFFFFFUL        
#define CHAN_CTRL_RX_PCODE_BIT_OFFSET        (8U)                
#define CHAN_CTRL_RX_PCODE_BIT_LEN           (5U)                
#define CHAN_CTRL_RX_PCODE_BIT_MASK          0x1f00U              
#define CHAN_CTRL_TX_PCODE_BIT_OFFSET        (3U)                
#define CHAN_CTRL_TX_PCODE_BIT_LEN           (5U)                
#define CHAN_CTRL_TX_PCODE_BIT_MASK          0xf8U                
#define CHAN_CTRL_SFD_TYPE_BIT_OFFSET        (1U)                
#define CHAN_CTRL_SFD_TYPE_BIT_LEN           (2U)                
#define CHAN_CTRL_SFD_TYPE_BIT_MASK          0x6U                 
#define CHAN_CTRL_RF_CHAN_BIT_OFFSET         (0U)                
#define CHAN_CTRL_RF_CHAN_BIT_LEN            (1U)                
#define CHAN_CTRL_RF_CHAN_BIT_MASK           0x1U                 

/******************************************************************************
* @brief Bit definitions for register LE_PEND_01
**/
#define LE_PEND_01_ID                        0x10018              
#define LE_PEND_01_LEN                       (4U)                
#define LE_PEND_01_MASK                      0xFFFFFFFFUL        
#define LE_PEND_01_LE_ADDR1_BIT_OFFSET       (16U)               
#define LE_PEND_01_LE_ADDR1_BIT_LEN          (16U)               
#define LE_PEND_01_LE_ADDR1_BIT_MASK         0xffff0000UL         
#define LE_PEND_01_LE_ADDR0_BIT_OFFSET       (0U)                
#define LE_PEND_01_LE_ADDR0_BIT_LEN          (16U)               
#define LE_PEND_01_LE_ADDR0_BIT_MASK         0xffffU              

/******************************************************************************
* @brief Bit definitions for register LE_PEND_23
**/
#define LE_PEND_23_ID                        0x1001c              
#define LE_PEND_23_LEN                       (4U)                
#define LE_PEND_23_MASK                      0xFFFFFFFFUL        
#define LE_PEND_23_LE_ADDR3_BIT_OFFSET       (16U)               
#define LE_PEND_23_LE_ADDR3_BIT_LEN          (16U)               
#define LE_PEND_23_LE_ADDR3_BIT_MASK         0xffff0000UL         
#define LE_PEND_23_LE_ADDR2_BIT_OFFSET       (0U)                
#define LE_PEND_23_LE_ADDR2_BIT_LEN          (16U)               
#define LE_PEND_23_LE_ADDR2_BIT_MASK         0xffffU              

/******************************************************************************
* @brief Bit definitions for register SPI_COLLISION_STATUS
**/
#define SPI_COLLISION_STATUS_ID              0x10020              
#define SPI_COLLISION_STATUS_LEN             (4U)                
#define SPI_COLLISION_STATUS_MASK            0xFFFFFFFFUL        
#define SPI_COLLISION_STATUS_SPI_COLLISION_STATUS_BIT_OFFSET (0U)                
#define SPI_COLLISION_STATUS_SPI_COLLISION_STATUS_BIT_LEN (5U)                
#define SPI_COLLISION_STATUS_SPI_COLLISION_STATUS_BIT_MASK 0x1fU                

/******************************************************************************
* @brief Bit definitions for register RDB_STATUS
**/
#define RDB_STATUS_ID                        0x10024              
#define RDB_STATUS_LEN                       (4U)                
#define RDB_STATUS_MASK                      0xFFFFFFFFUL        
#define RDB_STATUS_CP_ERR1_BIT_OFFSET        (7U)                
#define RDB_STATUS_CP_ERR1_BIT_LEN           (1U)                
#define RDB_STATUS_CP_ERR1_BIT_MASK          0x80U                
#define RDB_STATUS_CIADONE1_BIT_OFFSET       (6U)                
#define RDB_STATUS_CIADONE1_BIT_LEN          (1U)                
#define RDB_STATUS_CIADONE1_BIT_MASK         0x40U                
#define RDB_STATUS_RXFR1_BIT_OFFSET          (5U)                
#define RDB_STATUS_RXFR1_BIT_LEN             (1U)                
#define RDB_STATUS_RXFR1_BIT_MASK            0x20U                
#define RDB_STATUS_RXFCG1_BIT_OFFSET         (4U)                
#define RDB_STATUS_RXFCG1_BIT_LEN            (1U)                
#define RDB_STATUS_RXFCG1_BIT_MASK           0x10U                
#define RDB_STATUS_CP_ERR0_BIT_OFFSET        (3U)                
#define RDB_STATUS_CP_ERR0_BIT_LEN           (1U)                
#define RDB_STATUS_CP_ERR0_BIT_MASK          0x8U                 
#define RDB_STATUS_CIADONE0_BIT_OFFSET       (2U)                
#define RDB_STATUS_CIADONE0_BIT_LEN          (1U)                
#define RDB_STATUS_CIADONE0_BIT_MASK         0x4U                 
#define RDB_STATUS_RXFR0_BIT_OFFSET          (1U)                
#define RDB_STATUS_RXFR0_BIT_LEN             (1U)                
#define RDB_STATUS_RXFR0_BIT_MASK            0x2U                 
#define RDB_STATUS_RXFCG0_BIT_OFFSET         (0U)                
#define RDB_STATUS_RXFCG0_BIT_LEN            (1U)                
#define RDB_STATUS_RXFCG0_BIT_MASK           0x1U                 

