tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register RDB_DIAG_MODE
**/
#define RDB_DIAG_MODE_ID                     0x10028              
#define RDB_DIAG_MODE_LEN                    (4U)                
#define RDB_DIAG_MODE_MASK                   0xFFFFFFFFUL        
#define RDB_DIAG_MODE_RDB_DIAG_MODE_BIT_OFFSET (0U)                
#define RDB_DIAG_MODE_RDB_DIAG_MODE_BIT_LEN  (3U)                
#define RDB_DIAG_MODE_RDB_DIAG_MODE_BIT_MASK 0x7U                 

/******************************************************************************
* @brief Bit definitions for register REGMAP_VER
**/
#define REGMAP_VER_ID                        0x1002c              
#define REGMAP_VER_LEN                       (4U)                
#define REGMAP_VER_MASK                      0xFFFFFFFFUL        
#define REGMAP_VER_REGMAP_VER_BIT_OFFSET     (0U)                
#define REGMAP_VER_REGMAP_VER_BIT_LEN        (32U)               
#define REGMAP_VER_REGMAP_VER_BIT_MASK       0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register AES_CFG
**/
#define AES_CFG_ID                           0x10030              
#define AES_CFG_LEN                          (4U)                
#define AES_CFG_MASK                         0xFFFFFFFFUL        
#define AES_CFG_AES_KEY_OTP_BIT_OFFSET       (12U)               
#define AES_CFG_AES_KEY_OTP_BIT_LEN          (1U)                
#define AES_CFG_AES_KEY_OTP_BIT_MASK         0x1000U              
#define AES_CFG_AES_CORE_SEL_BIT_OFFSET      (11U)               
#define AES_CFG_AES_CORE_SEL_BIT_LEN         (1U)                
#define AES_CFG_AES_CORE_SEL_BIT_MASK        0x800U               
#define AES_CFG_AES_TAG_SIZE_BIT_OFFSET      (8U)                
#define AES_CFG_AES_TAG_SIZE_BIT_LEN         (3U)                
#define AES_CFG_AES_TAG_SIZE_BIT_MASK        0x700U               
#define AES_CFG_AES_KEY_SRC_BIT_OFFSET       (7U)                
#define AES_CFG_AES_KEY_SRC_BIT_LEN          (1U)                
#define AES_CFG_AES_KEY_SRC_BIT_MASK         0x80U                
#define AES_CFG_AES_KEY_LOAD_BIT_OFFSET      (6U)                
#define AES_CFG_AES_KEY_LOAD_BIT_LEN         (1U)                
#define AES_CFG_AES_KEY_LOAD_BIT_MASK        0x40U                
#define AES_CFG_AES_KEY_ADDR_BIT_OFFSET      (3U)                
#define AES_CFG_AES_KEY_ADDR_BIT_LEN         (3U)                
#define AES_CFG_AES_KEY_ADDR_BIT_MASK        0x38U                
#define AES_CFG_AES_KEY_SIZE_BIT_OFFSET      (1U)                
#define AES_CFG_AES_KEY_SIZE_BIT_LEN         (2U)                
#define AES_CFG_AES_KEY_SIZE_BIT_MASK        0x6U                 
#define AES_CFG_AES_MODE_BIT_OFFSET          (0U)                
#define AES_CFG_AES_MODE_BIT_LEN             (1U)                
#define AES_CFG_AES_MODE_BIT_MASK            0x1U                 

/******************************************************************************
* @brief Bit definitions for register AES_IV0
**/
#define AES_IV0_ID                           0x10034              
#define AES_IV0_LEN                          (4U)                
#define AES_IV0_MASK                         0xFFFFFFFFUL        
#define AES_IV0_IV0_BIT_OFFSET               (0U)                
#define AES_IV0_IV0_BIT_LEN                  (32U)               
#define AES_IV0_IV0_BIT_MASK                 0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register AES_IV1
**/
#define AES_IV1_ID                           0x10038              
#define AES_IV1_LEN                          (4U)                
#define AES_IV1_MASK                         0xFFFFFFFFUL        
#define AES_IV1_IV1_BIT_OFFSET               (0U)                
#define AES_IV1_IV1_BIT_LEN                  (32U)               
#define AES_IV1_IV1_BIT_MASK                 0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register AES_IV2
**/
#define AES_IV2_ID                           0x1003c              
#define AES_IV2_LEN                          (4U)                
#define AES_IV2_MASK                         0xFFFFFFFFUL        
#define AES_IV2_IV2_BIT_OFFSET               (0U)                
#define AES_IV2_IV2_BIT_LEN                  (32U)               
#define AES_IV2_IV2_BIT_MASK                 0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register AES_IV3
**/
#define AES_IV3_ID                           0x10040              
#define AES_IV3_LEN                          (4U)                
#define AES_IV3_MASK                         0xFFFFFFFFUL        
#define AES_IV3_IV3_BIT_OFFSET               (0U)                
#define AES_IV3_IV3_BIT_LEN                  (32U)               
#define AES_IV3_IV3_BIT_MASK                 0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register DMA_CFG0
**/
#define DMA_CFG0_ID                          0x10044              
#define DMA_CFG0_LEN                         (4U)                
#define DMA_CFG0_MASK                        0xFFFFFFFFUL        
#define DMA_CFG0_DMA_CP_END_SEL_BIT_OFFSET   (26U)               
#define DMA_CFG0_DMA_CP_END_SEL_BIT_LEN      (1U)                
#define DMA_CFG0_DMA_CP_END_SEL_BIT_MASK     0x4000000UL          
#define DMA_CFG0_DMA_DST_ADDR_BIT_OFFSET     (16U)               
#define DMA_CFG0_DMA_DST_ADDR_BIT_LEN        (10U)               
#define DMA_CFG0_DMA_DST_ADDR_BIT_MASK       0x3ff0000UL          
#define DMA_CFG0_DMA_DST_PORT_BIT_OFFSET     (13U)               
#define DMA_CFG0_DMA_DST_PORT_BIT_LEN        (3U)                
#define DMA_CFG0_DMA_DST_PORT_BIT_MASK       0xe000U              
#define DMA_CFG0_DMA_SRC_ADDR_BIT_OFFSET     (3U)                
#define DMA_CFG0_DMA_SRC_ADDR_BIT_LEN        (10U)               
#define DMA_CFG0_DMA_SRC_ADDR_BIT_MASK       0x1ff8U              
#define DMA_CFG0_DMA_SRC_PORT_BIT_OFFSET     (0U)                
#define DMA_CFG0_DMA_SRC_PORT_BIT_LEN        (3U)                
#define DMA_CFG0_DMA_SRC_PORT_BIT_MASK       0x7U                 

