tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register DMA_CFG1
**/
#define DMA_CFG1_ID                          0x10048              
#define DMA_CFG1_LEN                         (4U)                
#define DMA_CFG1_MASK                        0xFFFFFFFFUL        
#define DMA_CFG1_DMA_PYLD_SIZE_BIT_OFFSET    (7U)                
#define DMA_CFG1_DMA_PYLD_SIZE_BIT_LEN       (10U)               
#define DMA_CFG1_DMA_PYLD_SIZE_BIT_MASK      0x1ff80UL            
#define DMA_CFG1_DMA_HDR_SIZE_BIT_OFFSET     (0U)                
#define DMA_CFG1_DMA_HDR_SIZE_BIT_LEN        (7U)                
#define DMA_CFG1_DMA_HDR_SIZE_BIT_MASK       0x7fU                

/******************************************************************************
* @brief Bit definitions for register AES_START
**/
#define AES_START_ID                         0x1004c              
#define AES_START_LEN                        (4U)                
#define AES_START_MASK                       0xFFFFFFFFUL        
#define AES_START_AES_START_BIT_OFFSET       (0U)                
#define AES_START_AES_START_BIT_LEN          (1U)                
#define AES_START_AES_START_BIT_MASK         0x1U                 

/******************************************************************************
* @brief Bit definitions for register AES_STS
**/
#define AES_STS_ID                           0x10050              
#define AES_STS_LEN                          (4U)                
#define AES_STS_MASK                         0xFFFFFFFFUL        
#define AES_STS_AES_SCRATCH_RAM_FULL_BIT_OFFSET (5U)                
#define AES_STS_AES_SCRATCH_RAM_FULL_BIT_LEN (1U)                
#define AES_STS_AES_SCRATCH_RAM_FULL_BIT_MASK 0x20U                
#define AES_STS_AES_SCRATCH_RAM_EMPTY_BIT_OFFSET (4U)                
#define AES_STS_AES_SCRATCH_RAM_EMPTY_BIT_LEN (1U)                
#define AES_STS_AES_SCRATCH_RAM_EMPTY_BIT_MASK 0x10U                
#define AES_STS_MEM_ACC_CONF_BIT_OFFSET      (3U)                
#define AES_STS_MEM_ACC_CONF_BIT_LEN         (1U)                
#define AES_STS_MEM_ACC_CONF_BIT_MASK        0x8U                 
#define AES_STS_DMA_TRANS_ERR_BIT_OFFSET     (2U)                
#define AES_STS_DMA_TRANS_ERR_BIT_LEN        (1U)                
#define AES_STS_DMA_TRANS_ERR_BIT_MASK       0x4U                 
#define AES_STS_AES_AUTH_ERR_BIT_OFFSET      (1U)                
#define AES_STS_AES_AUTH_ERR_BIT_LEN         (1U)                
#define AES_STS_AES_AUTH_ERR_BIT_MASK        0x2U                 
#define AES_STS_AES_DONE_BIT_OFFSET          (0U)                
#define AES_STS_AES_DONE_BIT_LEN             (1U)                
#define AES_STS_AES_DONE_BIT_MASK            0x1U                 

/******************************************************************************
* @brief Bit definitions for register AES_KEY0
**/
#define AES_KEY0_ID                          0x10054              
#define AES_KEY0_LEN                         (4U)                
#define AES_KEY0_MASK                        0xFFFFFFFFUL        
#define AES_KEY0_KEY0_BIT_OFFSET             (0U)                
#define AES_KEY0_KEY0_BIT_LEN                (32U)               
#define AES_KEY0_KEY0_BIT_MASK               0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register AES_KEY1
**/
#define AES_KEY1_ID                          0x10058              
#define AES_KEY1_LEN                         (4U)                
#define AES_KEY1_MASK                        0xFFFFFFFFUL        
#define AES_KEY1_KEY1_BIT_OFFSET             (0U)                
#define AES_KEY1_KEY1_BIT_LEN                (32U)               
#define AES_KEY1_KEY1_BIT_MASK               0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register AES_KEY2
**/
#define AES_KEY2_ID                          0x1005c              
#define AES_KEY2_LEN                         (4U)                
#define AES_KEY2_MASK                        0xFFFFFFFFUL        
#define AES_KEY2_KEY2_BIT_OFFSET             (0U)                
#define AES_KEY2_KEY2_BIT_LEN                (32U)               
#define AES_KEY2_KEY2_BIT_MASK               0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register AES_KEY3
**/
#define AES_KEY3_ID                          0x10060              
#define AES_KEY3_LEN                         (4U)                
#define AES_KEY3_MASK                        0xFFFFFFFFUL        
#define AES_KEY3_KEY3_BIT_OFFSET             (0U)                
#define AES_KEY3_KEY3_BIT_LEN                (32U)               
#define AES_KEY3_KEY3_BIT_MASK               0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register CP_CFG0
**/
#define CP_CFG0_ID                           0x20000              
#define CP_CFG0_LEN                          (4U)                
#define CP_CFG0_MASK                         0xFFFFFFFFUL        
#define CP_CFG0_CP_USER_MASK_BIT_OFFSET      (16U)               
#define CP_CFG0_CP_USER_MASK_BIT_LEN         (1U)                
#define CP_CFG0_CP_USER_MASK_BIT_MASK        0x10000UL            
#define CP_CFG0_CP_COUNTER_MODE_BIT_OFFSET   (14U)               
#define CP_CFG0_CP_COUNTER_MODE_BIT_LEN      (2U)                
#define CP_CFG0_CP_COUNTER_MODE_BIT_MASK     0xc000U              
#define CP_CFG0_CP_CIR_SHFT_BIT_OFFSET       (13U)               
#define CP_CFG0_CP_CIR_SHFT_BIT_LEN          (1U)                
#define CP_CFG0_CP_CIR_SHFT_BIT_MASK         0x2000U              
#define CP_CFG0_CP_LCSS_BTF_BIT_OFFSET       (8U)                
#define CP_CFG0_CP_LCSS_BTF_BIT_LEN          (5U)                
#define CP_CFG0_CP_LCSS_BTF_BIT_MASK         0x1f00U              
#define CP_CFG0_CP_BLOCKS_BIT_OFFSET         (0U)                
#define CP_CFG0_CP_BLOCKS_BIT_LEN            (8U)                
#define CP_CFG0_CP_BLOCKS_BIT_MASK           0xffU                

