tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register CP_CTRL
**/
#define CP_CTRL_ID                           0x20004              
#define CP_CTRL_LEN                          (4U)                
#define CP_CTRL_MASK                         0xFFFFFFFFUL        
#define CP_CTRL_CP_RESTART_FROM_LAST_BIT_OFFSET (1U)                
#define CP_CTRL_CP_RESTART_FROM_LAST_BIT_LEN (1U)                
#define CP_CTRL_CP_RESTART_FROM_LAST_BIT_MASK 0x2U                 
#define CP_CTRL_CP_LOAD_IV_BIT_OFFSET        (0U)                
#define CP_CTRL_CP_LOAD_IV_BIT_LEN           (1U)                
#define CP_CTRL_CP_LOAD_IV_BIT_MASK          0x1U                 

/******************************************************************************
* @brief Bit definitions for register CP_STS
**/
#define CP_STS_ID                            0x20008              
#define CP_STS_LEN                           (4U)                
#define CP_STS_MASK                          0xFFFFFFFFUL        
#define CP_STS_ACC_QUAL_BIT_OFFSET           (0U)                
#define CP_STS_ACC_QUAL_BIT_LEN              (12U)               
#define CP_STS_ACC_QUAL_BIT_MASK             0xfffU               

/******************************************************************************
* @brief Bit definitions for register CP_KEY0
**/
#define CP_KEY0_ID                           0x2000c              
#define CP_KEY0_LEN                          (4U)                
#define CP_KEY0_MASK                         0xFFFFFFFFUL        
#define CP_KEY0_KEY0_BIT_OFFSET              (0U)                
#define CP_KEY0_KEY0_BIT_LEN                 (32U)               
#define CP_KEY0_KEY0_BIT_MASK                0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register CP_KEY1
**/
#define CP_KEY1_ID                           0x20010              
#define CP_KEY1_LEN                          (4U)                
#define CP_KEY1_MASK                         0xFFFFFFFFUL        
#define CP_KEY1_KEY1_BIT_OFFSET              (0U)                
#define CP_KEY1_KEY1_BIT_LEN                 (32U)               
#define CP_KEY1_KEY1_BIT_MASK                0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register CP_KEY2
**/
#define CP_KEY2_ID                           0x20014              
#define CP_KEY2_LEN                          (4U)                
#define CP_KEY2_MASK                         0xFFFFFFFFUL        
#define CP_KEY2_KEY2_BIT_OFFSET              (0U)                
#define CP_KEY2_KEY2_BIT_LEN                 (32U)               
#define CP_KEY2_KEY2_BIT_MASK                0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register CP_KEY3
**/
#define CP_KEY3_ID                           0x20018              
#define CP_KEY3_LEN                          (4U)                
#define CP_KEY3_MASK                         0xFFFFFFFFUL        
#define CP_KEY3_KEY3_BIT_OFFSET              (0U)                
#define CP_KEY3_KEY3_BIT_LEN                 (32U)               
#define CP_KEY3_KEY3_BIT_MASK                0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register CP_IV0
**/
#define CP_IV0_ID                            0x2001c              
#define CP_IV0_LEN                           (4U)                
#define CP_IV0_MASK                          0xFFFFFFFFUL        
#define CP_IV0_IV0_BIT_OFFSET                (0U)                
#define CP_IV0_IV0_BIT_LEN                   (32U)               
#define CP_IV0_IV0_BIT_MASK                  0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register CP_IV1
**/
#define CP_IV1_ID                            0x20020              
#define CP_IV1_LEN                           (4U)                
#define CP_IV1_MASK                          0xFFFFFFFFUL        
#define CP_IV1_IV1_BIT_OFFSET                (0U)                
#define CP_IV1_IV1_BIT_LEN                   (32U)               
#define CP_IV1_IV1_BIT_MASK                  0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register CP_IV2
**/
#define CP_IV2_ID                            0x20024              
#define CP_IV2_LEN                           (4U)                
#define CP_IV2_MASK                          0xFFFFFFFFUL        
#define CP_IV2_IV2_BIT_OFFSET                (0U)                
#define CP_IV2_IV2_BIT_LEN                   (32U)               
#define CP_IV2_IV2_BIT_MASK                  0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register CP_IV3
**/
#define CP_IV3_ID                            0x20028              
#define CP_IV3_LEN                           (4U)                
#define CP_IV3_MASK                          0xFFFFFFFFUL        
#define CP_IV3_IV3_BIT_OFFSET                (0U)                
#define CP_IV3_IV3_BIT_LEN                   (32U)               
#define CP_IV3_IV3_BIT_MASK                  0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register USER_MASK0
**/
#define USER_MASK0_ID                        0x2002c              
#define USER_MASK0_LEN                       (4U)                
#define USER_MASK0_MASK                      0xFFFFFFFFUL        
#define USER_MASK0_UMASK0L_BIT_OFFSET        (0U)                
#define USER_MASK0_UMASK0L_BIT_LEN           (32U)               
#define USER_MASK0_UMASK0L_BIT_MASK          0xffffffffUL         

