tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register USER_MASK1
**/
#define USER_MASK1_ID                        0x20030              
#define USER_MASK1_LEN                       (4U)                
#define USER_MASK1_MASK                      0xFFFFFFFFUL        
#define USER_MASK1_UMASK0M_BIT_OFFSET        (0U)                
#define USER_MASK1_UMASK0M_BIT_LEN           (32U)               
#define USER_MASK1_UMASK0M_BIT_MASK          0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register LCSS_MARGIN
**/
#define LCSS_MARGIN_ID                       0x20034              
#define LCSS_MARGIN_LEN                      (4U)                
#define LCSS_MARGIN_MASK                     0xFFFFFFFFUL        
#define LCSS_MARGIN_PRF64_BIT_OFFSET         (0U)                
#define LCSS_MARGIN_PRF64_BIT_LEN            (6U)                
#define LCSS_MARGIN_PRF64_BIT_MASK           0x3fU                

/******************************************************************************
* @brief Bit definitions for register MRX
**/
#define MRX_ID                               0x30000              
#define MRX_LEN                              (4U)                
#define MRX_MASK                             0xFFFFFFFFUL        
#define MRX_CFG_PGF_0_BIT_OFFSET             (8U)                
#define MRX_CFG_PGF_0_BIT_LEN                (5U)                
#define MRX_CFG_PGF_0_BIT_MASK               0x1f00U              
#define MRX_CFG_SWAP_IQ_BIT_OFFSET           (4U)                
#define MRX_CFG_SWAP_IQ_BIT_LEN              (1U)                
#define MRX_CFG_SWAP_IQ_BIT_MASK             0x10U                
#define MRX_CFG_ADC_NEGEDGE_BIT_OFFSET       (2U)                
#define MRX_CFG_ADC_NEGEDGE_BIT_LEN          (1U)                
#define MRX_CFG_ADC_NEGEDGE_BIT_MASK         0x4U                 
#define MRX_CFG_ADC_SAMPLE_REVERSE_BIT_OFFSET (1U)                
#define MRX_CFG_ADC_SAMPLE_REVERSE_BIT_LEN   (1U)                
#define MRX_CFG_ADC_SAMPLE_REVERSE_BIT_MASK  0x2U                 
#define MRX_CFG_FREEZE_DIAGNOSTICS_BIT_OFFSET (0U)                
#define MRX_CFG_FREEZE_DIAGNOSTICS_BIT_LEN   (1U)                
#define MRX_CFG_FREEZE_DIAGNOSTICS_BIT_MASK  0x1U                 

/******************************************************************************
* @brief Bit definitions for register MRX_PGF_LUT
**/
#define MRX_PGF_LUT_ID                       0x30004              
#define MRX_PGF_LUT_LEN                      (4U)                
#define MRX_PGF_LUT_MASK                     0xFFFFFFFFUL        
#define MRX_PGF_LUT_CFG_PGF_6_BIT_OFFSET     (25U)               
#define MRX_PGF_LUT_CFG_PGF_6_BIT_LEN        (5U)                
#define MRX_PGF_LUT_CFG_PGF_6_BIT_MASK       0x3e000000UL         
#define MRX_PGF_LUT_CFG_PGF_5_BIT_OFFSET     (20U)               
#define MRX_PGF_LUT_CFG_PGF_5_BIT_LEN        (5U)                
#define MRX_PGF_LUT_CFG_PGF_5_BIT_MASK       0x1f00000UL          
#define MRX_PGF_LUT_CFG_PGF_4_BIT_OFFSET     (15U)               
#define MRX_PGF_LUT_CFG_PGF_4_BIT_LEN        (5U)                
#define MRX_PGF_LUT_CFG_PGF_4_BIT_MASK       0xf8000UL            
#define MRX_PGF_LUT_CFG_PGF_3_BIT_OFFSET     (10U)               
#define MRX_PGF_LUT_CFG_PGF_3_BIT_LEN        (5U)                
#define MRX_PGF_LUT_CFG_PGF_3_BIT_MASK       0x7c00U              
#define MRX_PGF_LUT_CFG_PGF_2_BIT_OFFSET     (5U)                
#define MRX_PGF_LUT_CFG_PGF_2_BIT_LEN        (5U)                
#define MRX_PGF_LUT_CFG_PGF_2_BIT_MASK       0x3e0U               
#define MRX_PGF_LUT_CFG_PGF_1_BIT_OFFSET     (0U)                
#define MRX_PGF_LUT_CFG_PGF_1_BIT_LEN        (5U)                
#define MRX_PGF_LUT_CFG_PGF_1_BIT_MASK       0x1fU                

/******************************************************************************
* @brief Bit definitions for register ADC_CFG
**/
#define ADC_CFG_ID                           0x30008              
#define ADC_CFG_LEN                          (4U)                
#define ADC_CFG_MASK                         0xFFFFFFFFUL        
#define ADC_CFG_CFG_ADC_TARGET_64_BIT_OFFSET (22U)               
#define ADC_CFG_CFG_ADC_TARGET_64_BIT_LEN    (9U)                
#define ADC_CFG_CFG_ADC_TARGET_64_BIT_MASK   0x7fc00000UL         
#define ADC_CFG_CFG_ADC_TARGET_16_BIT_OFFSET (13U)               
#define ADC_CFG_CFG_ADC_TARGET_16_BIT_LEN    (9U)                
#define ADC_CFG_CFG_ADC_TARGET_16_BIT_MASK   0x3fe000UL           
#define ADC_CFG_CFG_ADC_KI_FAST_BIT_OFFSET   (11U)               
#define ADC_CFG_CFG_ADC_KI_FAST_BIT_LEN      (2U)                
#define ADC_CFG_CFG_ADC_KI_FAST_BIT_MASK     0x1800U              
#define ADC_CFG_CFG_ADC_KP_FAST_BIT_OFFSET   (9U)                
#define ADC_CFG_CFG_ADC_KP_FAST_BIT_LEN      (2U)                
#define ADC_CFG_CFG_ADC_KP_FAST_BIT_MASK     0x600U               
#define ADC_CFG_CFG_ADC_KI_BIT_OFFSET        (7U)                
#define ADC_CFG_CFG_ADC_KI_BIT_LEN           (2U)                
#define ADC_CFG_CFG_ADC_KI_BIT_MASK          0x180U               
#define ADC_CFG_CFG_ADC_KP_BIT_OFFSET        (5U)                
#define ADC_CFG_CFG_ADC_KP_BIT_LEN           (2U)                
#define ADC_CFG_CFG_ADC_KP_BIT_MASK          0x60U                
#define ADC_CFG_SILENCE_BIT_OFFSET           (3U)                
#define ADC_CFG_SILENCE_BIT_LEN              (2U)                
#define ADC_CFG_SILENCE_BIT_MASK             0x18U                
#define ADC_CFG_OVERRIDE_BIT_OFFSET          (2U)                
#define ADC_CFG_OVERRIDE_BIT_LEN             (1U)                
#define ADC_CFG_OVERRIDE_BIT_MASK            0x4U                 
#define ADC_CFG_CFG_ADC_CYPHEROFF_BIT_OFFSET (1U)                
#define ADC_CFG_CFG_ADC_CYPHEROFF_BIT_LEN    (1U)                
#define ADC_CFG_CFG_ADC_CYPHEROFF_BIT_MASK   0x2U                 
#define ADC_CFG_CFG_ADC_DEMODOFF_BIT_OFFSET  (0U)                
#define ADC_CFG_CFG_ADC_DEMODOFF_BIT_LEN     (1U)                
#define ADC_CFG_CFG_ADC_DEMODOFF_BIT_MASK    0x1U                 

