tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register ADC_ZERO_THRESH_CFG
**/
#define ADC_ZERO_THRESH_CFG_ID               0x3000c              
#define ADC_ZERO_THRESH_CFG_LEN              (4U)                
#define ADC_ZERO_THRESH_CFG_MASK             0xFFFFFFFFUL        
#define ADC_ZERO_THRESH_CFG_CFG_ZEROTH_THRESH_Q_NEG_BIT_OFFSET (24U)               
#define ADC_ZERO_THRESH_CFG_CFG_ZEROTH_THRESH_Q_NEG_BIT_LEN (8U)                
#define ADC_ZERO_THRESH_CFG_CFG_ZEROTH_THRESH_Q_NEG_BIT_MASK 0xff000000UL         
#define ADC_ZERO_THRESH_CFG_CFG_ZEROTH_THRESH_Q_POS_BIT_OFFSET (16U)               
#define ADC_ZERO_THRESH_CFG_CFG_ZEROTH_THRESH_Q_POS_BIT_LEN (8U)                
#define ADC_ZERO_THRESH_CFG_CFG_ZEROTH_THRESH_Q_POS_BIT_MASK 0xff0000UL           
#define ADC_ZERO_THRESH_CFG_CFG_ZEROTH_THRESH_I_NEG_BIT_OFFSET (8U)                
#define ADC_ZERO_THRESH_CFG_CFG_ZEROTH_THRESH_I_NEG_BIT_LEN (8U)                
#define ADC_ZERO_THRESH_CFG_CFG_ZEROTH_THRESH_I_NEG_BIT_MASK 0xff00U              
#define ADC_ZERO_THRESH_CFG_CFG_ZEROTH_THRESH_I_POS_BIT_OFFSET (0U)                
#define ADC_ZERO_THRESH_CFG_CFG_ZEROTH_THRESH_I_POS_BIT_LEN (8U)                
#define ADC_ZERO_THRESH_CFG_CFG_ZEROTH_THRESH_I_POS_BIT_MASK 0xffU                

/******************************************************************************
* @brief Bit definitions for register ADC_THRESH_CFG
**/
#define ADC_THRESH_CFG_ID                    0x30010              
#define ADC_THRESH_CFG_LEN                   (4U)                
#define ADC_THRESH_CFG_MASK                  0xFFFFFFFFUL        
#define ADC_THRESH_CFG_CFG_OVRD_ADC_THRESH_Q_NEG_BIT_OFFSET (24U)               
#define ADC_THRESH_CFG_CFG_OVRD_ADC_THRESH_Q_NEG_BIT_LEN (8U)                
#define ADC_THRESH_CFG_CFG_OVRD_ADC_THRESH_Q_NEG_BIT_MASK 0xff000000UL         
#define ADC_THRESH_CFG_CFG_OVRD_ADC_THRESH_Q_POS_BIT_OFFSET (16U)               
#define ADC_THRESH_CFG_CFG_OVRD_ADC_THRESH_Q_POS_BIT_LEN (8U)                
#define ADC_THRESH_CFG_CFG_OVRD_ADC_THRESH_Q_POS_BIT_MASK 0xff0000UL           
#define ADC_THRESH_CFG_CFG_OVRD_ADC_THRESH_I_NEG_BIT_OFFSET (8U)                
#define ADC_THRESH_CFG_CFG_OVRD_ADC_THRESH_I_NEG_BIT_LEN (8U)                
#define ADC_THRESH_CFG_CFG_OVRD_ADC_THRESH_I_NEG_BIT_MASK 0xff00U              
#define ADC_THRESH_CFG_CFG_OVRD_ADC_THRESH_I_POS_BIT_OFFSET (0U)                
#define ADC_THRESH_CFG_CFG_OVRD_ADC_THRESH_I_POS_BIT_LEN (8U)                
#define ADC_THRESH_CFG_CFG_OVRD_ADC_THRESH_I_POS_BIT_MASK 0xffU                

/******************************************************************************
* @brief Bit definitions for register AGC_CFG
**/
#define AGC_CFG_ID                           0x30014              
#define AGC_CFG_LEN                          (4U)                
#define AGC_CFG_MASK                         0xFFFFFFFFUL        
#define AGC_CFG_CFG_AGC_MAX_THR_DIFF_MODE_BIT_OFFSET (23U)               
#define AGC_CFG_CFG_AGC_MAX_THR_DIFF_MODE_BIT_LEN (1U)                
#define AGC_CFG_CFG_AGC_MAX_THR_DIFF_MODE_BIT_MASK 0x800000UL           
#define AGC_CFG_DELAY_BIT_OFFSET             (21U)               
#define AGC_CFG_DELAY_BIT_LEN                (2U)                
#define AGC_CFG_DELAY_BIT_MASK               0x600000UL           
#define AGC_CFG_TARGET_BIT_OFFSET            (12U)               
#define AGC_CFG_TARGET_BIT_LEN               (9U)                
#define AGC_CFG_TARGET_BIT_MASK              0x1ff000UL           
#define AGC_CFG_CFG_AGC_SCALING_BIT_OFFSET   (11U)               
#define AGC_CFG_CFG_AGC_SCALING_BIT_LEN      (1U)                
#define AGC_CFG_CFG_AGC_SCALING_BIT_MASK     0x800U               
#define AGC_CFG_CFG_AGC_KI_BIT_OFFSET        (9U)                
#define AGC_CFG_CFG_AGC_KI_BIT_LEN           (2U)                
#define AGC_CFG_CFG_AGC_KI_BIT_MASK          0x600U               
#define AGC_CFG_KP_BIT_OFFSET                (7U)                
#define AGC_CFG_KP_BIT_LEN                   (2U)                
#define AGC_CFG_KP_BIT_MASK                  0x180U               
#define AGC_CFG_OVERRIDE_BIT_OFFSET          (6U)                
#define AGC_CFG_OVERRIDE_BIT_LEN             (1U)                
#define AGC_CFG_OVERRIDE_BIT_MASK            0x40U                
#define AGC_CFG_CFG_OVRD_PGF_GAIN_BIT_OFFSET (3U)                
#define AGC_CFG_CFG_OVRD_PGF_GAIN_BIT_LEN    (3U)                
#define AGC_CFG_CFG_OVRD_PGF_GAIN_BIT_MASK   0x38U                
#define AGC_CFG_PREOFF_BIT_OFFSET            (2U)                
#define AGC_CFG_PREOFF_BIT_LEN               (1U)                
#define AGC_CFG_PREOFF_BIT_MASK              0x4U                 
#define AGC_CFG_PREDETOFF_BIT_OFFSET         (1U)                
#define AGC_CFG_PREDETOFF_BIT_LEN            (1U)                
#define AGC_CFG_PREDETOFF_BIT_MASK           0x2U                 
#define AGC_CFG_CFG_AGC_ENABLE_BIT_OFFSET    (0U)                
#define AGC_CFG_CFG_AGC_ENABLE_BIT_LEN       (1U)                
#define AGC_CFG_CFG_AGC_ENABLE_BIT_MASK      0x1U                 

/******************************************************************************
* @brief Bit definitions for register DGC_CFG
**/
#define DGC_CFG_ID                           0x30018              
#define DGC_CFG_LEN                          (4U)                
#define DGC_CFG_MASK                         0xFFFFFFFFUL        
#define DGC_CFG_DGC_TXRX_SWITCH_TEST_BIT_OFFSET (30U)               
#define DGC_CFG_DGC_TXRX_SWITCH_TEST_BIT_LEN (1U)                
#define DGC_CFG_DGC_TXRX_SWITCH_TEST_BIT_MASK 0x40000000UL         
#define DGC_CFG_CFG_SYM_TO_SKIP_BIT_OFFSET   (27U)               
#define DGC_CFG_CFG_SYM_TO_SKIP_BIT_LEN      (3U)                
#define DGC_CFG_CFG_SYM_TO_SKIP_BIT_MASK     0x38000000UL         
#define DGC_CFG_CFG_CORRELATOR_THR_16_BIT_OFFSET (21U)               
#define DGC_CFG_CFG_CORRELATOR_THR_16_BIT_LEN (6U)                
#define DGC_CFG_CFG_CORRELATOR_THR_16_BIT_MASK 0x7e00000UL          
#define DGC_CFG_CFG_ACCUMULATOR_THR_16_BIT_OFFSET (15U)               
#define DGC_CFG_CFG_ACCUMULATOR_THR_16_BIT_LEN (6U)                
#define DGC_CFG_CFG_ACCUMULATOR_THR_16_BIT_MASK 0x1f8000UL           
#define DGC_CFG_CFG_CORRELATOR_THR_64_BIT_OFFSET (9U)                
#define DGC_CFG_CFG_CORRELATOR_THR_64_BIT_LEN (6U)                
#define DGC_CFG_CFG_CORRELATOR_THR_64_BIT_MASK 0x7e00U              
#define DGC_CFG_CFG_ACCUMULATOR_THR_64_BIT_OFFSET (3U)                
#define DGC_CFG_CFG_ACCUMULATOR_THR_64_BIT_LEN (6U)                
#define DGC_CFG_CFG_ACCUMULATOR_THR_64_BIT_MASK 0x1f8U               
#define DGC_CFG_CFG_USE_2ND_DECISION_BIT_OFFSET (2U)                
#define DGC_CFG_CFG_USE_2ND_DECISION_BIT_LEN (1U)                
#define DGC_CFG_CFG_USE_2ND_DECISION_BIT_MASK 0x4U                 
#define DGC_CFG_CFG_USE_NRG_DETECTOR_BIT_OFFSET (1U)                
#define DGC_CFG_CFG_USE_NRG_DETECTOR_BIT_LEN (1U)                
#define DGC_CFG_CFG_USE_NRG_DETECTOR_BIT_MASK 0x2U                 
#define DGC_CFG_CFG_DGC_EN_BIT_OFFSET        (0U)                
#define DGC_CFG_CFG_DGC_EN_BIT_LEN           (1U)                
#define DGC_CFG_CFG_DGC_EN_BIT_MASK          0x1U                 

