tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register DGC_ACC_CORR_LUT_CFG
**/
#define DGC_ACC_CORR_LUT_CFG_ID              0x3001c              
#define DGC_ACC_CORR_LUT_CFG_LEN             (4U)                
#define DGC_ACC_CORR_LUT_CFG_MASK            0xFFFFFFFFUL        

/******************************************************************************
* @brief Bit definitions for register DGC_CORR_LUT_7_16_CFG
**/
#define DGC_CORR_LUT_7_16_CFG_ID             0x30020              
#define DGC_CORR_LUT_7_16_CFG_LEN            (4U)                
#define DGC_CORR_LUT_7_16_CFG_MASK           0xFFFFFFFFUL        
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_16_BIT_OFFSET (27U)               
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_16_BIT_LEN (3U)                
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_16_BIT_MASK 0x38000000UL         
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_15_BIT_OFFSET (24U)               
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_15_BIT_LEN (3U)                
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_15_BIT_MASK 0x7000000UL          
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_14_BIT_OFFSET (21U)               
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_14_BIT_LEN (3U)                
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_14_BIT_MASK 0xe00000UL           
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_13_BIT_OFFSET (18U)               
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_13_BIT_LEN (3U)                
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_13_BIT_MASK 0x1c0000UL           
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_12_BIT_OFFSET (15U)               
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_12_BIT_LEN (3U)                
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_12_BIT_MASK 0x38000UL            
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_11_BIT_OFFSET (12U)               
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_11_BIT_LEN (3U)                
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_11_BIT_MASK 0x7000U              
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_10_BIT_OFFSET (9U)                
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_10_BIT_LEN (3U)                
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_10_BIT_MASK 0xe00U               
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_9_BIT_OFFSET (6U)                
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_9_BIT_LEN (3U)                
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_9_BIT_MASK 0x1c0U               
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_8_BIT_OFFSET (3U)                
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_8_BIT_LEN (3U)                
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_8_BIT_MASK 0x38U                
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_7_BIT_OFFSET (0U)                
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_7_BIT_LEN (3U)                
#define DGC_CORR_LUT_7_16_CFG_CFG_CORR_LUT_7_BIT_MASK 0x7U                 

/******************************************************************************
* @brief Bit definitions for register DGC_CORR_LUT_17_26_CFG
**/
#define DGC_CORR_LUT_17_26_CFG_ID            0x30024              
#define DGC_CORR_LUT_17_26_CFG_LEN           (4U)                
#define DGC_CORR_LUT_17_26_CFG_MASK          0xFFFFFFFFUL        
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_26_BIT_OFFSET (27U)               
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_26_BIT_LEN (3U)                
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_26_BIT_MASK 0x38000000UL         
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_25_BIT_OFFSET (24U)               
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_25_BIT_LEN (3U)                
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_25_BIT_MASK 0x7000000UL          
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_24_BIT_OFFSET (21U)               
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_24_BIT_LEN (3U)                
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_24_BIT_MASK 0xe00000UL           
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_23_BIT_OFFSET (18U)               
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_23_BIT_LEN (3U)                
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_23_BIT_MASK 0x1c0000UL           
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_22_BIT_OFFSET (15U)               
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_22_BIT_LEN (3U)                
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_22_BIT_MASK 0x38000UL            
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_21_BIT_OFFSET (12U)               
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_21_BIT_LEN (3U)                
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_21_BIT_MASK 0x7000U              
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_20_BIT_OFFSET (9U)                
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_20_BIT_LEN (3U)                
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_20_BIT_MASK 0xe00U               
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_19_BIT_OFFSET (6U)                
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_19_BIT_LEN (3U)                
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_19_BIT_MASK 0x1c0U               
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_18_BIT_OFFSET (3U)                
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_18_BIT_LEN (3U)                
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_18_BIT_MASK 0x38U                
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_17_BIT_OFFSET (0U)                
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_17_BIT_LEN (3U)                
#define DGC_CORR_LUT_17_26_CFG_CFG_CORR_LUT_17_BIT_MASK 0x7U                 

/******************************************************************************
* @brief Bit definitions for register DGC_CORR_NRG_LUT_CFG
**/
#define DGC_CORR_NRG_LUT_CFG_ID              0x30028              
#define DGC_CORR_NRG_LUT_CFG_LEN             (4U)                
#define DGC_CORR_NRG_LUT_CFG_MASK            0xFFFFFFFFUL        
#define DGC_CORR_NRG_LUT_CFG_CFG_NRG_LUT_4_BIT_OFFSET (27U)               
#define DGC_CORR_NRG_LUT_CFG_CFG_NRG_LUT_4_BIT_LEN (3U)                
#define DGC_CORR_NRG_LUT_CFG_CFG_NRG_LUT_4_BIT_MASK 0x38000000UL         
#define DGC_CORR_NRG_LUT_CFG_CFG_NRG_LUT_3_BIT_OFFSET (24U)               
#define DGC_CORR_NRG_LUT_CFG_CFG_NRG_LUT_3_BIT_LEN (3U)                
#define DGC_CORR_NRG_LUT_CFG_CFG_NRG_LUT_3_BIT_MASK 0x7000000UL          
#define DGC_CORR_NRG_LUT_CFG_CFG_NRG_LUT_2_BIT_OFFSET (21U)               
#define DGC_CORR_NRG_LUT_CFG_CFG_NRG_LUT_2_BIT_LEN (3U)                
#define DGC_CORR_NRG_LUT_CFG_CFG_NRG_LUT_2_BIT_MASK 0xe00000UL           
#define DGC_CORR_NRG_LUT_CFG_CFG_NRG_LUT_1_BIT_OFFSET (18U)               
#define DGC_CORR_NRG_LUT_CFG_CFG_NRG_LUT_1_BIT_LEN (3U)                
#define DGC_CORR_NRG_LUT_CFG_CFG_NRG_LUT_1_BIT_MASK 0x1c0000UL           
#define DGC_CORR_NRG_LUT_CFG_CFG_NRG_LUT_0_BIT_OFFSET (15U)               
#define DGC_CORR_NRG_LUT_CFG_CFG_NRG_LUT_0_BIT_LEN (3U)                
#define DGC_CORR_NRG_LUT_CFG_CFG_NRG_LUT_0_BIT_MASK 0x38000UL            
#define DGC_CORR_NRG_LUT_CFG_CFG_CORR_LUT_31_BIT_OFFSET (12U)               
#define DGC_CORR_NRG_LUT_CFG_CFG_CORR_LUT_31_BIT_LEN (3U)                
#define DGC_CORR_NRG_LUT_CFG_CFG_CORR_LUT_31_BIT_MASK 0x7000U              
#define DGC_CORR_NRG_LUT_CFG_CFG_CORR_LUT_30_BIT_OFFSET (9U)                
#define DGC_CORR_NRG_LUT_CFG_CFG_CORR_LUT_30_BIT_LEN (3U)                
#define DGC_CORR_NRG_LUT_CFG_CFG_CORR_LUT_30_BIT_MASK 0xe00U               
#define DGC_CORR_NRG_LUT_CFG_CFG_CORR_LUT_29_BIT_OFFSET (6U)                
#define DGC_CORR_NRG_LUT_CFG_CFG_CORR_LUT_29_BIT_LEN (3U)                
#define DGC_CORR_NRG_LUT_CFG_CFG_CORR_LUT_29_BIT_MASK 0x1c0U               
#define DGC_CORR_NRG_LUT_CFG_CFG_CORR_LUT_28_BIT_OFFSET (3U)                
#define DGC_CORR_NRG_LUT_CFG_CFG_CORR_LUT_28_BIT_LEN (3U)                
#define DGC_CORR_NRG_LUT_CFG_CFG_CORR_LUT_28_BIT_MASK 0x38U                
#define DGC_CORR_NRG_LUT_CFG_CFG_CORR_LUT_27_BIT_OFFSET (0U)                
#define DGC_CORR_NRG_LUT_CFG_CFG_CORR_LUT_27_BIT_LEN (3U)                
#define DGC_CORR_NRG_LUT_CFG_CFG_CORR_LUT_27_BIT_MASK 0x7U                 

