tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register DGC_DGC_LUT_0_CFG
**/
#define DGC_DGC_LUT_0_CFG_ID                 0x30038              
#define DGC_DGC_LUT_0_CFG_LEN                (4U)                
#define DGC_DGC_LUT_0_CFG_MASK               0xFFFFFFFFUL        
#define DGC_DGC_LUT_0_CFG_CFG_DGC_LUT_0_BIT_OFFSET (0U)                
#define DGC_DGC_LUT_0_CFG_CFG_DGC_LUT_0_BIT_LEN (18U)               
#define DGC_DGC_LUT_0_CFG_CFG_DGC_LUT_0_BIT_MASK 0x3ffffUL            

/******************************************************************************
* @brief Bit definitions for register DGC_DGC_LUT_1_CFG
**/
#define DGC_DGC_LUT_1_CFG_ID                 0x3003c              
#define DGC_DGC_LUT_1_CFG_LEN                (4U)                
#define DGC_DGC_LUT_1_CFG_MASK               0xFFFFFFFFUL        
#define DGC_DGC_LUT_1_CFG_CFG_DGC_LUT_1_BIT_OFFSET (0U)                
#define DGC_DGC_LUT_1_CFG_CFG_DGC_LUT_1_BIT_LEN (18U)               
#define DGC_DGC_LUT_1_CFG_CFG_DGC_LUT_1_BIT_MASK 0x3ffffUL            

/******************************************************************************
* @brief Bit definitions for register DGC_DGC_LUT_2_CFG
**/
#define DGC_DGC_LUT_2_CFG_ID                 0x30040              
#define DGC_DGC_LUT_2_CFG_LEN                (4U)                
#define DGC_DGC_LUT_2_CFG_MASK               0xFFFFFFFFUL        
#define DGC_DGC_LUT_2_CFG_CFG_DGC_LUT_2_BIT_OFFSET (0U)                
#define DGC_DGC_LUT_2_CFG_CFG_DGC_LUT_2_BIT_LEN (18U)               
#define DGC_DGC_LUT_2_CFG_CFG_DGC_LUT_2_BIT_MASK 0x3ffffUL            

/******************************************************************************
* @brief Bit definitions for register DGC_DGC_LUT_3_CFG
**/
#define DGC_DGC_LUT_3_CFG_ID                 0x30044              
#define DGC_DGC_LUT_3_CFG_LEN                (4U)                
#define DGC_DGC_LUT_3_CFG_MASK               0xFFFFFFFFUL        
#define DGC_DGC_LUT_3_CFG_CFG_DGC_LUT_3_BIT_OFFSET (0U)                
#define DGC_DGC_LUT_3_CFG_CFG_DGC_LUT_3_BIT_LEN (18U)               
#define DGC_DGC_LUT_3_CFG_CFG_DGC_LUT_3_BIT_MASK 0x3ffffUL            

/******************************************************************************
* @brief Bit definitions for register DGC_DGC_LUT_4_CFG
**/
#define DGC_DGC_LUT_4_CFG_ID                 0x30048              
#define DGC_DGC_LUT_4_CFG_LEN                (4U)                
#define DGC_DGC_LUT_4_CFG_MASK               0xFFFFFFFFUL        
#define DGC_DGC_LUT_4_CFG_CFG_DGC_LUT_4_BIT_OFFSET (0U)                
#define DGC_DGC_LUT_4_CFG_CFG_DGC_LUT_4_BIT_LEN (18U)               
#define DGC_DGC_LUT_4_CFG_CFG_DGC_LUT_4_BIT_MASK 0x3ffffUL            

/******************************************************************************
* @brief Bit definitions for register DGC_DGC_LUT_5_CFG
**/
#define DGC_DGC_LUT_5_CFG_ID                 0x3004c              
#define DGC_DGC_LUT_5_CFG_LEN                (4U)                
#define DGC_DGC_LUT_5_CFG_MASK               0xFFFFFFFFUL        
#define DGC_DGC_LUT_5_CFG_CFG_DGC_LUT_5_BIT_OFFSET (0U)                
#define DGC_DGC_LUT_5_CFG_CFG_DGC_LUT_5_BIT_LEN (18U)               
#define DGC_DGC_LUT_5_CFG_CFG_DGC_LUT_5_BIT_MASK 0x3ffffUL            

/******************************************************************************
* @brief Bit definitions for register DGC_DGC_LUT_6_CFG
**/
#define DGC_DGC_LUT_6_CFG_ID                 0x30050              
#define DGC_DGC_LUT_6_CFG_LEN                (4U)                
#define DGC_DGC_LUT_6_CFG_MASK               0xFFFFFFFFUL        
#define DGC_DGC_LUT_6_CFG_CFG_DGC_LUT_6_BIT_OFFSET (0U)                
#define DGC_DGC_LUT_6_CFG_CFG_DGC_LUT_6_BIT_LEN (18U)               
#define DGC_DGC_LUT_6_CFG_CFG_DGC_LUT_6_BIT_MASK 0x3ffffUL            

/******************************************************************************
* @brief Bit definitions for register DGC_MIN_METRIC_LIM_WNDW_CFG
**/
#define DGC_MIN_METRIC_LIM_WNDW_CFG_ID       0x30054              
#define DGC_MIN_METRIC_LIM_WNDW_CFG_LEN      (4U)                
#define DGC_MIN_METRIC_LIM_WNDW_CFG_MASK     0xFFFFFFFFUL        
#define DGC_MIN_METRIC_LIM_WNDW_CFG_CFG_CORR_LIM_WNDW_LEN_BIT_OFFSET (21U)               
#define DGC_MIN_METRIC_LIM_WNDW_CFG_CFG_CORR_LIM_WNDW_LEN_BIT_LEN (5U)                
#define DGC_MIN_METRIC_LIM_WNDW_CFG_CFG_CORR_LIM_WNDW_LEN_BIT_MASK 0x3e00000UL          
#define DGC_MIN_METRIC_LIM_WNDW_CFG_CFG_ACC_LIM_WNDW_LEN_BIT_OFFSET (18U)               
#define DGC_MIN_METRIC_LIM_WNDW_CFG_CFG_ACC_LIM_WNDW_LEN_BIT_LEN (3U)                
#define DGC_MIN_METRIC_LIM_WNDW_CFG_CFG_ACC_LIM_WNDW_LEN_BIT_MASK 0x1c0000UL           
#define DGC_MIN_METRIC_LIM_WNDW_CFG_CFG_LIMITED_COUNT_EN_BIT_OFFSET (17U)               
#define DGC_MIN_METRIC_LIM_WNDW_CFG_CFG_LIMITED_COUNT_EN_BIT_LEN (1U)                
#define DGC_MIN_METRIC_LIM_WNDW_CFG_CFG_LIMITED_COUNT_EN_BIT_MASK 0x20000UL            
#define DGC_MIN_METRIC_LIM_WNDW_CFG_CFG_NRG_BACKOFF_BIT_OFFSET (15U)               
#define DGC_MIN_METRIC_LIM_WNDW_CFG_CFG_NRG_BACKOFF_BIT_LEN (2U)                
#define DGC_MIN_METRIC_LIM_WNDW_CFG_CFG_NRG_BACKOFF_BIT_MASK 0x18000UL            
#define DGC_MIN_METRIC_LIM_WNDW_CFG_CFG_NRG_METRIC_MIN_BIT_OFFSET (10U)               
#define DGC_MIN_METRIC_LIM_WNDW_CFG_CFG_NRG_METRIC_MIN_BIT_LEN (5U)                
#define DGC_MIN_METRIC_LIM_WNDW_CFG_CFG_NRG_METRIC_MIN_BIT_MASK 0x7c00U              
#define DGC_MIN_METRIC_LIM_WNDW_CFG_CFG_CORR_SAT_MIN_BIT_OFFSET (4U)                
#define DGC_MIN_METRIC_LIM_WNDW_CFG_CFG_CORR_SAT_MIN_BIT_LEN (6U)                
#define DGC_MIN_METRIC_LIM_WNDW_CFG_CFG_CORR_SAT_MIN_BIT_MASK 0x3f0U               
#define DGC_MIN_METRIC_LIM_WNDW_CFG_CFG_ACC_SAT_MIN_BIT_OFFSET (0U)                
#define DGC_MIN_METRIC_LIM_WNDW_CFG_CFG_ACC_SAT_MIN_BIT_LEN (4U)                
#define DGC_MIN_METRIC_LIM_WNDW_CFG_CFG_ACC_SAT_MIN_BIT_MASK 0xfU                 

