tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register ADC_THRESH_DBG
**/
#define ADC_THRESH_DBG_ID                    0x30058              
#define ADC_THRESH_DBG_LEN                   (4U)                
#define ADC_THRESH_DBG_MASK                  0xFFFFFFFFUL        
#define ADC_THRESH_DBG_DBG_ADC_THRESH_Q_NEG_BIT_OFFSET (24U)               
#define ADC_THRESH_DBG_DBG_ADC_THRESH_Q_NEG_BIT_LEN (8U)                
#define ADC_THRESH_DBG_DBG_ADC_THRESH_Q_NEG_BIT_MASK 0xff000000UL         
#define ADC_THRESH_DBG_DBG_ADC_THRESH_Q_POS_BIT_OFFSET (16U)               
#define ADC_THRESH_DBG_DBG_ADC_THRESH_Q_POS_BIT_LEN (8U)                
#define ADC_THRESH_DBG_DBG_ADC_THRESH_Q_POS_BIT_MASK 0xff0000UL           
#define ADC_THRESH_DBG_DBG_ADC_THRESH_I_NEG_BIT_OFFSET (8U)                
#define ADC_THRESH_DBG_DBG_ADC_THRESH_I_NEG_BIT_LEN (8U)                
#define ADC_THRESH_DBG_DBG_ADC_THRESH_I_NEG_BIT_MASK 0xff00U              
#define ADC_THRESH_DBG_DBG_ADC_THRESH_I_POS_BIT_OFFSET (0U)                
#define ADC_THRESH_DBG_DBG_ADC_THRESH_I_POS_BIT_LEN (8U)                
#define ADC_THRESH_DBG_DBG_ADC_THRESH_I_POS_BIT_MASK 0xffU                

/******************************************************************************
* @brief Bit definitions for register ADC_DBG
**/
#define ADC_DBG_ID                           0x3005c              
#define ADC_DBG_LEN                          (4U)                
#define ADC_DBG_MASK                         0xFFFFFFFFUL        
#define ADC_DBG_DBG_STATS_Q_POS_BIT_OFFSET   (22U)               
#define ADC_DBG_DBG_STATS_Q_POS_BIT_LEN      (10U)               
#define ADC_DBG_DBG_STATS_Q_POS_BIT_MASK     0xffc00000UL         
#define ADC_DBG_DBG_STATS_I_NEG_BIT_OFFSET   (12U)               
#define ADC_DBG_DBG_STATS_I_NEG_BIT_LEN      (10U)               
#define ADC_DBG_DBG_STATS_I_NEG_BIT_MASK     0x3ff000UL           
#define ADC_DBG_DBG_STATS_I_POS_BIT_OFFSET   (2U)                
#define ADC_DBG_DBG_STATS_I_POS_BIT_LEN      (10U)               
#define ADC_DBG_DBG_STATS_I_POS_BIT_MASK     0xffcU               
#define ADC_DBG_AGC_STATUS_BIT_OFFSET        (0U)                
#define ADC_DBG_AGC_STATUS_BIT_LEN           (2U)                
#define ADC_DBG_AGC_STATUS_BIT_MASK          0x3U                 

/******************************************************************************
* @brief Bit definitions for register ADC_DGC_DBG
**/
#define ADC_DGC_DBG_ID                       0x30060              
#define ADC_DGC_DBG_LEN                      (4U)                
#define ADC_DGC_DBG_MASK                     0xFFFFFFFFUL        
#define ADC_DGC_DBG_DBG_SECOND_DECISION_BIT_OFFSET (28U)               
#define ADC_DGC_DBG_DBG_SECOND_DECISION_BIT_LEN (3U)                
#define ADC_DGC_DBG_DBG_SECOND_DECISION_BIT_MASK 0x70000000UL         
#define ADC_DGC_DBG_DBG_FIRST_DECISION_BIT_OFFSET (25U)               
#define ADC_DGC_DBG_DBG_FIRST_DECISION_BIT_LEN (3U)                
#define ADC_DGC_DBG_DBG_FIRST_DECISION_BIT_MASK 0xe000000UL          
#define ADC_DGC_DBG_DBG_ED_PGF_GAIN_BIT_OFFSET (22U)               
#define ADC_DGC_DBG_DBG_ED_PGF_GAIN_BIT_LEN  (3U)                
#define ADC_DGC_DBG_DBG_ED_PGF_GAIN_BIT_MASK 0x1c00000UL          
#define ADC_DGC_DBG_DBG_ED_ADC_TH_DIFF_BIT_OFFSET (13U)               
#define ADC_DGC_DBG_DBG_ED_ADC_TH_DIFF_BIT_LEN (9U)                
#define ADC_DGC_DBG_DBG_ED_ADC_TH_DIFF_BIT_MASK 0x3fe000UL           
#define ADC_DGC_DBG_DBG_PGF_GAIN_BIT_OFFSET  (10U)               
#define ADC_DGC_DBG_DBG_PGF_GAIN_BIT_LEN     (3U)                
#define ADC_DGC_DBG_DBG_PGF_GAIN_BIT_MASK    0x1c00U              
#define ADC_DGC_DBG_DBG_STATS_Q_NEG_BIT_OFFSET (0U)                
#define ADC_DGC_DBG_DBG_STATS_Q_NEG_BIT_LEN  (10U)               
#define ADC_DGC_DBG_DBG_STATS_Q_NEG_BIT_MASK 0x3ffU               

/******************************************************************************
* @brief Bit definitions for register DGC_DBG
**/
#define DGC_DBG_ID                           0x30064              
#define DGC_DBG_LEN                          (4U)                
#define DGC_DBG_MASK                         0xFFFFFFFFUL        
#define DGC_DBG_DBG_CORR_METRIC_2ND_BIT_OFFSET (20U)               
#define DGC_DBG_DBG_CORR_METRIC_2ND_BIT_LEN  (7U)                
#define DGC_DBG_DBG_CORR_METRIC_2ND_BIT_MASK 0x7f00000UL          
#define DGC_DBG_DBG_CORR_METRIC_1ST_BIT_OFFSET (13U)               
#define DGC_DBG_DBG_CORR_METRIC_1ST_BIT_LEN  (7U)                
#define DGC_DBG_DBG_CORR_METRIC_1ST_BIT_MASK 0xfe000UL            
#define DGC_DBG_DBG_ACC_METRIC_BIT_OFFSET    (9U)                
#define DGC_DBG_DBG_ACC_METRIC_BIT_LEN       (4U)                
#define DGC_DBG_DBG_ACC_METRIC_BIT_MASK      0x1e00U              
#define DGC_DBG_DBG_NRG_METRIC_BIT_OFFSET    (0U)                
#define DGC_DBG_DBG_NRG_METRIC_BIT_LEN       (9U)                
#define DGC_DBG_DBG_NRG_METRIC_BIT_MASK      0x1ffU               

/******************************************************************************
* @brief Bit definitions for register EC_CTRL
**/
#define EC_CTRL_ID                           0x40000              
#define EC_CTRL_LEN                          (4U)                
#define EC_CTRL_MASK                         0xFFFFFFFFUL        
#define EC_CTRL_SYNC_RST_N_BIT_OFFSET        (12U)               
#define EC_CTRL_SYNC_RST_N_BIT_LEN           (1U)                
#define EC_CTRL_SYNC_RST_N_BIT_MASK          0x1000U              
#define EC_CTRL_OSTR_MODE_BIT_OFFSET         (11U)               
#define EC_CTRL_OSTR_MODE_BIT_LEN            (1U)                
#define EC_CTRL_OSTR_MODE_BIT_MASK           0x800U               
#define EC_CTRL_OSTS_WAIT_BIT_OFFSET         (3U)                
#define EC_CTRL_OSTS_WAIT_BIT_LEN            (8U)                
#define EC_CTRL_OSTS_WAIT_BIT_MASK           0x7f8U               
#define EC_CTRL_CLKPLL_LCK_DET_BIT_OFFSET    (2U)                
#define EC_CTRL_CLKPLL_LCK_DET_BIT_LEN       (1U)                
#define EC_CTRL_CLKPLL_LCK_DET_BIT_MASK      0x4U                 
#define EC_CTRL_OSRS_MODE_BIT_OFFSET         (1U)                
#define EC_CTRL_OSRS_MODE_BIT_LEN            (1U)                
#define EC_CTRL_OSRS_MODE_BIT_MASK           0x2U                 
#define EC_CTRL_OSTS_MODE_BIT_OFFSET         (0U)                
#define EC_CTRL_OSTS_MODE_BIT_LEN            (1U)                
#define EC_CTRL_OSTS_MODE_BIT_MASK           0x1U                 

