tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register EC_RXTC
**/
#define EC_RXTC_ID                           0x40004              
#define EC_RXTC_LEN                          (4U)                
#define EC_RXTC_MASK                         0xFFFFFFFFUL        
#define EC_RXTC_RX_TS_EST_BIT_OFFSET         (0U)                
#define EC_RXTC_RX_TS_EST_BIT_LEN            (32U)               
#define EC_RXTC_RX_TS_EST_BIT_MASK           0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register EC_GOLP
**/
#define EC_GOLP_ID                           0x40008              
#define EC_GOLP_LEN                          (4U)                
#define EC_GOLP_MASK                         0xFFFFFFFFUL        
#define EC_GOLP_OFFSET_EXT_BIT_OFFSET        (0U)                
#define EC_GOLP_OFFSET_EXT_BIT_LEN           (6U)                
#define EC_GOLP_OFFSET_EXT_BIT_MASK          0x3fU                

/******************************************************************************
* @brief Bit definitions for register PGF_CAL_CFG
**/
#define PGF_CAL_CFG_ID                       0x4000c              
#define PGF_CAL_CFG_LEN                      (4U)                
#define PGF_CAL_CFG_MASK                     0xFFFFFFFFUL        
#define PGF_CAL_CFG_COMP_DLY_BIT_OFFSET      (16U)               
#define PGF_CAL_CFG_COMP_DLY_BIT_LEN         (4U)                
#define PGF_CAL_CFG_COMP_DLY_BIT_MASK        0xf0000UL            
#define PGF_CAL_CFG_PGF_GAIN_BIT_OFFSET      (8U)                
#define PGF_CAL_CFG_PGF_GAIN_BIT_LEN         (5U)                
#define PGF_CAL_CFG_PGF_GAIN_BIT_MASK        0x1f00U              
#define PGF_CAL_CFG_CAL_EN_BIT_OFFSET        (4U)                
#define PGF_CAL_CFG_CAL_EN_BIT_LEN           (1U)                
#define PGF_CAL_CFG_CAL_EN_BIT_MASK          0x10U                
#define PGF_CAL_CFG_PGF_MODE_BIT_OFFSET      (0U)                
#define PGF_CAL_CFG_PGF_MODE_BIT_LEN         (2U)                
#define PGF_CAL_CFG_PGF_MODE_BIT_MASK        0x3U                 

/******************************************************************************
* @brief Bit definitions for register PGF_I_CTRL0
**/
#define PGF_I_CTRL0_ID                       0x40010              
#define PGF_I_CTRL0_LEN                      (4U)                
#define PGF_I_CTRL0_MASK                     0xFFFFFFFFUL        
#define PGF_I_CTRL0_COMP_CLK_BIT_OFFSET      (8U)                
#define PGF_I_CTRL0_COMP_CLK_BIT_LEN         (1U)                
#define PGF_I_CTRL0_COMP_CLK_BIT_MASK        0x100U               
#define PGF_I_CTRL0_BQ1_SHORT_EN_BIT_OFFSET  (7U)                
#define PGF_I_CTRL0_BQ1_SHORT_EN_BIT_LEN     (1U)                
#define PGF_I_CTRL0_BQ1_SHORT_EN_BIT_MASK    0x80U                
#define PGF_I_CTRL0_BQ2_SHORT_EN_BIT_OFFSET  (6U)                
#define PGF_I_CTRL0_BQ2_SHORT_EN_BIT_LEN     (1U)                
#define PGF_I_CTRL0_BQ2_SHORT_EN_BIT_MASK    0x40U                
#define PGF_I_CTRL0_BQ3_SHORT_EN_BIT_OFFSET  (5U)                
#define PGF_I_CTRL0_BQ3_SHORT_EN_BIT_LEN     (1U)                
#define PGF_I_CTRL0_BQ3_SHORT_EN_BIT_MASK    0x20U                
#define PGF_I_CTRL0_LOAD_SHORT_EN_BIT_OFFSET (4U)                
#define PGF_I_CTRL0_LOAD_SHORT_EN_BIT_LEN    (1U)                
#define PGF_I_CTRL0_LOAD_SHORT_EN_BIT_MASK   0x10U                
#define PGF_I_CTRL0_HI_BUF_SHORT_EN_BIT_OFFSET (3U)                
#define PGF_I_CTRL0_HI_BUF_SHORT_EN_BIT_LEN  (1U)                
#define PGF_I_CTRL0_HI_BUF_SHORT_EN_BIT_MASK 0x8U                 
#define PGF_I_CTRL0_LO_BUF_SHORT_EN_BIT_OFFSET (2U)                
#define PGF_I_CTRL0_LO_BUF_SHORT_EN_BIT_LEN  (1U)                
#define PGF_I_CTRL0_LO_BUF_SHORT_EN_BIT_MASK 0x4U                 
#define PGF_I_CTRL0_HI_BUF_CAL_EN_BIT_OFFSET (1U)                
#define PGF_I_CTRL0_HI_BUF_CAL_EN_BIT_LEN    (1U)                
#define PGF_I_CTRL0_HI_BUF_CAL_EN_BIT_MASK   0x2U                 
#define PGF_I_CTRL0_LO_BUF_CAL_EN_BIT_OFFSET (0U)                
#define PGF_I_CTRL0_LO_BUF_CAL_EN_BIT_LEN    (1U)                
#define PGF_I_CTRL0_LO_BUF_CAL_EN_BIT_MASK   0x1U                 

/******************************************************************************
* @brief Bit definitions for register PGF_I_CTRL1
**/
#define PGF_I_CTRL1_ID                       0x40014              
#define PGF_I_CTRL1_LEN                      (4U)                
#define PGF_I_CTRL1_MASK                     0xFFFFFFFFUL        
#define PGF_I_CTRL1_BQ1_OS_BIT_OFFSET        (24U)               
#define PGF_I_CTRL1_BQ1_OS_BIT_LEN           (5U)                
#define PGF_I_CTRL1_BQ1_OS_BIT_MASK          0x1f000000UL         
#define PGF_I_CTRL1_BQ2_OS_BIT_OFFSET        (20U)               
#define PGF_I_CTRL1_BQ2_OS_BIT_LEN           (4U)                
#define PGF_I_CTRL1_BQ2_OS_BIT_MASK          0xf00000UL           
#define PGF_I_CTRL1_BQ3_OS_BIT_OFFSET        (16U)               
#define PGF_I_CTRL1_BQ3_OS_BIT_LEN           (4U)                
#define PGF_I_CTRL1_BQ3_OS_BIT_MASK          0xf0000UL            
#define PGF_I_CTRL1_LOAD_OS_BIT_OFFSET       (10U)               
#define PGF_I_CTRL1_LOAD_OS_BIT_LEN          (6U)                
#define PGF_I_CTRL1_LOAD_OS_BIT_MASK         0xfc00U              
#define PGF_I_CTRL1_HI_BUF_OS_BIT_OFFSET     (5U)                
#define PGF_I_CTRL1_HI_BUF_OS_BIT_LEN        (5U)                
#define PGF_I_CTRL1_HI_BUF_OS_BIT_MASK       0x3e0U               
#define PGF_I_CTRL1_LO_BUF_OS_BIT_OFFSET     (0U)                
#define PGF_I_CTRL1_LO_BUF_OS_BIT_LEN        (5U)                
#define PGF_I_CTRL1_LO_BUF_OS_BIT_MASK       0x1fU                

/******************************************************************************
* @brief Bit definitions for register PGF_Q_CTRL0
**/
#define PGF_Q_CTRL0_ID                       0x40018              
#define PGF_Q_CTRL0_LEN                      (4U)                
#define PGF_Q_CTRL0_MASK                     0xFFFFFFFFUL        
#define PGF_Q_CTRL0_COMP_CLK_BIT_OFFSET      (8U)                
#define PGF_Q_CTRL0_COMP_CLK_BIT_LEN         (1U)                
#define PGF_Q_CTRL0_COMP_CLK_BIT_MASK        0x100U               
#define PGF_Q_CTRL0_BQ1_SHORT_EN_BIT_OFFSET  (7U)                
#define PGF_Q_CTRL0_BQ1_SHORT_EN_BIT_LEN     (1U)                
#define PGF_Q_CTRL0_BQ1_SHORT_EN_BIT_MASK    0x80U                
#define PGF_Q_CTRL0_BQ2_SHORT_EN_BIT_OFFSET  (6U)                
#define PGF_Q_CTRL0_BQ2_SHORT_EN_BIT_LEN     (1U)                
#define PGF_Q_CTRL0_BQ2_SHORT_EN_BIT_MASK    0x40U                
#define PGF_Q_CTRL0_BQ3_SHORT_EN_BIT_OFFSET  (5U)                
#define PGF_Q_CTRL0_BQ3_SHORT_EN_BIT_LEN     (1U)                
#define PGF_Q_CTRL0_BQ3_SHORT_EN_BIT_MASK    0x20U                
#define PGF_Q_CTRL0_LOAD_SHORT_EN_BIT_OFFSET (4U)                
#define PGF_Q_CTRL0_LOAD_SHORT_EN_BIT_LEN    (1U)                
#define PGF_Q_CTRL0_LOAD_SHORT_EN_BIT_MASK   0x10U                
#define PGF_Q_CTRL0_HI_BUF_SHORT_EN_BIT_OFFSET (3U)                
#define PGF_Q_CTRL0_HI_BUF_SHORT_EN_BIT_LEN  (1U)                
#define PGF_Q_CTRL0_HI_BUF_SHORT_EN_BIT_MASK 0x8U                 
#define PGF_Q_CTRL0_LO_BUF_SHORT_EN_BIT_OFFSET (2U)                
#define PGF_Q_CTRL0_LO_BUF_SHORT_EN_BIT_LEN  (1U)                
#define PGF_Q_CTRL0_LO_BUF_SHORT_EN_BIT_MASK 0x4U                 
#define PGF_Q_CTRL0_HI_BUF_CAL_EN_BIT_OFFSET (1U)                
#define PGF_Q_CTRL0_HI_BUF_CAL_EN_BIT_LEN    (1U)                
#define PGF_Q_CTRL0_HI_BUF_CAL_EN_BIT_MASK   0x2U                 
#define PGF_Q_CTRL0_LO_BUF_CAL_EN_BIT_OFFSET (0U)                
#define PGF_Q_CTRL0_LO_BUF_CAL_EN_BIT_LEN    (1U)                
#define PGF_Q_CTRL0_LO_BUF_CAL_EN_BIT_MASK   0x1U                 

