tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register PGF_Q_CTRL1
**/
#define PGF_Q_CTRL1_ID                       0x4001c              
#define PGF_Q_CTRL1_LEN                      (4U)                
#define PGF_Q_CTRL1_MASK                     0xFFFFFFFFUL        
#define PGF_Q_CTRL1_BQ1_OS_BIT_OFFSET        (24U)               
#define PGF_Q_CTRL1_BQ1_OS_BIT_LEN           (5U)                
#define PGF_Q_CTRL1_BQ1_OS_BIT_MASK          0x1f000000UL         
#define PGF_Q_CTRL1_BQ2_OS_BIT_OFFSET        (20U)               
#define PGF_Q_CTRL1_BQ2_OS_BIT_LEN           (4U)                
#define PGF_Q_CTRL1_BQ2_OS_BIT_MASK          0xf00000UL           
#define PGF_Q_CTRL1_BQ3_OS_BIT_OFFSET        (16U)               
#define PGF_Q_CTRL1_BQ3_OS_BIT_LEN           (4U)                
#define PGF_Q_CTRL1_BQ3_OS_BIT_MASK          0xf0000UL            
#define PGF_Q_CTRL1_LOAD_OS_BIT_OFFSET       (10U)               
#define PGF_Q_CTRL1_LOAD_OS_BIT_LEN          (6U)                
#define PGF_Q_CTRL1_LOAD_OS_BIT_MASK         0xfc00U              
#define PGF_Q_CTRL1_HI_BUF_OS_BIT_OFFSET     (5U)                
#define PGF_Q_CTRL1_HI_BUF_OS_BIT_LEN        (5U)                
#define PGF_Q_CTRL1_HI_BUF_OS_BIT_MASK       0x3e0U               
#define PGF_Q_CTRL1_LO_BUF_OS_BIT_OFFSET     (0U)                
#define PGF_Q_CTRL1_LO_BUF_OS_BIT_LEN        (5U)                
#define PGF_Q_CTRL1_LO_BUF_OS_BIT_MASK       0x1fU                

/******************************************************************************
* @brief Bit definitions for register PGF_CAL_STS
**/
#define PGF_CAL_STS_ID                       0x40020              
#define PGF_CAL_STS_LEN                      (4U)                
#define PGF_CAL_STS_MASK                     0xFFFFFFFFUL        
#define PGF_CAL_STS_CAL_DONE_BIT_OFFSET      (0U)                
#define PGF_CAL_STS_CAL_DONE_BIT_LEN         (1U)                
#define PGF_CAL_STS_CAL_DONE_BIT_MASK        0x1U                 

/******************************************************************************
* @brief Bit definitions for register PGF_COMP_STS
**/
#define PGF_COMP_STS_ID                      0x40024              
#define PGF_COMP_STS_LEN                     (4U)                
#define PGF_COMP_STS_MASK                    0xFFFFFFFFUL        
#define PGF_COMP_STS_Q_COMP_OUT_BIT_OFFSET   (1U)                
#define PGF_COMP_STS_Q_COMP_OUT_BIT_LEN      (1U)                
#define PGF_COMP_STS_Q_COMP_OUT_BIT_MASK     0x2U                 
#define PGF_COMP_STS_I_COMP_OUT_BIT_OFFSET   (0U)                
#define PGF_COMP_STS_I_COMP_OUT_BIT_LEN      (1U)                
#define PGF_COMP_STS_I_COMP_OUT_BIT_MASK     0x1U                 

/******************************************************************************
* @brief Bit definitions for register MFIO_MODE
**/
#define MFIO_MODE_ID                         0x50000              
#define MFIO_MODE_LEN                        (4U)                
#define MFIO_MODE_MASK                       0xFFFFFFFFUL        
#define MFIO_MODE_MFIO8_MODE_BIT_OFFSET      (24U)               
#define MFIO_MODE_MFIO8_MODE_BIT_LEN         (3U)                
#define MFIO_MODE_MFIO8_MODE_BIT_MASK        0x7000000UL          
#define MFIO_MODE_MFIO7_MODE_BIT_OFFSET      (21U)               
#define MFIO_MODE_MFIO7_MODE_BIT_LEN         (3U)                
#define MFIO_MODE_MFIO7_MODE_BIT_MASK        0xe00000UL           
#define MFIO_MODE_MFIO6_MODE_BIT_OFFSET      (18U)               
#define MFIO_MODE_MFIO6_MODE_BIT_LEN         (3U)                
#define MFIO_MODE_MFIO6_MODE_BIT_MASK        0x1c0000UL           
#define MFIO_MODE_MFIO5_MODE_BIT_OFFSET      (15U)               
#define MFIO_MODE_MFIO5_MODE_BIT_LEN         (3U)                
#define MFIO_MODE_MFIO5_MODE_BIT_MASK        0x38000UL            
#define MFIO_MODE_MFIO4_MODE_BIT_OFFSET      (12U)               
#define MFIO_MODE_MFIO4_MODE_BIT_LEN         (3U)                
#define MFIO_MODE_MFIO4_MODE_BIT_MASK        0x7000U              
#define MFIO_MODE_MFIO3_MODE_BIT_OFFSET      (9U)                
#define MFIO_MODE_MFIO3_MODE_BIT_LEN         (3U)                
#define MFIO_MODE_MFIO3_MODE_BIT_MASK        0xe00U               
#define MFIO_MODE_MFIO2_MODE_BIT_OFFSET      (6U)                
#define MFIO_MODE_MFIO2_MODE_BIT_LEN         (3U)                
#define MFIO_MODE_MFIO2_MODE_BIT_MASK        0x1c0U               
#define MFIO_MODE_MFIO1_MODE_BIT_OFFSET      (3U)                
#define MFIO_MODE_MFIO1_MODE_BIT_LEN         (3U)                
#define MFIO_MODE_MFIO1_MODE_BIT_MASK        0x38U                
#define MFIO_MODE_MFIO0_MODE_BIT_OFFSET      (0U)                
#define MFIO_MODE_MFIO0_MODE_BIT_LEN         (3U)                
#define MFIO_MODE_MFIO0_MODE_BIT_MASK        0x7U                 

/******************************************************************************
* @brief Bit definitions for register GPIO_PULL_EN
**/
#define GPIO_PULL_EN_ID                      0x50004              
#define GPIO_PULL_EN_LEN                     (4U)                
#define GPIO_PULL_EN_MASK                    0xFFFFFFFFUL        
#define GPIO_PULL_EN_DIG_IO_DRV_BIT_OFFSET   (13U)               
#define GPIO_PULL_EN_DIG_IO_DRV_BIT_LEN      (1U)                
#define GPIO_PULL_EN_DIG_IO_DRV_BIT_MASK     0x2000U              
#define GPIO_PULL_EN_DIG_MOSI_DRV_BIT_OFFSET (12U)               
#define GPIO_PULL_EN_DIG_MOSI_DRV_BIT_LEN    (1U)                
#define GPIO_PULL_EN_DIG_MOSI_DRV_BIT_MASK   0x1000U              
#define GPIO_PULL_EN_MFIO_PULL_EN_BIT_OFFSET (0U)                
#define GPIO_PULL_EN_MFIO_PULL_EN_BIT_LEN    (12U)               
#define GPIO_PULL_EN_MFIO_PULL_EN_BIT_MASK   0xfffU               

/******************************************************************************
* @brief Bit definitions for register GPIO_DIR
**/
#define GPIO_DIR_ID                          0x50008              
#define GPIO_DIR_LEN                         (4U)                
#define GPIO_DIR_MASK                        0xFFFFFFFFUL        
#define GPIO_DIR_GPIO8_DIR_BIT_OFFSET        (8U)                
#define GPIO_DIR_GPIO8_DIR_BIT_LEN           (1U)                
#define GPIO_DIR_GPIO8_DIR_BIT_MASK          0x100U               
#define GPIO_DIR_GPIO7_DIR_BIT_OFFSET        (7U)                
#define GPIO_DIR_GPIO7_DIR_BIT_LEN           (1U)                
#define GPIO_DIR_GPIO7_DIR_BIT_MASK          0x80U                
#define GPIO_DIR_GPIO6_DIR_BIT_OFFSET        (6U)                
#define GPIO_DIR_GPIO6_DIR_BIT_LEN           (1U)                
#define GPIO_DIR_GPIO6_DIR_BIT_MASK          0x40U                
#define GPIO_DIR_GPIO5_DIR_BIT_OFFSET        (5U)                
#define GPIO_DIR_GPIO5_DIR_BIT_LEN           (1U)                
#define GPIO_DIR_GPIO5_DIR_BIT_MASK          0x20U                
#define GPIO_DIR_GPIO4_DIR_BIT_OFFSET        (4U)                
#define GPIO_DIR_GPIO4_DIR_BIT_LEN           (1U)                
#define GPIO_DIR_GPIO4_DIR_BIT_MASK          0x10U                
#define GPIO_DIR_GPIO3_DIR_BIT_OFFSET        (3U)                
#define GPIO_DIR_GPIO3_DIR_BIT_LEN           (1U)                
#define GPIO_DIR_GPIO3_DIR_BIT_MASK          0x8U                 
#define GPIO_DIR_GPIO2_DIR_BIT_OFFSET        (2U)                
#define GPIO_DIR_GPIO2_DIR_BIT_LEN           (1U)                
#define GPIO_DIR_GPIO2_DIR_BIT_MASK          0x4U                 
#define GPIO_DIR_GPIO1_DIR_BIT_OFFSET        (1U)                
#define GPIO_DIR_GPIO1_DIR_BIT_LEN           (1U)                
#define GPIO_DIR_GPIO1_DIR_BIT_MASK          0x2U                 
#define GPIO_DIR_GPIO0_DIR_BIT_OFFSET        (0U)                
#define GPIO_DIR_GPIO0_DIR_BIT_LEN           (1U)                
#define GPIO_DIR_GPIO0_DIR_BIT_MASK          0x1U                 

