tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register GPIO_OUT
**/
#define GPIO_OUT_ID                          0x5000c              
#define GPIO_OUT_LEN                         (4U)                
#define GPIO_OUT_MASK                        0xFFFFFFFFUL        
#define GPIO_OUT_GPIO8_OUT_BIT_OFFSET        (8U)                
#define GPIO_OUT_GPIO8_OUT_BIT_LEN           (1U)                
#define GPIO_OUT_GPIO8_OUT_BIT_MASK          0x100U               
#define GPIO_OUT_GPIO7_OUT_BIT_OFFSET        (7U)                
#define GPIO_OUT_GPIO7_OUT_BIT_LEN           (1U)                
#define GPIO_OUT_GPIO7_OUT_BIT_MASK          0x80U                
#define GPIO_OUT_GPIO6_OUT_BIT_OFFSET        (6U)                
#define GPIO_OUT_GPIO6_OUT_BIT_LEN           (1U)                
#define GPIO_OUT_GPIO6_OUT_BIT_MASK          0x40U                
#define GPIO_OUT_GPIO5_OUT_BIT_OFFSET        (5U)                
#define GPIO_OUT_GPIO5_OUT_BIT_LEN           (1U)                
#define GPIO_OUT_GPIO5_OUT_BIT_MASK          0x20U                
#define GPIO_OUT_GPIO4_OUT_BIT_OFFSET        (4U)                
#define GPIO_OUT_GPIO4_OUT_BIT_LEN           (1U)                
#define GPIO_OUT_GPIO4_OUT_BIT_MASK          0x10U                
#define GPIO_OUT_GPIO3_OUT_BIT_OFFSET        (3U)                
#define GPIO_OUT_GPIO3_OUT_BIT_LEN           (1U)                
#define GPIO_OUT_GPIO3_OUT_BIT_MASK          0x8U                 
#define GPIO_OUT_GPIO2_OUT_BIT_OFFSET        (2U)                
#define GPIO_OUT_GPIO2_OUT_BIT_LEN           (1U)                
#define GPIO_OUT_GPIO2_OUT_BIT_MASK          0x4U                 
#define GPIO_OUT_GPIO1_OUT_BIT_OFFSET        (1U)                
#define GPIO_OUT_GPIO1_OUT_BIT_LEN           (1U)                
#define GPIO_OUT_GPIO1_OUT_BIT_MASK          0x2U                 
#define GPIO_OUT_GPIO0_OUT_BIT_OFFSET        (0U)                
#define GPIO_OUT_GPIO0_OUT_BIT_LEN           (1U)                
#define GPIO_OUT_GPIO0_OUT_BIT_MASK          0x1U                 

/******************************************************************************
* @brief Bit definitions for register GPIO_INT_EN
**/
#define GPIO_INT_EN_ID                       0x50010              
#define GPIO_INT_EN_LEN                      (4U)                
#define GPIO_INT_EN_MASK                     0xFFFFFFFFUL        
#define GPIO_INT_EN_GPIO8_INT_EN_BIT_OFFSET  (8U)                
#define GPIO_INT_EN_GPIO8_INT_EN_BIT_LEN     (1U)                
#define GPIO_INT_EN_GPIO8_INT_EN_BIT_MASK    0x100U               
#define GPIO_INT_EN_GPIO7_INT_EN_BIT_OFFSET  (7U)                
#define GPIO_INT_EN_GPIO7_INT_EN_BIT_LEN     (1U)                
#define GPIO_INT_EN_GPIO7_INT_EN_BIT_MASK    0x80U                
#define GPIO_INT_EN_GPIO6_INT_EN_BIT_OFFSET  (6U)                
#define GPIO_INT_EN_GPIO6_INT_EN_BIT_LEN     (1U)                
#define GPIO_INT_EN_GPIO6_INT_EN_BIT_MASK    0x40U                
#define GPIO_INT_EN_GPIO5_INT_EN_BIT_OFFSET  (5U)                
#define GPIO_INT_EN_GPIO5_INT_EN_BIT_LEN     (1U)                
#define GPIO_INT_EN_GPIO5_INT_EN_BIT_MASK    0x20U                
#define GPIO_INT_EN_GPIO4_INT_EN_BIT_OFFSET  (4U)                
#define GPIO_INT_EN_GPIO4_INT_EN_BIT_LEN     (1U)                
#define GPIO_INT_EN_GPIO4_INT_EN_BIT_MASK    0x10U                
#define GPIO_INT_EN_GPIO3_INT_EN_BIT_OFFSET  (3U)                
#define GPIO_INT_EN_GPIO3_INT_EN_BIT_LEN     (1U)                
#define GPIO_INT_EN_GPIO3_INT_EN_BIT_MASK    0x8U                 
#define GPIO_INT_EN_GPIO2_INT_EN_BIT_OFFSET  (2U)                
#define GPIO_INT_EN_GPIO2_INT_EN_BIT_LEN     (1U)                
#define GPIO_INT_EN_GPIO2_INT_EN_BIT_MASK    0x4U                 
#define GPIO_INT_EN_GPIO1_INT_EN_BIT_OFFSET  (1U)                
#define GPIO_INT_EN_GPIO1_INT_EN_BIT_LEN     (1U)                
#define GPIO_INT_EN_GPIO1_INT_EN_BIT_MASK    0x2U                 
#define GPIO_INT_EN_GPIO0_INT_EN_BIT_OFFSET  (0U)                
#define GPIO_INT_EN_GPIO0_INT_EN_BIT_LEN     (1U)                
#define GPIO_INT_EN_GPIO0_INT_EN_BIT_MASK    0x1U                 

/******************************************************************************
* @brief Bit definitions for register GPIO_INT_STATUS
**/
#define GPIO_INT_STATUS_ID                   0x50014              
#define GPIO_INT_STATUS_LEN                  (4U)                
#define GPIO_INT_STATUS_MASK                 0xFFFFFFFFUL        
#define GPIO_INT_STATUS_GPIO8_STATUS_BIT_OFFSET (8U)                
#define GPIO_INT_STATUS_GPIO8_STATUS_BIT_LEN (1U)                
#define GPIO_INT_STATUS_GPIO8_STATUS_BIT_MASK 0x100U               
#define GPIO_INT_STATUS_GPIO7_STATUS_BIT_OFFSET (7U)                
#define GPIO_INT_STATUS_GPIO7_STATUS_BIT_LEN (1U)                
#define GPIO_INT_STATUS_GPIO7_STATUS_BIT_MASK 0x80U                
#define GPIO_INT_STATUS_GPIO6_STATUS_BIT_OFFSET (6U)                
#define GPIO_INT_STATUS_GPIO6_STATUS_BIT_LEN (1U)                
#define GPIO_INT_STATUS_GPIO6_STATUS_BIT_MASK 0x40U                
#define GPIO_INT_STATUS_GPIO5_STATUS_BIT_OFFSET (5U)                
#define GPIO_INT_STATUS_GPIO5_STATUS_BIT_LEN (1U)                
#define GPIO_INT_STATUS_GPIO5_STATUS_BIT_MASK 0x20U                
#define GPIO_INT_STATUS_GPIO4_STATUS_BIT_OFFSET (4U)                
#define GPIO_INT_STATUS_GPIO4_STATUS_BIT_LEN (1U)                
#define GPIO_INT_STATUS_GPIO4_STATUS_BIT_MASK 0x10U                
#define GPIO_INT_STATUS_GPIO3_STATUS_BIT_OFFSET (3U)                
#define GPIO_INT_STATUS_GPIO3_STATUS_BIT_LEN (1U)                
#define GPIO_INT_STATUS_GPIO3_STATUS_BIT_MASK 0x8U                 
#define GPIO_INT_STATUS_GPIO2_STATUS_BIT_OFFSET (2U)                
#define GPIO_INT_STATUS_GPIO2_STATUS_BIT_LEN (1U)                
#define GPIO_INT_STATUS_GPIO2_STATUS_BIT_MASK 0x4U                 
#define GPIO_INT_STATUS_GPIO1_STATUS_BIT_OFFSET (1U)                
#define GPIO_INT_STATUS_GPIO1_STATUS_BIT_LEN (1U)                
#define GPIO_INT_STATUS_GPIO1_STATUS_BIT_MASK 0x2U                 
#define GPIO_INT_STATUS_GPIO0_STATUS_BIT_OFFSET (0U)                
#define GPIO_INT_STATUS_GPIO0_STATUS_BIT_LEN (1U)                
#define GPIO_INT_STATUS_GPIO0_STATUS_BIT_MASK 0x1U                 

