tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register GPIO_INT_EDGE
**/
#define GPIO_INT_EDGE_ID                     0x50018              
#define GPIO_INT_EDGE_LEN                    (4U)                
#define GPIO_INT_EDGE_MASK                   0xFFFFFFFFUL        
#define GPIO_INT_EDGE_GPIO8_INT_EDGE_BIT_OFFSET (8U)                
#define GPIO_INT_EDGE_GPIO8_INT_EDGE_BIT_LEN (1U)                
#define GPIO_INT_EDGE_GPIO8_INT_EDGE_BIT_MASK 0x100U               
#define GPIO_INT_EDGE_GPIO7_INT_EDGE_BIT_OFFSET (7U)                
#define GPIO_INT_EDGE_GPIO7_INT_EDGE_BIT_LEN (1U)                
#define GPIO_INT_EDGE_GPIO7_INT_EDGE_BIT_MASK 0x80U                
#define GPIO_INT_EDGE_GPIO6_INT_EDGE_BIT_OFFSET (6U)                
#define GPIO_INT_EDGE_GPIO6_INT_EDGE_BIT_LEN (1U)                
#define GPIO_INT_EDGE_GPIO6_INT_EDGE_BIT_MASK 0x40U                
#define GPIO_INT_EDGE_GPIO5_INT_EDGE_BIT_OFFSET (5U)                
#define GPIO_INT_EDGE_GPIO5_INT_EDGE_BIT_LEN (1U)                
#define GPIO_INT_EDGE_GPIO5_INT_EDGE_BIT_MASK 0x20U                
#define GPIO_INT_EDGE_GPIO4_INT_EDGE_BIT_OFFSET (4U)                
#define GPIO_INT_EDGE_GPIO4_INT_EDGE_BIT_LEN (1U)                
#define GPIO_INT_EDGE_GPIO4_INT_EDGE_BIT_MASK 0x10U                
#define GPIO_INT_EDGE_GPIO3_INT_EDGE_BIT_OFFSET (3U)                
#define GPIO_INT_EDGE_GPIO3_INT_EDGE_BIT_LEN (1U)                
#define GPIO_INT_EDGE_GPIO3_INT_EDGE_BIT_MASK 0x8U                 
#define GPIO_INT_EDGE_GPIO2_INT_EDGE_BIT_OFFSET (2U)                
#define GPIO_INT_EDGE_GPIO2_INT_EDGE_BIT_LEN (1U)                
#define GPIO_INT_EDGE_GPIO2_INT_EDGE_BIT_MASK 0x4U                 
#define GPIO_INT_EDGE_GPIO1_INT_EDGE_BIT_OFFSET (1U)                
#define GPIO_INT_EDGE_GPIO1_INT_EDGE_BIT_LEN (1U)                
#define GPIO_INT_EDGE_GPIO1_INT_EDGE_BIT_MASK 0x2U                 
#define GPIO_INT_EDGE_GPIO0_INT_EDGE_BIT_OFFSET (0U)                
#define GPIO_INT_EDGE_GPIO0_INT_EDGE_BIT_LEN (1U)                
#define GPIO_INT_EDGE_GPIO0_INT_EDGE_BIT_MASK 0x1U                 

/******************************************************************************
* @brief Bit definitions for register GPIO_INT_TYPE
**/
#define GPIO_INT_TYPE_ID                     0x5001c              
#define GPIO_INT_TYPE_LEN                    (4U)                
#define GPIO_INT_TYPE_MASK                   0xFFFFFFFFUL        
#define GPIO_INT_TYPE_GPIO8_INT_TYPE_BIT_OFFSET (8U)                
#define GPIO_INT_TYPE_GPIO8_INT_TYPE_BIT_LEN (1U)                
#define GPIO_INT_TYPE_GPIO8_INT_TYPE_BIT_MASK 0x100U               
#define GPIO_INT_TYPE_GPIO7_INT_TYPE_BIT_OFFSET (7U)                
#define GPIO_INT_TYPE_GPIO7_INT_TYPE_BIT_LEN (1U)                
#define GPIO_INT_TYPE_GPIO7_INT_TYPE_BIT_MASK 0x80U                
#define GPIO_INT_TYPE_GPIO6_INT_TYPE_BIT_OFFSET (6U)                
#define GPIO_INT_TYPE_GPIO6_INT_TYPE_BIT_LEN (1U)                
#define GPIO_INT_TYPE_GPIO6_INT_TYPE_BIT_MASK 0x40U                
#define GPIO_INT_TYPE_GPIO5_INT_TYPE_BIT_OFFSET (5U)                
#define GPIO_INT_TYPE_GPIO5_INT_TYPE_BIT_LEN (1U)                
#define GPIO_INT_TYPE_GPIO5_INT_TYPE_BIT_MASK 0x20U                
#define GPIO_INT_TYPE_GPIO4_INT_TYPE_BIT_OFFSET (4U)                
#define GPIO_INT_TYPE_GPIO4_INT_TYPE_BIT_LEN (1U)                
#define GPIO_INT_TYPE_GPIO4_INT_TYPE_BIT_MASK 0x10U                
#define GPIO_INT_TYPE_GPIO3_INT_TYPE_BIT_OFFSET (3U)                
#define GPIO_INT_TYPE_GPIO3_INT_TYPE_BIT_LEN (1U)                
#define GPIO_INT_TYPE_GPIO3_INT_TYPE_BIT_MASK 0x8U                 
#define GPIO_INT_TYPE_GPIO2_INT_TYPE_BIT_OFFSET (2U)                
#define GPIO_INT_TYPE_GPIO2_INT_TYPE_BIT_LEN (1U)                
#define GPIO_INT_TYPE_GPIO2_INT_TYPE_BIT_MASK 0x4U                 
#define GPIO_INT_TYPE_GPIO1_INT_TYPE_BIT_OFFSET (1U)                
#define GPIO_INT_TYPE_GPIO1_INT_TYPE_BIT_LEN (1U)                
#define GPIO_INT_TYPE_GPIO1_INT_TYPE_BIT_MASK 0x2U                 
#define GPIO_INT_TYPE_GPIO0_INT_TYPE_BIT_OFFSET (0U)                
#define GPIO_INT_TYPE_GPIO0_INT_TYPE_BIT_LEN (1U)                
#define GPIO_INT_TYPE_GPIO0_INT_TYPE_BIT_MASK 0x1U                 

/******************************************************************************
* @brief Bit definitions for register GPIO_INT_TYPE2
**/
#define GPIO_INT_TYPE2_ID                    0x50020              
#define GPIO_INT_TYPE2_LEN                   (4U)                
#define GPIO_INT_TYPE2_MASK                  0xFFFFFFFFUL        
#define GPIO_INT_TYPE2_GPIO8_INT_TYPE2_BIT_OFFSET (8U)                
#define GPIO_INT_TYPE2_GPIO8_INT_TYPE2_BIT_LEN (1U)                
#define GPIO_INT_TYPE2_GPIO8_INT_TYPE2_BIT_MASK 0x100U               
#define GPIO_INT_TYPE2_GPIO7_INT_TYPE2_BIT_OFFSET (7U)                
#define GPIO_INT_TYPE2_GPIO7_INT_TYPE2_BIT_LEN (1U)                
#define GPIO_INT_TYPE2_GPIO7_INT_TYPE2_BIT_MASK 0x80U                
#define GPIO_INT_TYPE2_GPIO6_INT_TYPE2_BIT_OFFSET (6U)                
#define GPIO_INT_TYPE2_GPIO6_INT_TYPE2_BIT_LEN (1U)                
#define GPIO_INT_TYPE2_GPIO6_INT_TYPE2_BIT_MASK 0x40U                
#define GPIO_INT_TYPE2_GPIO5_INT_TYPE2_BIT_OFFSET (5U)                
#define GPIO_INT_TYPE2_GPIO5_INT_TYPE2_BIT_LEN (1U)                
#define GPIO_INT_TYPE2_GPIO5_INT_TYPE2_BIT_MASK 0x20U                
#define GPIO_INT_TYPE2_GPIO4_INT_TYPE2_BIT_OFFSET (4U)                
#define GPIO_INT_TYPE2_GPIO4_INT_TYPE2_BIT_LEN (1U)                
#define GPIO_INT_TYPE2_GPIO4_INT_TYPE2_BIT_MASK 0x10U                
#define GPIO_INT_TYPE2_GPIO3_INT_TYPE2_BIT_OFFSET (3U)                
#define GPIO_INT_TYPE2_GPIO3_INT_TYPE2_BIT_LEN (1U)                
#define GPIO_INT_TYPE2_GPIO3_INT_TYPE2_BIT_MASK 0x8U                 
#define GPIO_INT_TYPE2_GPIO2_INT_TYPE2_BIT_OFFSET (2U)                
#define GPIO_INT_TYPE2_GPIO2_INT_TYPE2_BIT_LEN (1U)                
#define GPIO_INT_TYPE2_GPIO2_INT_TYPE2_BIT_MASK 0x4U                 
#define GPIO_INT_TYPE2_GPIO1_INT_TYPE2_BIT_OFFSET (1U)                
#define GPIO_INT_TYPE2_GPIO1_INT_TYPE2_BIT_LEN (1U)                
#define GPIO_INT_TYPE2_GPIO1_INT_TYPE2_BIT_MASK 0x2U                 
#define GPIO_INT_TYPE2_GPIO0_INT_TYPE2_BIT_OFFSET (0U)                
#define GPIO_INT_TYPE2_GPIO0_INT_TYPE2_BIT_LEN (1U)                
#define GPIO_INT_TYPE2_GPIO0_INT_TYPE2_BIT_MASK 0x1U                 

