tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register GPIO_INT_CLR
**/
#define GPIO_INT_CLR_ID                      0x50024              
#define GPIO_INT_CLR_LEN                     (4U)                
#define GPIO_INT_CLR_MASK                    0xFFFFFFFFUL        
#define GPIO_INT_CLR_GPIO8_INT_CLR_BIT_OFFSET (8U)                
#define GPIO_INT_CLR_GPIO8_INT_CLR_BIT_LEN   (1U)                
#define GPIO_INT_CLR_GPIO8_INT_CLR_BIT_MASK  0x100U               
#define GPIO_INT_CLR_GPIO7_INT_CLR_BIT_OFFSET (7U)                
#define GPIO_INT_CLR_GPIO7_INT_CLR_BIT_LEN   (1U)                
#define GPIO_INT_CLR_GPIO7_INT_CLR_BIT_MASK  0x80U                
#define GPIO_INT_CLR_GPIO6_INT_CLR_BIT_OFFSET (6U)                
#define GPIO_INT_CLR_GPIO6_INT_CLR_BIT_LEN   (1U)                
#define GPIO_INT_CLR_GPIO6_INT_CLR_BIT_MASK  0x40U                
#define GPIO_INT_CLR_GPIO5_INT_CLR_BIT_OFFSET (5U)                
#define GPIO_INT_CLR_GPIO5_INT_CLR_BIT_LEN   (1U)                
#define GPIO_INT_CLR_GPIO5_INT_CLR_BIT_MASK  0x20U                
#define GPIO_INT_CLR_GPIO4_INT_CLR_BIT_OFFSET (4U)                
#define GPIO_INT_CLR_GPIO4_INT_CLR_BIT_LEN   (1U)                
#define GPIO_INT_CLR_GPIO4_INT_CLR_BIT_MASK  0x10U                
#define GPIO_INT_CLR_GPIO3_INT_CLR_BIT_OFFSET (3U)                
#define GPIO_INT_CLR_GPIO3_INT_CLR_BIT_LEN   (1U)                
#define GPIO_INT_CLR_GPIO3_INT_CLR_BIT_MASK  0x8U                 
#define GPIO_INT_CLR_GPIO2_INT_CLR_BIT_OFFSET (2U)                
#define GPIO_INT_CLR_GPIO2_INT_CLR_BIT_LEN   (1U)                
#define GPIO_INT_CLR_GPIO2_INT_CLR_BIT_MASK  0x4U                 
#define GPIO_INT_CLR_GPIO1_INT_CLR_BIT_OFFSET (1U)                
#define GPIO_INT_CLR_GPIO1_INT_CLR_BIT_LEN   (1U)                
#define GPIO_INT_CLR_GPIO1_INT_CLR_BIT_MASK  0x2U                 
#define GPIO_INT_CLR_GPIO0_INT_CLR_BIT_OFFSET (0U)                
#define GPIO_INT_CLR_GPIO0_INT_CLR_BIT_LEN   (1U)                
#define GPIO_INT_CLR_GPIO0_INT_CLR_BIT_MASK  0x1U                 

/******************************************************************************
* @brief Bit definitions for register GPIO_DBNC_EN
**/
#define GPIO_DBNC_EN_ID                      0x50028              
#define GPIO_DBNC_EN_LEN                     (4U)                
#define GPIO_DBNC_EN_MASK                    0xFFFFFFFFUL        
#define GPIO_DBNC_EN_GPIO8_DBNC_EN_BIT_OFFSET (8U)                
#define GPIO_DBNC_EN_GPIO8_DBNC_EN_BIT_LEN   (1U)                
#define GPIO_DBNC_EN_GPIO8_DBNC_EN_BIT_MASK  0x100U               
#define GPIO_DBNC_EN_GPIO7_DBNC_EN_BIT_OFFSET (7U)                
#define GPIO_DBNC_EN_GPIO7_DBNC_EN_BIT_LEN   (1U)                
#define GPIO_DBNC_EN_GPIO7_DBNC_EN_BIT_MASK  0x80U                
#define GPIO_DBNC_EN_GPIO6_DBNC_EN_BIT_OFFSET (6U)                
#define GPIO_DBNC_EN_GPIO6_DBNC_EN_BIT_LEN   (1U)                
#define GPIO_DBNC_EN_GPIO6_DBNC_EN_BIT_MASK  0x40U                
#define GPIO_DBNC_EN_GPIO5_DBNC_EN_BIT_OFFSET (5U)                
#define GPIO_DBNC_EN_GPIO5_DBNC_EN_BIT_LEN   (1U)                
#define GPIO_DBNC_EN_GPIO5_DBNC_EN_BIT_MASK  0x20U                
#define GPIO_DBNC_EN_GPIO4_DBNC_EN_BIT_OFFSET (4U)                
#define GPIO_DBNC_EN_GPIO4_DBNC_EN_BIT_LEN   (1U)                
#define GPIO_DBNC_EN_GPIO4_DBNC_EN_BIT_MASK  0x10U                
#define GPIO_DBNC_EN_GPIO3_DBNC_EN_BIT_OFFSET (3U)                
#define GPIO_DBNC_EN_GPIO3_DBNC_EN_BIT_LEN   (1U)                
#define GPIO_DBNC_EN_GPIO3_DBNC_EN_BIT_MASK  0x8U                 
#define GPIO_DBNC_EN_GPIO2_DBNC_EN_BIT_OFFSET (2U)                
#define GPIO_DBNC_EN_GPIO2_DBNC_EN_BIT_LEN   (1U)                
#define GPIO_DBNC_EN_GPIO2_DBNC_EN_BIT_MASK  0x4U                 
#define GPIO_DBNC_EN_GPIO1_DBNC_EN_BIT_OFFSET (1U)                
#define GPIO_DBNC_EN_GPIO1_DBNC_EN_BIT_LEN   (1U)                
#define GPIO_DBNC_EN_GPIO1_DBNC_EN_BIT_MASK  0x2U                 
#define GPIO_DBNC_EN_GPIO0_DBNC_EN_BIT_OFFSET (0U)                
#define GPIO_DBNC_EN_GPIO0_DBNC_EN_BIT_LEN   (1U)                
#define GPIO_DBNC_EN_GPIO0_DBNC_EN_BIT_MASK  0x1U                 

/******************************************************************************
* @brief Bit definitions for register GPIO_RAW_DATA
**/
#define GPIO_RAW_DATA_ID                     0x5002c              
#define GPIO_RAW_DATA_LEN                    (4U)                
#define GPIO_RAW_DATA_MASK                   0xFFFFFFFFUL        
#define GPIO_RAW_DATA_GPIO8_RAW_DAT_BIT_OFFSET (8U)                
#define GPIO_RAW_DATA_GPIO8_RAW_DAT_BIT_LEN  (1U)                
#define GPIO_RAW_DATA_GPIO8_RAW_DAT_BIT_MASK 0x100U               
#define GPIO_RAW_DATA_GPIO7_RAW_DAT_BIT_OFFSET (7U)                
#define GPIO_RAW_DATA_GPIO7_RAW_DAT_BIT_LEN  (1U)                
#define GPIO_RAW_DATA_GPIO7_RAW_DAT_BIT_MASK 0x80U                
#define GPIO_RAW_DATA_GPIO6_RAW_DAT_BIT_OFFSET (6U)                
#define GPIO_RAW_DATA_GPIO6_RAW_DAT_BIT_LEN  (1U)                
#define GPIO_RAW_DATA_GPIO6_RAW_DAT_BIT_MASK 0x40U                
#define GPIO_RAW_DATA_GPIO5_RAW_DAT_BIT_OFFSET (5U)                
#define GPIO_RAW_DATA_GPIO5_RAW_DAT_BIT_LEN  (1U)                
#define GPIO_RAW_DATA_GPIO5_RAW_DAT_BIT_MASK 0x20U                
#define GPIO_RAW_DATA_GPIO4_RAW_DAT_BIT_OFFSET (4U)                
#define GPIO_RAW_DATA_GPIO4_RAW_DAT_BIT_LEN  (1U)                
#define GPIO_RAW_DATA_GPIO4_RAW_DAT_BIT_MASK 0x10U                
#define GPIO_RAW_DATA_GPIO3_RAW_DAT_BIT_OFFSET (3U)                
#define GPIO_RAW_DATA_GPIO3_RAW_DAT_BIT_LEN  (1U)                
#define GPIO_RAW_DATA_GPIO3_RAW_DAT_BIT_MASK 0x8U                 
#define GPIO_RAW_DATA_GPIO2_RAW_DAT_BIT_OFFSET (2U)                
#define GPIO_RAW_DATA_GPIO2_RAW_DAT_BIT_LEN  (1U)                
#define GPIO_RAW_DATA_GPIO2_RAW_DAT_BIT_MASK 0x4U                 
#define GPIO_RAW_DATA_GPIO1_RAW_DAT_BIT_OFFSET (1U)                
#define GPIO_RAW_DATA_GPIO1_RAW_DAT_BIT_LEN  (1U)                
#define GPIO_RAW_DATA_GPIO1_RAW_DAT_BIT_MASK 0x2U                 
#define GPIO_RAW_DATA_GPIO0_RAW_DAT_BIT_OFFSET (0U)                
#define GPIO_RAW_DATA_GPIO0_RAW_DAT_BIT_LEN  (1U)                
#define GPIO_RAW_DATA_GPIO0_RAW_DAT_BIT_MASK 0x1U                 

