tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register DTUNE0
**/
#define DTUNE0_ID                            0x60000              
#define DTUNE0_LEN                           (4U)                
#define DTUNE0_MASK                          0xFFFFFFFFUL        
#define DTUNE0_RX_SFD_TOC_BIT_OFFSET         (16U)               
#define DTUNE0_RX_SFD_TOC_BIT_LEN            (16U)               
#define DTUNE0_RX_SFD_TOC_BIT_MASK           0xffff0000UL         
#define DTUNE0_TR_SEED_GEAR_BIT_OFFSET       (8U)                
#define DTUNE0_TR_SEED_GEAR_BIT_LEN          (8U)                
#define DTUNE0_TR_SEED_GEAR_BIT_MASK         0xff00U              
#define DTUNE0_RESERVED_BIT_OFFSET           (5U)                
#define DTUNE0_RESERVED_BIT_LEN              (3U)                
#define DTUNE0_RESERVED_BIT_MASK             0xe0U                
#define DTUNE0_CP_CMF_EN_BIT_OFFSET          (4U)                
#define DTUNE0_CP_CMF_EN_BIT_LEN             (1U)                
#define DTUNE0_CP_CMF_EN_BIT_MASK            0x10U                
#define DTUNE0_TIM_SEED_POL_BIT_OFFSET       (3U)                
#define DTUNE0_TIM_SEED_POL_BIT_LEN          (1U)                
#define DTUNE0_TIM_SEED_POL_BIT_MASK         0x8U                 
#define DTUNE0_PRE_QUAL_WIN_BIT_OFFSET       (2U)                
#define DTUNE0_PRE_QUAL_WIN_BIT_LEN          (1U)                
#define DTUNE0_PRE_QUAL_WIN_BIT_MASK         0x4U                 
#define DTUNE0_PRE_PAC_SYM_BIT_OFFSET        (0U)                
#define DTUNE0_PRE_PAC_SYM_BIT_LEN           (2U)                
#define DTUNE0_PRE_PAC_SYM_BIT_MASK          0x3U                 

/******************************************************************************
* @brief Bit definitions for register DTUNE1
**/
#define DTUNE1_ID                            0x60004              
#define DTUNE1_LEN                           (4U)                
#define DTUNE1_MASK                          0xFFFFFFFFUL        
#define DTUNE1_CAR_INT_SEED_BIT_OFFSET       (20U)               
#define DTUNE1_CAR_INT_SEED_BIT_LEN          (9U)                
#define DTUNE1_CAR_INT_SEED_BIT_MASK         0x1ff00000UL         
#define DTUNE1_RX_PRE_CONF_THD_BIT_OFFSET    (16U)               
#define DTUNE1_RX_PRE_CONF_THD_BIT_LEN       (4U)                
#define DTUNE1_RX_PRE_CONF_THD_BIT_MASK      0xf0000UL            
#define DTUNE1_PRE_TOC_BIT_OFFSET            (0U)                
#define DTUNE1_PRE_TOC_BIT_LEN               (16U)               
#define DTUNE1_PRE_TOC_BIT_MASK              0xffffU              

/******************************************************************************
* @brief Bit definitions for register DTUNE2
**/
#define DTUNE2_ID                            0x60008              
#define DTUNE2_LEN                           (4U)                
#define DTUNE2_MASK                          0xFFFFFFFFUL        
#define DTUNE2_PRE_CORE_16_32_BIT_OFFSET     (23U)               
#define DTUNE2_PRE_CORE_16_32_BIT_LEN        (9U)                
#define DTUNE2_PRE_CORE_16_32_BIT_MASK       0xff800000UL         
#define DTUNE2_PRE_CORE_16_16_BIT_OFFSET     (15U)               
#define DTUNE2_PRE_CORE_16_16_BIT_LEN        (8U)                
#define DTUNE2_PRE_CORE_16_16_BIT_MASK       0x7f8000UL           
#define DTUNE2_PRE_CORE_16_8_BIT_OFFSET      (7U)                
#define DTUNE2_PRE_CORE_16_8_BIT_LEN         (8U)                
#define DTUNE2_PRE_CORE_16_8_BIT_MASK        0x7f80U              
#define DTUNE2_PRE_CORE_16_4_BIT_OFFSET      (0U)                
#define DTUNE2_PRE_CORE_16_4_BIT_LEN         (7U)                
#define DTUNE2_PRE_CORE_16_4_BIT_MASK        0x7fU                

/******************************************************************************
* @brief Bit definitions for register DTUNE3
**/
#define DTUNE3_ID                            0x6000c              
#define DTUNE3_LEN                           (4U)                
#define DTUNE3_MASK                          0xFFFFFFFFUL        
#define DTUNE3_PRE_CORE_64_32_BIT_OFFSET     (23U)               
#define DTUNE3_PRE_CORE_64_32_BIT_LEN        (9U)                
#define DTUNE3_PRE_CORE_64_32_BIT_MASK       0xff800000UL         
#define DTUNE3_PRE_CORE_64_16_BIT_OFFSET     (15U)               
#define DTUNE3_PRE_CORE_64_16_BIT_LEN        (8U)                
#define DTUNE3_PRE_CORE_64_16_BIT_MASK       0x7f8000UL           
#define DTUNE3_PRE_CORE_64_8_BIT_OFFSET      (7U)                
#define DTUNE3_PRE_CORE_64_8_BIT_LEN         (8U)                
#define DTUNE3_PRE_CORE_64_8_BIT_MASK        0x7f80U              
#define DTUNE3_PRE_CORE_64_4_BIT_OFFSET      (0U)                
#define DTUNE3_PRE_CORE_64_4_BIT_LEN         (7U)                
#define DTUNE3_PRE_CORE_64_4_BIT_MASK        0x7fU                

/******************************************************************************
* @brief Bit definitions for register DTUNE4
**/
#define DTUNE4_ID                            0x60010              
#define DTUNE4_LEN                           (4U)                
#define DTUNE4_MASK                          0xFFFFFFFFUL        
#define DTUNE4_RX_SFD_HLDOFF_BIT_OFFSET      (24U)               
#define DTUNE4_RX_SFD_HLDOFF_BIT_LEN         (8U)                
#define DTUNE4_RX_SFD_HLDOFF_BIT_MASK        0xff000000UL         
#define DTUNE4_CP_CORE_16_BIT_OFFSET         (16U)               
#define DTUNE4_CP_CORE_16_BIT_LEN            (8U)                
#define DTUNE4_CP_CORE_16_BIT_MASK           0xff0000UL           
#define DTUNE4_CONF_CORE_16_BIT_OFFSET       (8U)                
#define DTUNE4_CONF_CORE_16_BIT_LEN          (8U)                
#define DTUNE4_CONF_CORE_16_BIT_MASK         0xff00U              
#define DTUNE4_RX_SFD_CORE_16_BIT_OFFSET     (0U)                
#define DTUNE4_RX_SFD_CORE_16_BIT_LEN        (8U)                
#define DTUNE4_RX_SFD_CORE_16_BIT_MASK       0xffU                

