tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register DTUNE5
**/
#define DTUNE5_ID                            0x60014              
#define DTUNE5_LEN                           (4U)                
#define DTUNE5_MASK                          0xFFFFFFFFUL        
#define DTUNE5_RX_SFD_CORE_SCP_BIT_OFFSET    (24U)               
#define DTUNE5_RX_SFD_CORE_SCP_BIT_LEN       (8U)                
#define DTUNE5_RX_SFD_CORE_SCP_BIT_MASK      0xff000000UL         
#define DTUNE5_CP_CORE_64_BIT_OFFSET         (16U)               
#define DTUNE5_CP_CORE_64_BIT_LEN            (8U)                
#define DTUNE5_CP_CORE_64_BIT_MASK           0xff0000UL           
#define DTUNE5_CONF_CORE_64_BIT_OFFSET       (8U)                
#define DTUNE5_CONF_CORE_64_BIT_LEN          (8U)                
#define DTUNE5_CONF_CORE_64_BIT_MASK         0xff00U              
#define DTUNE5_RX_SFD_CORE_64_BIT_OFFSET     (0U)                
#define DTUNE5_RX_SFD_CORE_64_BIT_LEN        (8U)                
#define DTUNE5_RX_SFD_CORE_64_BIT_MASK       0xffU                

/******************************************************************************
* @brief Bit definitions for register DTUNE6
**/
#define DTUNE6_ID                            0x60018              
#define DTUNE6_LEN                           (4U)                
#define DTUNE6_MASK                          0xFFFFFFFFUL        
#define DTUNE6_PREAMBLE_THD_BIT_OFFSET       (24U)               
#define DTUNE6_PREAMBLE_THD_BIT_LEN          (8U)                
#define DTUNE6_PREAMBLE_THD_BIT_MASK         0xff000000UL         
#define DTUNE6_PRE_CORE_SCP_32_BIT_OFFSET    (16U)               
#define DTUNE6_PRE_CORE_SCP_32_BIT_LEN       (8U)                
#define DTUNE6_PRE_CORE_SCP_32_BIT_MASK      0xff0000UL           
#define DTUNE6_PRE_CORE_SCP_16_BIT_OFFSET    (8U)                
#define DTUNE6_PRE_CORE_SCP_16_BIT_LEN       (8U)                
#define DTUNE6_PRE_CORE_SCP_16_BIT_MASK      0xff00U              
#define DTUNE6_CONF_CORE_SCP_BIT_OFFSET      (0U)                
#define DTUNE6_CONF_CORE_SCP_BIT_LEN         (8U)                
#define DTUNE6_CONF_CORE_SCP_BIT_MASK        0xffU                

/******************************************************************************
* @brief Bit definitions for register DTUNE7
**/
#define DTUNE7_ID                            0x6001c              
#define DTUNE7_LEN                           (1U)                
#define DTUNE7_MASK                          0xFFU               
#define DTUNE7_CP_CORE_SCP_BIT_OFFSET        (0U)                
#define DTUNE7_CP_CORE_SCP_BIT_LEN           (8U)                
#define DTUNE7_CP_CORE_SCP_BIT_MASK          0xffU                

/******************************************************************************
* @brief Bit definitions for register DRX_DIAG0
**/
#define DRX_DIAG0_ID                         0x6001d              /*  */
#define DRX_DIAG0_LEN                        (4U)                
#define DRX_DIAG0_MASK                       0xFFFFFFFFUL        
#define DRX_DIAG0_SYMS_ACC_ADJ_BIT_OFFSET    (8U)                
#define DRX_DIAG0_SYMS_ACC_ADJ_BIT_LEN       (12U)               
#define DRX_DIAG0_SYMS_ACC_ADJ_BIT_MASK      0xfff00UL            
#define DRX_DIAG0_SFD_RSMP_DEL_BIT_OFFSET    (0U)                
#define DRX_DIAG0_SFD_RSMP_DEL_BIT_LEN       (8U)                
#define DRX_DIAG0_SFD_RSMP_DEL_BIT_MASK      0xffU                

/******************************************************************************
* @brief Bit definitions for register DRX_DIAG1
**/
#define DRX_DIAG1_ID                         0x60021              /*  */
#define DRX_DIAG1_LEN                        (4U)                
#define DRX_DIAG1_MASK                       0xFFFFFFFFUL        
#define DRX_DIAG1_PRE_VAL_BIT_OFFSET         (15U)               
#define DRX_DIAG1_PRE_VAL_BIT_LEN            (15U)               
#define DRX_DIAG1_PRE_VAL_BIT_MASK           0x3fff8000UL         
#define DRX_DIAG1_WIND_MAX_BIT_OFFSET        (0U)                
#define DRX_DIAG1_WIND_MAX_BIT_LEN           (15U)               
#define DRX_DIAG1_WIND_MAX_BIT_MASK          0x7fffU              

/******************************************************************************
* @brief Bit definitions for register DRX_DIAG2
**/
#define DRX_DIAG2_ID                         0x60025              /*  */
#define DRX_DIAG2_LEN                        (4U)                
#define DRX_DIAG2_MASK                       0xFFFFFFFFUL        
#define DRX_DIAG2_SFD_MEAN_BIT_OFFSET        (12U)               
#define DRX_DIAG2_SFD_MEAN_BIT_LEN           (17U)               
#define DRX_DIAG2_SFD_MEAN_BIT_MASK          0x1ffff000UL         
#define DRX_DIAG2_SYMS_ACC_BIT_OFFSET        (0U)                
#define DRX_DIAG2_SYMS_ACC_BIT_LEN           (12U)               
#define DRX_DIAG2_SYMS_ACC_BIT_MASK          0xfffU               

/******************************************************************************
* @brief Bit definitions for register DRX_DIAG3
**/
#define DRX_DIAG3_ID                         0x60029              /*  */
#define DRX_DIAG3_LEN                        (4U)                
#define DRX_DIAG3_MASK                       0xFFFFFFFFUL        
#define DRX_DIAG3_CAR_PHASE_BIT_OFFSET       (24U)               
#define DRX_DIAG3_CAR_PHASE_BIT_LEN          (7U)                
#define DRX_DIAG3_CAR_PHASE_BIT_MASK         0x7f000000UL         
#define DRX_DIAG3_CAR_INT_BIT_OFFSET         (0U)                
#define DRX_DIAG3_CAR_INT_BIT_LEN            (21U)               
#define DRX_DIAG3_CAR_INT_BIT_MASK           0x1fffffUL           

/******************************************************************************
* @brief Bit definitions for register DRX_DIAG4
**/
#define DRX_DIAG4_ID                         0x6002d              /*  */
#define DRX_DIAG4_LEN                        (4U)                
#define DRX_DIAG4_MASK                       0xFFFFFFFFUL        
#define DRX_DIAG4_ACC_NORM_BIT_OFFSET        (12U)               
#define DRX_DIAG4_ACC_NORM_BIT_LEN           (4U)                
#define DRX_DIAG4_ACC_NORM_BIT_MASK          0xf000U              
#define DRX_DIAG4_RX_ACC_NOSAT_BIT_OFFSET    (0U)                
#define DRX_DIAG4_RX_ACC_NOSAT_BIT_LEN       (12U)               
#define DRX_DIAG4_RX_ACC_NOSAT_BIT_MASK      0xfffU               

