tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register RF_CTRL_MASK
**/
#define RF_CTRL_MASK_ID                      0x70004              
#define RF_CTRL_MASK_LEN                     (4U)                
#define RF_CTRL_MASK_MASK                    0xFFFFFFFFUL        
#define RF_CTRL_MASK_TX_CH4_EN_BIT_OFFSET    (31U)               
#define RF_CTRL_MASK_TX_CH4_EN_BIT_LEN       (1U)                
#define RF_CTRL_MASK_TX_CH4_EN_BIT_MASK      0x80000000UL         
#define RF_CTRL_MASK_TX_CH3_EN_BIT_OFFSET    (30U)               
#define RF_CTRL_MASK_TX_CH3_EN_BIT_LEN       (1U)                
#define RF_CTRL_MASK_TX_CH3_EN_BIT_MASK      0x40000000UL         
#define RF_CTRL_MASK_TX_CH2_EN_BIT_OFFSET    (29U)               
#define RF_CTRL_MASK_TX_CH2_EN_BIT_LEN       (1U)                
#define RF_CTRL_MASK_TX_CH2_EN_BIT_MASK      0x20000000UL         
#define RF_CTRL_MASK_TX_CH1_EN_BIT_OFFSET    (28U)               
#define RF_CTRL_MASK_TX_CH1_EN_BIT_LEN       (1U)                
#define RF_CTRL_MASK_TX_CH1_EN_BIT_MASK      0x10000000UL         
#define RF_CTRL_MASK_PLL_RX_PRE_EN_BIT_OFFSET (27U)               
#define RF_CTRL_MASK_PLL_RX_PRE_EN_BIT_LEN   (1U)                
#define RF_CTRL_MASK_PLL_RX_PRE_EN_BIT_MASK  0x8000000UL          
#define RF_CTRL_MASK_PLL_TX_PRE_EN_BIT_OFFSET (26U)               
#define RF_CTRL_MASK_PLL_TX_PRE_EN_BIT_LEN   (1U)                
#define RF_CTRL_MASK_PLL_TX_PRE_EN_BIT_MASK  0x4000000UL          
#define RF_CTRL_MASK_TX_SW_EN_BIT_OFFSET     (25U)               
#define RF_CTRL_MASK_TX_SW_EN_BIT_LEN        (1U)                
#define RF_CTRL_MASK_TX_SW_EN_BIT_MASK       0x2000000UL          
#define RF_CTRL_MASK_RX9_SW_EN_BIT_OFFSET    (24U)               
#define RF_CTRL_MASK_RX9_SW_EN_BIT_LEN       (1U)                
#define RF_CTRL_MASK_RX9_SW_EN_BIT_MASK      0x1000000UL          
#define RF_CTRL_MASK_RX5_SW_EN_BIT_OFFSET    (23U)               
#define RF_CTRL_MASK_RX5_SW_EN_BIT_LEN       (1U)                
#define RF_CTRL_MASK_RX5_SW_EN_BIT_MASK      0x800000UL           
#define RF_CTRL_MASK_ED_EN_BIT_OFFSET        (22U)               
#define RF_CTRL_MASK_ED_EN_BIT_LEN           (1U)                
#define RF_CTRL_MASK_ED_EN_BIT_MASK          0x400000UL           
#define RF_CTRL_MASK_PLL_TX_EN_BIT_OFFSET    (21U)               
#define RF_CTRL_MASK_PLL_TX_EN_BIT_LEN       (1U)                
#define RF_CTRL_MASK_PLL_TX_EN_BIT_MASK      0x200000UL           
#define RF_CTRL_MASK_PLL_RX_EN_BIT_OFFSET    (20U)               
#define RF_CTRL_MASK_PLL_RX_EN_BIT_LEN       (1U)                
#define RF_CTRL_MASK_PLL_RX_EN_BIT_MASK      0x100000UL           
#define RF_CTRL_MASK_PLL_CH9_BIT_OFFSET      (18U)               
#define RF_CTRL_MASK_PLL_CH9_BIT_LEN         (1U)                
#define RF_CTRL_MASK_PLL_CH9_BIT_MASK        0x40000UL            
#define RF_CTRL_MASK_PLL_CH5_BIT_OFFSET      (17U)               
#define RF_CTRL_MASK_PLL_CH5_BIT_LEN         (1U)                
#define RF_CTRL_MASK_PLL_CH5_BIT_MASK        0x20000UL            
#define RF_CTRL_MASK_PLL_LOOPCH_BIT_OFFSET   (16U)               
#define RF_CTRL_MASK_PLL_LOOPCH_BIT_LEN      (1U)                
#define RF_CTRL_MASK_PLL_LOOPCH_BIT_MASK     0x10000UL            
#define RF_CTRL_MASK_PLL_RST_N_BIT_OFFSET    (15U)               
#define RF_CTRL_MASK_PLL_RST_N_BIT_LEN       (1U)                
#define RF_CTRL_MASK_PLL_RST_N_BIT_MASK      0x8000U              
#define RF_CTRL_MASK_PLL_EN_BIT_OFFSET       (14U)               
#define RF_CTRL_MASK_PLL_EN_BIT_LEN          (1U)                
#define RF_CTRL_MASK_PLL_EN_BIT_MASK         0x4000U              
#define RF_CTRL_MASK_TX_CH5_BIT_OFFSET       (13U)               
#define RF_CTRL_MASK_TX_CH5_BIT_LEN          (1U)                
#define RF_CTRL_MASK_TX_CH5_BIT_MASK         0x2000U              
#define RF_CTRL_MASK_TX_EN_BIT_OFFSET        (12U)               
#define RF_CTRL_MASK_TX_EN_BIT_LEN           (1U)                
#define RF_CTRL_MASK_TX_EN_BIT_MASK          0x1000U              
#define RF_CTRL_MASK_TX_EN_BUF_BIT_OFFSET    (11U)               
#define RF_CTRL_MASK_TX_EN_BUF_BIT_LEN       (1U)                
#define RF_CTRL_MASK_TX_EN_BUF_BIT_MASK      0x800U               
#define RF_CTRL_MASK_TX_BIAS_EN_BIT_OFFSET   (10U)               
#define RF_CTRL_MASK_TX_BIAS_EN_BIT_LEN      (1U)                
#define RF_CTRL_MASK_TX_BIAS_EN_BIT_MASK     0x400U               
#define RF_CTRL_MASK_LNA9_CORE_EN_BIT_OFFSET (9U)                
#define RF_CTRL_MASK_LNA9_CORE_EN_BIT_LEN    (1U)                
#define RF_CTRL_MASK_LNA9_CORE_EN_BIT_MASK   0x200U               
#define RF_CTRL_MASK_LNA9_BIAS_EN_BIT_OFFSET (8U)                
#define RF_CTRL_MASK_LNA9_BIAS_EN_BIT_LEN    (1U)                
#define RF_CTRL_MASK_LNA9_BIAS_EN_BIT_MASK   0x100U               
#define RF_CTRL_MASK_RXMIX9_EN_BIT_OFFSET    (7U)                
#define RF_CTRL_MASK_RXMIX9_EN_BIT_LEN       (1U)                
#define RF_CTRL_MASK_RXMIX9_EN_BIT_MASK      0x80U                
#define RF_CTRL_MASK_LNA5_CORE_EN_BIT_OFFSET (6U)                
#define RF_CTRL_MASK_LNA5_CORE_EN_BIT_LEN    (1U)                
#define RF_CTRL_MASK_LNA5_CORE_EN_BIT_MASK   0x40U                
#define RF_CTRL_MASK_LNA5_BIAS_EN_BIT_OFFSET (5U)                
#define RF_CTRL_MASK_LNA5_BIAS_EN_BIT_LEN    (1U)                
#define RF_CTRL_MASK_LNA5_BIAS_EN_BIT_MASK   0x20U                
#define RF_CTRL_MASK_RXMIX5_EN_BIT_OFFSET    (4U)                
#define RF_CTRL_MASK_RXMIX5_EN_BIT_LEN       (1U)                
#define RF_CTRL_MASK_RXMIX5_EN_BIT_MASK      0x10U                
#define RF_CTRL_MASK_MIXRC_EN_BIT_OFFSET     (3U)                
#define RF_CTRL_MASK_MIXRC_EN_BIT_LEN        (1U)                
#define RF_CTRL_MASK_MIXRC_EN_BIT_MASK       0x8U                 
#define RF_CTRL_MASK_PGF_EN_BIT_OFFSET       (2U)                
#define RF_CTRL_MASK_PGF_EN_BIT_LEN          (1U)                
#define RF_CTRL_MASK_PGF_EN_BIT_MASK         0x4U                 
#define RF_CTRL_MASK_ADCQ_EN_BIT_OFFSET      (1U)                
#define RF_CTRL_MASK_ADCQ_EN_BIT_LEN         (1U)                
#define RF_CTRL_MASK_ADCQ_EN_BIT_MASK        0x2U                 
#define RF_CTRL_MASK_ADCI_EN_BIT_OFFSET      (0U)                
#define RF_CTRL_MASK_ADCI_EN_BIT_LEN         (1U)                
#define RF_CTRL_MASK_ADCI_EN_BIT_MASK        0x1U                 

