tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register RX_CTRL_LO
**/
#define RX_CTRL_LO_ID                        0x70008              
#define RX_CTRL_LO_LEN                       (4U)                
#define RX_CTRL_LO_MASK                      0xFFFFFFFFUL        
#define RX_CTRL_LO_RX5_LNA2_FCBW_ADJ_BIT_OFFSET (29U)               
#define RX_CTRL_LO_RX5_LNA2_FCBW_ADJ_BIT_LEN (2U)                
#define RX_CTRL_LO_RX5_LNA2_FCBW_ADJ_BIT_MASK 0x60000000UL         
#define RX_CTRL_LO_RX5_NOTCH2_ADJ_BIT_OFFSET (27U)               
#define RX_CTRL_LO_RX5_NOTCH2_ADJ_BIT_LEN    (2U)                
#define RX_CTRL_LO_RX5_NOTCH2_ADJ_BIT_MASK   0x18000000UL         
#define RX_CTRL_LO_RX5_IPROG_LNA1_BIT_OFFSET (24U)               
#define RX_CTRL_LO_RX5_IPROG_LNA1_BIT_LEN    (3U)                
#define RX_CTRL_LO_RX5_IPROG_LNA1_BIT_MASK   0x7000000UL          
#define RX_CTRL_LO_RX5_INDEPENDENTNOTCH1_EN_BIT_OFFSET (23U)               
#define RX_CTRL_LO_RX5_INDEPENDENTNOTCH1_EN_BIT_LEN (1U)                
#define RX_CTRL_LO_RX5_INDEPENDENTNOTCH1_EN_BIT_MASK 0x800000UL           
#define RX_CTRL_LO_MIX_R_CODE_BIT_OFFSET     (21U)               
#define RX_CTRL_LO_MIX_R_CODE_BIT_LEN        (2U)                
#define RX_CTRL_LO_MIX_R_CODE_BIT_MASK       0x600000UL           
#define RX_CTRL_LO_MIX_C_CODE_BIT_OFFSET     (16U)               
#define RX_CTRL_LO_MIX_C_CODE_BIT_LEN        (5U)                
#define RX_CTRL_LO_MIX_C_CODE_BIT_MASK       0x1f0000UL           
#define RX_CTRL_LO_PGF_RPOLY_TRIM_BIT_OFFSET (11U)               
#define RX_CTRL_LO_PGF_RPOLY_TRIM_BIT_LEN    (5U)                
#define RX_CTRL_LO_PGF_RPOLY_TRIM_BIT_MASK   0xf800U              
#define RX_CTRL_LO_PGF_PTAT_SEL_BIT_OFFSET   (10U)               
#define RX_CTRL_LO_PGF_PTAT_SEL_BIT_LEN      (1U)                
#define RX_CTRL_LO_PGF_PTAT_SEL_BIT_MASK     0x400U               
#define RX_CTRL_LO_PGF_BUF_BIAS_BIT_OFFSET   (8U)                
#define RX_CTRL_LO_PGF_BUF_BIAS_BIT_LEN      (2U)                
#define RX_CTRL_LO_PGF_BUF_BIAS_BIT_MASK     0x300U               
#define RX_CTRL_LO_PGF_VCM_IN_SEL_BIT_OFFSET (6U)                
#define RX_CTRL_LO_PGF_VCM_IN_SEL_BIT_LEN    (2U)                
#define RX_CTRL_LO_PGF_VCM_IN_SEL_BIT_MASK   0xc0U                
#define RX_CTRL_LO_PGF_VCM_OUT_SEL_BIT_OFFSET (4U)                
#define RX_CTRL_LO_PGF_VCM_OUT_SEL_BIT_LEN   (2U)                
#define RX_CTRL_LO_PGF_VCM_OUT_SEL_BIT_MASK  0x30U                
#define RX_CTRL_LO_ADC_BIAS_CTRL_BIT_OFFSET  (2U)                
#define RX_CTRL_LO_ADC_BIAS_CTRL_BIT_LEN     (2U)                
#define RX_CTRL_LO_ADC_BIAS_CTRL_BIT_MASK    0xcU                 
#define RX_CTRL_LO_ADC_VCM_CTRL_BIT_OFFSET   (0U)                
#define RX_CTRL_LO_ADC_VCM_CTRL_BIT_LEN      (2U)                
#define RX_CTRL_LO_ADC_VCM_CTRL_BIT_MASK     0x3U                 

/******************************************************************************
* @brief Bit definitions for register RX_CTRL_MID
**/
#define RX_CTRL_MID_ID                       0x7000c              
#define RX_CTRL_MID_LEN                      (4U)                
#define RX_CTRL_MID_MASK                     0xFFFFFFFFUL        
#define RX_CTRL_MID_RX5_NOTCH1_ADJ_BIT_OFFSET (28U)               
#define RX_CTRL_MID_RX5_NOTCH1_ADJ_BIT_LEN   (2U)                
#define RX_CTRL_MID_RX5_NOTCH1_ADJ_BIT_MASK  0x30000000UL         
#define RX_CTRL_MID_RX5_INDEPENDENTLOAD2_EN_BIT_OFFSET (27U)               
#define RX_CTRL_MID_RX5_INDEPENDENTLOAD2_EN_BIT_LEN (1U)                
#define RX_CTRL_MID_RX5_INDEPENDENTLOAD2_EN_BIT_MASK 0x8000000UL          
#define RX_CTRL_MID_RX5_LNA_LOAD2_PROG_BIT_OFFSET (22U)               
#define RX_CTRL_MID_RX5_LNA_LOAD2_PROG_BIT_LEN (5U)                
#define RX_CTRL_MID_RX5_LNA_LOAD2_PROG_BIT_MASK 0x7c00000UL          
#define RX_CTRL_MID_RX5_INDEPENDENTNOTCH2_EN_BIT_OFFSET (21U)               
#define RX_CTRL_MID_RX5_INDEPENDENTNOTCH2_EN_BIT_LEN (1U)                
#define RX_CTRL_MID_RX5_INDEPENDENTNOTCH2_EN_BIT_MASK 0x200000UL           
#define RX_CTRL_MID_RX5_LNA_NOTCH2_PROG_BIT_OFFSET (16U)               
#define RX_CTRL_MID_RX5_LNA_NOTCH2_PROG_BIT_LEN (5U)                
#define RX_CTRL_MID_RX5_LNA_NOTCH2_PROG_BIT_MASK 0x1f0000UL           
#define RX_CTRL_MID_RX5_LNA_LOAD1_PROG_BIT_OFFSET (11U)               
#define RX_CTRL_MID_RX5_LNA_LOAD1_PROG_BIT_LEN (5U)                
#define RX_CTRL_MID_RX5_LNA_LOAD1_PROG_BIT_MASK 0xf800U              
#define RX_CTRL_MID_RX5_LNA1_FCBW_ADJ_BIT_OFFSET (9U)                
#define RX_CTRL_MID_RX5_LNA1_FCBW_ADJ_BIT_LEN (2U)                
#define RX_CTRL_MID_RX5_LNA1_FCBW_ADJ_BIT_MASK 0x600U               
#define RX_CTRL_MID_RX5_IPROG_LNA2_BIT_OFFSET (5U)                
#define RX_CTRL_MID_RX5_IPROG_LNA2_BIT_LEN   (4U)                
#define RX_CTRL_MID_RX5_IPROG_LNA2_BIT_MASK  0x1e0U               
#define RX_CTRL_MID_RX5_LNA_NOTCH1_PROG_BIT_OFFSET (0U)                
#define RX_CTRL_MID_RX5_LNA_NOTCH1_PROG_BIT_LEN (5U)                
#define RX_CTRL_MID_RX5_LNA_NOTCH1_PROG_BIT_MASK 0x1fU                

/******************************************************************************
* @brief Bit definitions for register RX_CTRL_HI
**/
#define RX_CTRL_HI_ID                        0x70010              
#define RX_CTRL_HI_LEN                       (4U)                
#define RX_CTRL_HI_MASK                      0xFFFFFFFFUL        
#define RX_CTRL_HI_RX9_RPROG_LV_BIT_OFFSET   (25U)               
#define RX_CTRL_HI_RX9_RPROG_LV_BIT_LEN      (4U)                
#define RX_CTRL_HI_RX9_RPROG_LV_BIT_MASK     0x1e000000UL         
#define RX_CTRL_HI_RX9_LOADLNA_PROG1_BIT_OFFSET (20U)               
#define RX_CTRL_HI_RX9_LOADLNA_PROG1_BIT_LEN (5U)                
#define RX_CTRL_HI_RX9_LOADLNA_PROG1_BIT_MASK 0x1f00000UL          
#define RX_CTRL_HI_RX9_LOADLNA_PROG2_BIT_OFFSET (15U)               
#define RX_CTRL_HI_RX9_LOADLNA_PROG2_BIT_LEN (5U)                
#define RX_CTRL_HI_RX9_LOADLNA_PROG2_BIT_MASK 0xf8000UL            
#define RX_CTRL_HI_RX9_LNA1_FCBW_ADJ_BIT_OFFSET (13U)               
#define RX_CTRL_HI_RX9_LNA1_FCBW_ADJ_BIT_LEN (2U)                
#define RX_CTRL_HI_RX9_LNA1_FCBW_ADJ_BIT_MASK 0x6000U              
#define RX_CTRL_HI_RX9_LNA2_FCBW_ADJ_BIT_OFFSET (11U)               
#define RX_CTRL_HI_RX9_LNA2_FCBW_ADJ_BIT_LEN (2U)                
#define RX_CTRL_HI_RX9_LNA2_FCBW_ADJ_BIT_MASK 0x1800U              
#define RX_CTRL_HI_RX9_IPROG_LNA1_BIT_OFFSET (4U)                
#define RX_CTRL_HI_RX9_IPROG_LNA1_BIT_LEN    (3U)                
#define RX_CTRL_HI_RX9_IPROG_LNA1_BIT_MASK   0x70U                
#define RX_CTRL_HI_RX9_IPROG_LNA2_BIT_OFFSET (0U)                
#define RX_CTRL_HI_RX9_IPROG_LNA2_BIT_LEN    (4U)                
#define RX_CTRL_HI_RX9_IPROG_LNA2_BIT_MASK   0xfU                 

