tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register PDOA_CTRL
**/
#define PDOA_CTRL_ID                         0x70014              
#define PDOA_CTRL_LEN                        (4U)                
#define PDOA_CTRL_MASK                       0xFFFFFFFFUL        
#define PDOA_CTRL_TXRX_SW_OVR_CTRL_BIT_OFFSET (24U)               
#define PDOA_CTRL_TXRX_SW_OVR_CTRL_BIT_LEN   (6U)                
#define PDOA_CTRL_TXRX_SW_OVR_CTRL_BIT_MASK  0x3f000000UL         
#define PDOA_CTRL_TXRX_SW_OVR_EN_BIT_OFFSET  (16U)               
#define PDOA_CTRL_TXRX_SW_OVR_EN_BIT_LEN     (1U)                
#define PDOA_CTRL_TXRX_SW_OVR_EN_BIT_MASK    0x10000UL            
#define PDOA_CTRL_ANT_EXT_DEFAULT_PORT_BIT_OFFSET (15U)               
#define PDOA_CTRL_ANT_EXT_DEFAULT_PORT_BIT_LEN (1U)                
#define PDOA_CTRL_ANT_EXT_DEFAULT_PORT_BIT_MASK 0x8000U              
#define PDOA_CTRL_ANT_SW_OVR_CTRL_BIT_OFFSET (12U)               
#define PDOA_CTRL_ANT_SW_OVR_CTRL_BIT_LEN    (3U)                
#define PDOA_CTRL_ANT_SW_OVR_CTRL_BIT_MASK   0x7000U              
#define PDOA_CTRL_ANT_SW_OVR_EN_BIT_OFFSET   (8U)                
#define PDOA_CTRL_ANT_SW_OVR_EN_BIT_LEN      (1U)                
#define PDOA_CTRL_ANT_SW_OVR_EN_BIT_MASK     0x100U               
#define PDOA_CTRL_ANT_DEFAULT_PORT_BIT_OFFSET (1U)                
#define PDOA_CTRL_ANT_DEFAULT_PORT_BIT_LEN   (1U)                
#define PDOA_CTRL_ANT_DEFAULT_PORT_BIT_MASK  0x2U                 
#define PDOA_CTRL_ANT_SW_NO_TOGGLE_BIT_OFFSET (0U)                
#define PDOA_CTRL_ANT_SW_NO_TOGGLE_BIT_LEN   (1U)                
#define PDOA_CTRL_ANT_SW_NO_TOGGLE_BIT_MASK  0x1U                 

/******************************************************************************
* @brief Bit definitions for register TX_CTRL_LO
**/
#define TX_CTRL_LO_ID                        0x70018              
#define TX_CTRL_LO_LEN                       (4U)                
#define TX_CTRL_LO_MASK                      0xFFFFFFFFUL        
#define TX_CTRL_LO_TX_BLEED_CTRL_BIT_OFFSET  (25U)               
#define TX_CTRL_LO_TX_BLEED_CTRL_BIT_LEN     (3U)                
#define TX_CTRL_LO_TX_BLEED_CTRL_BIT_MASK    0xe000000UL          
#define TX_CTRL_LO_TX_LOBUF_CTRL_BIT_OFFSET  (20U)               
#define TX_CTRL_LO_TX_LOBUF_CTRL_BIT_LEN     (5U)                
#define TX_CTRL_LO_TX_LOBUF_CTRL_BIT_MASK    0x1f00000UL          
#define TX_CTRL_LO_TX_VBULK_CTRL_BIT_OFFSET  (18U)               
#define TX_CTRL_LO_TX_VBULK_CTRL_BIT_LEN     (2U)                
#define TX_CTRL_LO_TX_VBULK_CTRL_BIT_MASK    0xc0000UL            
#define TX_CTRL_LO_TX_VCASC_CTRL_BIT_OFFSET  (16U)               
#define TX_CTRL_LO_TX_VCASC_CTRL_BIT_LEN     (2U)                
#define TX_CTRL_LO_TX_VCASC_CTRL_BIT_MASK    0x30000UL            
#define TX_CTRL_LO_TX_VCM_CTRL_BIT_OFFSET    (8U)                
#define TX_CTRL_LO_TX_VCM_CTRL_BIT_LEN       (8U)                
#define TX_CTRL_LO_TX_VCM_CTRL_BIT_MASK      0xff00U              
#define TX_CTRL_LO_TX_DELAY_SEL_BIT_OFFSET   (6U)                
#define TX_CTRL_LO_TX_DELAY_SEL_BIT_LEN      (2U)                
#define TX_CTRL_LO_TX_DELAY_SEL_BIT_MASK     0xc0U                
#define TX_CTRL_LO_TX_CF_CTRL_BIT_OFFSET     (1U)                
#define TX_CTRL_LO_TX_CF_CTRL_BIT_LEN        (5U)                
#define TX_CTRL_LO_TX_CF_CTRL_BIT_MASK       0x3eU                
#define TX_CTRL_LO_TX_CF_FORCE_BIT_OFFSET    (0U)                
#define TX_CTRL_LO_TX_CF_FORCE_BIT_LEN       (1U)                
#define TX_CTRL_LO_TX_CF_FORCE_BIT_MASK      0x1U                 

/******************************************************************************
* @brief Bit definitions for register TX_CTRL_HI
**/
#define TX_CTRL_HI_ID                        0x7001c              
#define TX_CTRL_HI_LEN                       (4U)                
#define TX_CTRL_HI_MASK                      0xFFFFFFFFUL        
#define TX_CTRL_HI_TX_PULSE_SHAPE_BIT_OFFSET (31U)               
#define TX_CTRL_HI_TX_PULSE_SHAPE_BIT_LEN    (1U)                
#define TX_CTRL_HI_TX_PULSE_SHAPE_BIT_MASK   0x80000000UL         
#define TX_CTRL_HI_TX_OFF_SW_STATE_BIT_OFFSET (23U)               
#define TX_CTRL_HI_TX_OFF_SW_STATE_BIT_LEN   (6U)                
#define TX_CTRL_HI_TX_OFF_SW_STATE_BIT_MASK  0x1f800000UL         
#define TX_CTRL_HI_TX_OFF_SW_DLY_BIT_OFFSET  (21U)               
#define TX_CTRL_HI_TX_OFF_SW_DLY_BIT_LEN     (2U)                
#define TX_CTRL_HI_TX_OFF_SW_DLY_BIT_MASK    0x600000UL           
#define TX_CTRL_HI_TX_CTUNE_LO_BIT_OFFSET    (16U)               
#define TX_CTRL_HI_TX_CTUNE_LO_BIT_LEN       (4U)                
#define TX_CTRL_HI_TX_CTUNE_LO_BIT_MASK      0xf0000UL            
#define TX_CTRL_HI_TX_CTUNE_LOAD_P_BIT_OFFSET (12U)               
#define TX_CTRL_HI_TX_CTUNE_LOAD_P_BIT_LEN   (4U)                
#define TX_CTRL_HI_TX_CTUNE_LOAD_P_BIT_MASK  0xf000U              
#define TX_CTRL_HI_TX_CTUNE_LOAD_M_BIT_OFFSET (8U)                
#define TX_CTRL_HI_TX_CTUNE_LOAD_M_BIT_LEN   (4U)                
#define TX_CTRL_HI_TX_CTUNE_LOAD_M_BIT_MASK  0xf00U               
#define TX_CTRL_HI_TX_PG_START_NUM_BIT_OFFSET (6U)                
#define TX_CTRL_HI_TX_PG_START_NUM_BIT_LEN   (2U)                
#define TX_CTRL_HI_TX_PG_START_NUM_BIT_MASK  0xc0U                
#define TX_CTRL_HI_TX_PG_DELAY_BIT_OFFSET    (0U)                
#define TX_CTRL_HI_TX_PG_DELAY_BIT_LEN       (6U)                
#define TX_CTRL_HI_TX_PG_DELAY_BIT_MASK      0x3fU                

/******************************************************************************
* @brief Bit definitions for register ED_CTRL
**/
#define ED_CTRL_ID                           0x70020              
#define ED_CTRL_LEN                          (4U)                
#define ED_CTRL_MASK                         0xFFFFFFFFUL        
#define ED_CTRL_DIG_ENDET1_EN_BUFF_X2GAIN_ULV_BIT_OFFSET (31U)               
#define ED_CTRL_DIG_ENDET1_EN_BUFF_X2GAIN_ULV_BIT_LEN (1U)                
#define ED_CTRL_DIG_ENDET1_EN_BUFF_X2GAIN_ULV_BIT_MASK 0x80000000UL         
#define ED_CTRL_DIG_ENDET1_DDA_GAIN_ULV_BIT_OFFSET (25U)               
#define ED_CTRL_DIG_ENDET1_DDA_GAIN_ULV_BIT_LEN (6U)                
#define ED_CTRL_DIG_ENDET1_DDA_GAIN_ULV_BIT_MASK 0x7e000000UL         
#define ED_CTRL_DIG_ENDET1_DDA_OS_TRIM_ULV_BIT_OFFSET (16U)               
#define ED_CTRL_DIG_ENDET1_DDA_OS_TRIM_ULV_BIT_LEN (9U)                
#define ED_CTRL_DIG_ENDET1_DDA_OS_TRIM_ULV_BIT_MASK 0x1ff0000UL          
#define ED_CTRL_DIG_ENDET0_EN_BUFF_X2GAIN_ULV_BIT_OFFSET (15U)               
#define ED_CTRL_DIG_ENDET0_EN_BUFF_X2GAIN_ULV_BIT_LEN (1U)                
#define ED_CTRL_DIG_ENDET0_EN_BUFF_X2GAIN_ULV_BIT_MASK 0x8000U              
#define ED_CTRL_DIG_ENDET0_DDA_GAIN_ULV_BIT_OFFSET (9U)                
#define ED_CTRL_DIG_ENDET0_DDA_GAIN_ULV_BIT_LEN (6U)                
#define ED_CTRL_DIG_ENDET0_DDA_GAIN_ULV_BIT_MASK 0x7e00U              
#define ED_CTRL_DIG_ENDET0_DDA_OS_TRIM_ULV_BIT_OFFSET (0U)                
#define ED_CTRL_DIG_ENDET0_DDA_OS_TRIM_ULV_BIT_LEN (9U)                
#define ED_CTRL_DIG_ENDET0_DDA_OS_TRIM_ULV_BIT_MASK 0x1ffU               

