tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register RX_TEST
**/
#define RX_TEST_ID                           0x70024              
#define RX_TEST_LEN                          (4U)                
#define RX_TEST_MASK                         0xFFFFFFFFUL        
#define RX_TEST_PLL_TEST_SEL_BIT_OFFSET      (30U)               
#define RX_TEST_PLL_TEST_SEL_BIT_LEN         (2U)                
#define RX_TEST_PLL_TEST_SEL_BIT_MASK        0xc0000000UL         
#define RX_TEST_RXCH9_DCTST_EN_BIT_OFFSET    (29U)               
#define RX_TEST_RXCH9_DCTST_EN_BIT_LEN       (1U)                
#define RX_TEST_RXCH9_DCTST_EN_BIT_MASK      0x20000000UL         
#define RX_TEST_RXCH9_DCTST_SEL_BIT_OFFSET   (27U)               
#define RX_TEST_RXCH9_DCTST_SEL_BIT_LEN      (2U)                
#define RX_TEST_RXCH9_DCTST_SEL_BIT_MASK     0x18000000UL         
#define RX_TEST_RXCH5_DCTST_EN_BIT_OFFSET    (26U)               
#define RX_TEST_RXCH5_DCTST_EN_BIT_LEN       (1U)                
#define RX_TEST_RXCH5_DCTST_EN_BIT_MASK      0x4000000UL          
#define RX_TEST_RXCH5_DCTST_SEL_BIT_OFFSET   (24U)               
#define RX_TEST_RXCH5_DCTST_SEL_BIT_LEN      (2U)                
#define RX_TEST_RXCH5_DCTST_SEL_BIT_MASK     0x3000000UL          
#define RX_TEST_ADC_CLK_EDGE_I_BIT_OFFSET    (23U)               
#define RX_TEST_ADC_CLK_EDGE_I_BIT_LEN       (1U)                
#define RX_TEST_ADC_CLK_EDGE_I_BIT_MASK      0x800000UL           
#define RX_TEST_ADC_CLK_EDGE_Q_BIT_OFFSET    (22U)               
#define RX_TEST_ADC_CLK_EDGE_Q_BIT_LEN       (1U)                
#define RX_TEST_ADC_CLK_EDGE_Q_BIT_MASK      0x400000UL           
#define RX_TEST_ADC_DIG_TEST_IN_BIT_OFFSET   (21U)               
#define RX_TEST_ADC_DIG_TEST_IN_BIT_LEN      (1U)                
#define RX_TEST_ADC_DIG_TEST_IN_BIT_MASK     0x200000UL           
#define RX_TEST_PLL_EN_TST_125CLK_OUT_BIT_OFFSET (20U)               
#define RX_TEST_PLL_EN_TST_125CLK_OUT_BIT_LEN (1U)                
#define RX_TEST_PLL_EN_TST_125CLK_OUT_BIT_MASK 0x100000UL           
#define RX_TEST_PLL_EN_TST_BUFF_OUT_BIT_OFFSET (19U)               
#define RX_TEST_PLL_EN_TST_BUFF_OUT_BIT_LEN  (1U)                
#define RX_TEST_PLL_EN_TST_BUFF_OUT_BIT_MASK 0x80000UL            
#define RX_TEST_RXMIX_IPTST_PGF_SEL_BIT_OFFSET (17U)               
#define RX_TEST_RXMIX_IPTST_PGF_SEL_BIT_LEN  (2U)                
#define RX_TEST_RXMIX_IPTST_PGF_SEL_BIT_MASK 0x60000UL            
#define RX_TEST_RXMIX_ACTST_MIX_SEL_BIT_OFFSET (15U)               
#define RX_TEST_RXMIX_ACTST_MIX_SEL_BIT_LEN  (2U)                
#define RX_TEST_RXMIX_ACTST_MIX_SEL_BIT_MASK 0x18000UL            
#define RX_TEST_RXMIX_ACTST_PGF_SEL_BIT_OFFSET (13U)               
#define RX_TEST_RXMIX_ACTST_PGF_SEL_BIT_LEN  (2U)                
#define RX_TEST_RXMIX_ACTST_PGF_SEL_BIT_MASK 0x6000U              
#define RX_TEST_PGF_AC_BYP_EN_BIT_OFFSET     (12U)               
#define RX_TEST_PGF_AC_BYP_EN_BIT_LEN        (1U)                
#define RX_TEST_PGF_AC_BYP_EN_BIT_MASK       0x1000U              
#define RX_TEST_PGF_AC_SHORT_EN_BIT_OFFSET   (11U)               
#define RX_TEST_PGF_AC_SHORT_EN_BIT_LEN      (1U)                
#define RX_TEST_PGF_AC_SHORT_EN_BIT_MASK     0x800U               
#define RX_TEST_PGF_HF_TEST_EN_BIT_OFFSET    (10U)               
#define RX_TEST_PGF_HF_TEST_EN_BIT_LEN       (1U)                
#define RX_TEST_PGF_HF_TEST_EN_BIT_MASK      0x400U               
#define RX_TEST_PGF_Q_DC_TEST_EN_BIT_OFFSET  (9U)                
#define RX_TEST_PGF_Q_DC_TEST_EN_BIT_LEN     (1U)                
#define RX_TEST_PGF_Q_DC_TEST_EN_BIT_MASK    0x200U               
#define RX_TEST_PGF_I_DC_TEST_EN_BIT_OFFSET  (8U)                
#define RX_TEST_PGF_I_DC_TEST_EN_BIT_LEN     (1U)                
#define RX_TEST_PGF_I_DC_TEST_EN_BIT_MASK    0x100U               
#define RX_TEST_PGF_TEST_DC_BIT_OFFSET       (5U)                
#define RX_TEST_PGF_TEST_DC_BIT_LEN          (3U)                
#define RX_TEST_PGF_TEST_DC_BIT_MASK         0xe0U                
#define RX_TEST_ADC_TEST_CTRL_BIT_OFFSET     (2U)                
#define RX_TEST_ADC_TEST_CTRL_BIT_LEN        (3U)                
#define RX_TEST_ADC_TEST_CTRL_BIT_MASK       0x1cU                
#define RX_TEST_ADC_ANATEST_CTRL_BIT_OFFSET  (0U)                
#define RX_TEST_ADC_ANATEST_CTRL_BIT_LEN     (2U)                
#define RX_TEST_ADC_ANATEST_CTRL_BIT_MASK    0x3U                 

/******************************************************************************
* @brief Bit definitions for register TX_TEST
**/
#define TX_TEST_ID                           0x70028              
#define TX_TEST_LEN                          (4U)                
#define TX_TEST_MASK                         0xFFFFFFFFUL        
#define TX_TEST_PGTEST_EN_CH4_BIT_OFFSET     (27U)               
#define TX_TEST_PGTEST_EN_CH4_BIT_LEN        (1U)                
#define TX_TEST_PGTEST_EN_CH4_BIT_MASK       0x8000000UL          
#define TX_TEST_PGTEST_EN_CH3_BIT_OFFSET     (26U)               
#define TX_TEST_PGTEST_EN_CH3_BIT_LEN        (1U)                
#define TX_TEST_PGTEST_EN_CH3_BIT_MASK       0x4000000UL          
#define TX_TEST_PGTEST_EN_CH2_BIT_OFFSET     (25U)               
#define TX_TEST_PGTEST_EN_CH2_BIT_LEN        (1U)                
#define TX_TEST_PGTEST_EN_CH2_BIT_MASK       0x2000000UL          
#define TX_TEST_PGTEST_EN_CH1_BIT_OFFSET     (24U)               
#define TX_TEST_PGTEST_EN_CH1_BIT_LEN        (1U)                
#define TX_TEST_PGTEST_EN_CH1_BIT_MASK       0x1000000UL          
#define TX_TEST_XTAL_ANATEST_EN_BIT_OFFSET   (18U)               
#define TX_TEST_XTAL_ANATEST_EN_BIT_LEN      (1U)                
#define TX_TEST_XTAL_ANATEST_EN_BIT_MASK     0x40000UL            
#define TX_TEST_XTAL_ANATEST_SEL_BIT_OFFSET  (15U)               
#define TX_TEST_XTAL_ANATEST_SEL_BIT_LEN     (3U)                
#define TX_TEST_XTAL_ANATEST_SEL_BIT_MASK    0x38000UL            
#define TX_TEST_TX_VCM_CTRL_HI_BIT_OFFSET    (13U)               
#define TX_TEST_TX_VCM_CTRL_HI_BIT_LEN       (2U)                
#define TX_TEST_TX_VCM_CTRL_HI_BIT_MASK      0x6000U              
#define TX_TEST_TX_VCM_CTRL_LO_BIT_OFFSET    (9U)                
#define TX_TEST_TX_VCM_CTRL_LO_BIT_LEN       (4U)                
#define TX_TEST_TX_VCM_CTRL_LO_BIT_MASK      0x1e00U              
#define TX_TEST_TX_DC_TEST_BIT_OFFSET        (5U)                
#define TX_TEST_TX_DC_TEST_BIT_LEN           (4U)                
#define TX_TEST_TX_DC_TEST_BIT_MASK          0x1e0U               
#define TX_TEST_TX_DC_TEST_EN_BIT_OFFSET     (4U)                
#define TX_TEST_TX_DC_TEST_EN_BIT_LEN        (1U)                
#define TX_TEST_TX_DC_TEST_EN_BIT_MASK       0x10U                
#define TX_TEST_TX_ENTEST_CH1_BIT_OFFSET     (3U)                
#define TX_TEST_TX_ENTEST_CH1_BIT_LEN        (1U)                
#define TX_TEST_TX_ENTEST_CH1_BIT_MASK       0x8U                 
#define TX_TEST_TX_ENTEST_CH2_BIT_OFFSET     (2U)                
#define TX_TEST_TX_ENTEST_CH2_BIT_LEN        (1U)                
#define TX_TEST_TX_ENTEST_CH2_BIT_MASK       0x4U                 
#define TX_TEST_TX_ENTEST_CH3_BIT_OFFSET     (1U)                
#define TX_TEST_TX_ENTEST_CH3_BIT_LEN        (1U)                
#define TX_TEST_TX_ENTEST_CH3_BIT_MASK       0x2U                 
#define TX_TEST_TX_ENTEST_CH4_BIT_OFFSET     (0U)                
#define TX_TEST_TX_ENTEST_CH4_BIT_LEN        (1U)                
#define TX_TEST_TX_ENTEST_CH4_BIT_MASK       0x1U                 

