tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register SPARE_IO
**/
#define SPARE_IO_ID                          0x7002c              
#define SPARE_IO_LEN                         (4U)                
#define SPARE_IO_MASK                        0xFFFFFFFFUL        
#define SPARE_IO_SPARE_BIT_OFFSET            (0U)                
#define SPARE_IO_SPARE_BIT_LEN               (24U)               
#define SPARE_IO_SPARE_BIT_MASK              0xffffffUL           

/******************************************************************************
* @brief Bit definitions for register TESTMUX
**/
#define TESTMUX_ID                           0x70030              
#define TESTMUX_LEN                          (4U)                
#define TESTMUX_MASK                         0xFFFFFFFFUL        
#define TESTMUX_TMUX_DC_TEST_ENABLEP_BIT_OFFSET (31U)               
#define TESTMUX_TMUX_DC_TEST_ENABLEP_BIT_LEN (1U)                
#define TESTMUX_TMUX_DC_TEST_ENABLEP_BIT_MASK 0x80000000UL         
#define TESTMUX_TMUX_DC_TEST_ENABLEM_BIT_OFFSET (30U)               
#define TESTMUX_TMUX_DC_TEST_ENABLEM_BIT_LEN (1U)                
#define TESTMUX_TMUX_DC_TEST_ENABLEM_BIT_MASK 0x40000000UL         
#define TESTMUX_TMUX_DC_TEST_BYPASSP_BIT_OFFSET (29U)               
#define TESTMUX_TMUX_DC_TEST_BYPASSP_BIT_LEN (1U)                
#define TESTMUX_TMUX_DC_TEST_BYPASSP_BIT_MASK 0x20000000UL         
#define TESTMUX_TMUX_DC_TEST_BYPASSM_BIT_OFFSET (28U)               
#define TESTMUX_TMUX_DC_TEST_BYPASSM_BIT_LEN (1U)                
#define TESTMUX_TMUX_DC_TEST_BYPASSM_BIT_MASK 0x10000000UL         
#define TESTMUX_TMUX_DC_TEST_SELP_BIT_OFFSET (23U)               
#define TESTMUX_TMUX_DC_TEST_SELP_BIT_LEN    (5U)                
#define TESTMUX_TMUX_DC_TEST_SELP_BIT_MASK   0xf800000UL          
#define TESTMUX_TMUX_DC_TEST_SELM_BIT_OFFSET (18U)               
#define TESTMUX_TMUX_DC_TEST_SELM_BIT_LEN    (5U)                
#define TESTMUX_TMUX_DC_TEST_SELM_BIT_MASK   0x7c0000UL           
#define TESTMUX_TMUX_DC_RTESTP_EN_BIT_OFFSET (17U)               
#define TESTMUX_TMUX_DC_RTESTP_EN_BIT_LEN    (1U)                
#define TESTMUX_TMUX_DC_RTESTP_EN_BIT_MASK   0x20000UL            
#define TESTMUX_TMUX_DC_RTESTM_EN_BIT_OFFSET (16U)               
#define TESTMUX_TMUX_DC_RTESTM_EN_BIT_LEN    (1U)                
#define TESTMUX_TMUX_DC_RTESTM_EN_BIT_MASK   0x10000UL            
#define TESTMUX_TMUX_HFTEST_ENI_BIT_OFFSET   (15U)               
#define TESTMUX_TMUX_HFTEST_ENI_BIT_LEN      (1U)                
#define TESTMUX_TMUX_HFTEST_ENI_BIT_MASK     0x8000U              
#define TESTMUX_TMUX_HFTEST_ENQ_BIT_OFFSET   (14U)               
#define TESTMUX_TMUX_HFTEST_ENQ_BIT_LEN      (1U)                
#define TESTMUX_TMUX_HFTEST_ENQ_BIT_MASK     0x4000U              
#define TESTMUX_TMUX_HFTEST_SELI_BIT_OFFSET  (11U)               
#define TESTMUX_TMUX_HFTEST_SELI_BIT_LEN     (3U)                
#define TESTMUX_TMUX_HFTEST_SELI_BIT_MASK    0x3800U              
#define TESTMUX_TMUX_HFTEST_SELQ_BIT_OFFSET  (8U)                
#define TESTMUX_TMUX_HFTEST_SELQ_BIT_LEN     (3U)                
#define TESTMUX_TMUX_HFTEST_SELQ_BIT_MASK    0x700U               
#define TESTMUX_TMUX_HFTEST_DACP_BIT_OFFSET  (4U)                
#define TESTMUX_TMUX_HFTEST_DACP_BIT_LEN     (4U)                
#define TESTMUX_TMUX_HFTEST_DACP_BIT_MASK    0xf0U                
#define TESTMUX_TMUX_HFTEST_DACN_BIT_OFFSET  (0U)                
#define TESTMUX_TMUX_HFTEST_DACN_BIT_LEN     (4U)                
#define TESTMUX_TMUX_HFTEST_DACN_BIT_MASK    0xfU                 

/******************************************************************************
* @brief Bit definitions for register SAR_TEST
**/
#define SAR_TEST_ID                          0x70034              
#define SAR_TEST_LEN                         (4U)                
#define SAR_TEST_MASK                        0xFFFFFFFFUL        
#define SAR_TEST_DIG_AUXADC_BUFBYP_ULV_BIT_OFFSET (30U)               
#define SAR_TEST_DIG_AUXADC_BUFBYP_ULV_BIT_LEN (1U)                
#define SAR_TEST_DIG_AUXADC_BUFBYP_ULV_BIT_MASK 0x40000000UL         
#define SAR_TEST_DIG_AUXADC_FILTSEL_ULV_BIT_OFFSET (29U)               
#define SAR_TEST_DIG_AUXADC_FILTSEL_ULV_BIT_LEN (1U)                
#define SAR_TEST_DIG_AUXADC_FILTSEL_ULV_BIT_MASK 0x20000000UL         
#define SAR_TEST_DIG_AUXADC_FILTEN_ULV_BIT_OFFSET (28U)               
#define SAR_TEST_DIG_AUXADC_FILTEN_ULV_BIT_LEN (1U)                
#define SAR_TEST_DIG_AUXADC_FILTEN_ULV_BIT_MASK 0x10000000UL         
#define SAR_TEST_DIG_AUXADC_REF_CTRL_ULV_BIT_OFFSET (26U)               
#define SAR_TEST_DIG_AUXADC_REF_CTRL_ULV_BIT_LEN (2U)                
#define SAR_TEST_DIG_AUXADC_REF_CTRL_ULV_BIT_MASK 0xc000000UL          
#define SAR_TEST_DIG_AUXADC_BIAS_CTRL_ULV_BIT_OFFSET (23U)               
#define SAR_TEST_DIG_AUXADC_BIAS_CTRL_ULV_BIT_LEN (3U)                
#define SAR_TEST_DIG_AUXADC_BIAS_CTRL_ULV_BIT_MASK 0x3800000UL          
#define SAR_TEST_DIG_AUXADC_ATTN_EN_ULV_BIT_OFFSET (22U)               
#define SAR_TEST_DIG_AUXADC_ATTN_EN_ULV_BIT_LEN (1U)                
#define SAR_TEST_DIG_AUXADC_ATTN_EN_ULV_BIT_MASK 0x400000UL           
#define SAR_TEST_DIG_AUXADC_ATTN_SEL_ULV_BIT_OFFSET (21U)               
#define SAR_TEST_DIG_AUXADC_ATTN_SEL_ULV_BIT_LEN (1U)                
#define SAR_TEST_DIG_AUXADC_ATTN_SEL_ULV_BIT_MASK 0x200000UL           
#define SAR_TEST_DIG_AUXADC_TESTSEL_ULV_BIT_OFFSET (18U)               
#define SAR_TEST_DIG_AUXADC_TESTSEL_ULV_BIT_LEN (3U)                
#define SAR_TEST_DIG_AUXADC_TESTSEL_ULV_BIT_MASK 0x1c0000UL           
#define SAR_TEST_DIG_TSENSE_REF_RES_ULV_BIT_OFFSET (16U)               
#define SAR_TEST_DIG_TSENSE_REF_RES_ULV_BIT_LEN (2U)                
#define SAR_TEST_DIG_TSENSE_REF_RES_ULV_BIT_MASK 0x30000UL            
#define SAR_TEST_ENDET_EN_SHORT_BIT_OFFSET   (15U)               
#define SAR_TEST_ENDET_EN_SHORT_BIT_LEN      (1U)                
#define SAR_TEST_ENDET_EN_SHORT_BIT_MASK     0x8000U              
#define SAR_TEST_ENDET_EN_BYPASS_BIT_OFFSET  (14U)               
#define SAR_TEST_ENDET_EN_BYPASS_BIT_LEN     (1U)                
#define SAR_TEST_ENDET_EN_BYPASS_BIT_MASK    0x4000U              
#define SAR_TEST_AUXADC_WAIT4EOC_BIT_OFFSET  (13U)               
#define SAR_TEST_AUXADC_WAIT4EOC_BIT_LEN     (1U)                
#define SAR_TEST_AUXADC_WAIT4EOC_BIT_MASK    0x2000U              
#define SAR_TEST_AUXADC_CONT_SAMP_FAST_BIT_OFFSET (12U)               
#define SAR_TEST_AUXADC_CONT_SAMP_FAST_BIT_LEN (1U)                
#define SAR_TEST_AUXADC_CONT_SAMP_FAST_BIT_MASK 0x1000U              
#define SAR_TEST_AUXADC_CONT_SAMP_BIT_OFFSET (11U)               
#define SAR_TEST_AUXADC_CONT_SAMP_BIT_LEN    (1U)                
#define SAR_TEST_AUXADC_CONT_SAMP_BIT_MASK   0x800U               
#define SAR_TEST_AUXADC_TESTSEL_BIT_OFFSET   (10U)               
#define SAR_TEST_AUXADC_TESTSEL_BIT_LEN      (1U)                
#define SAR_TEST_AUXADC_TESTSEL_BIT_MASK     0x400U               
#define SAR_TEST_ENDET_OVR_DDA_SHRT_BIT_OFFSET (9U)                
#define SAR_TEST_ENDET_OVR_DDA_SHRT_BIT_LEN  (1U)                
#define SAR_TEST_ENDET_OVR_DDA_SHRT_BIT_MASK 0x200U               
#define SAR_TEST_ENDET_OVR_EN_BIT_OFFSET     (8U)                
#define SAR_TEST_ENDET_OVR_EN_BIT_LEN        (1U)                
#define SAR_TEST_ENDET_OVR_EN_BIT_MASK       0x100U               
#define SAR_TEST_ENDET_OVR_MODE_BIT_OFFSET   (7U)                
#define SAR_TEST_ENDET_OVR_MODE_BIT_LEN      (1U)                
#define SAR_TEST_ENDET_OVR_MODE_BIT_MASK     0x80U                
#define SAR_TEST_ENDET_EN_DDA_TRIM_TMUX_BIT_OFFSET (5U)                
#define SAR_TEST_ENDET_EN_DDA_TRIM_TMUX_BIT_LEN (2U)                
#define SAR_TEST_ENDET_EN_DDA_TRIM_TMUX_BIT_MASK 0x60U                
#define SAR_TEST_ENDET_EN_DIODE_TMUX_BIT_OFFSET (3U)                
#define SAR_TEST_ENDET_EN_DIODE_TMUX_BIT_LEN (2U)                
#define SAR_TEST_ENDET_EN_DIODE_TMUX_BIT_MASK 0x18U                
#define SAR_TEST_TSENSE_OVR_EN_BIT_OFFSET    (2U)                
#define SAR_TEST_TSENSE_OVR_EN_BIT_LEN       (1U)                
#define SAR_TEST_TSENSE_OVR_EN_BIT_MASK      0x4U                 
#define SAR_TEST_TSENSE_ITEST_EN_BIT_OFFSET  (1U)                
#define SAR_TEST_TSENSE_ITEST_EN_BIT_LEN     (1U)                
#define SAR_TEST_TSENSE_ITEST_EN_BIT_MASK    0x2U                 
#define SAR_TEST_TSENSE_VTEST_EN_BIT_OFFSET  (0U)                
#define SAR_TEST_TSENSE_VTEST_EN_BIT_LEN     (1U)                
#define SAR_TEST_TSENSE_VTEST_EN_BIT_MASK    0x1U                 

