tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register PG_TST_DATA
**/
#define PG_TST_DATA_ID                       0x70038              
#define PG_TST_DATA_LEN                      (4U)                
#define PG_TST_DATA_MASK                     0xFFFFFFFFUL        
#define PG_TST_DATA_PG_TEST_DATA_BIT_OFFSET  (0U)                
#define PG_TST_DATA_PG_TEST_DATA_BIT_LEN     (32U)               
#define PG_TST_DATA_PG_TEST_DATA_BIT_MASK    0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register RF_STATUS
**/
#define RF_STATUS_ID                         0x7003c              
#define RF_STATUS_LEN                        (4U)                
#define RF_STATUS_MASK                       0xFFFFFFFFUL        
#define RF_STATUS_PLL1_MID_FLAG_BIT_OFFSET   (3U)                
#define RF_STATUS_PLL1_MID_FLAG_BIT_LEN      (1U)                
#define RF_STATUS_PLL1_MID_FLAG_BIT_MASK     0x8U                 
#define RF_STATUS_PLL1_HI_FLAG_BIT_OFFSET    (2U)                
#define RF_STATUS_PLL1_HI_FLAG_BIT_LEN       (1U)                
#define RF_STATUS_PLL1_HI_FLAG_BIT_MASK      0x4U                 
#define RF_STATUS_PLL1_LO_FLAG_BIT_OFFSET    (1U)                
#define RF_STATUS_PLL1_LO_FLAG_BIT_LEN       (1U)                
#define RF_STATUS_PLL1_LO_FLAG_BIT_MASK      0x2U                 
#define RF_STATUS_PLL1_LOCK_BIT_OFFSET       (0U)                
#define RF_STATUS_PLL1_LOCK_BIT_LEN          (1U)                
#define RF_STATUS_PLL1_LOCK_BIT_MASK         0x1U                 

/******************************************************************************
* @brief Bit definitions for register LDO_TUNE_LO
**/
#define LDO_TUNE_LO_ID                       0x70040              
#define LDO_TUNE_LO_LEN                      (4U)                
#define LDO_TUNE_LO_MASK                     0xFFFFFFFFUL        
#define LDO_TUNE_LO_LDO_IF1_TUNE_BIT_OFFSET  (28U)               
#define LDO_TUNE_LO_LDO_IF1_TUNE_BIT_LEN     (4U)                
#define LDO_TUNE_LO_LDO_IF1_TUNE_BIT_MASK    0xf0000000UL         
#define LDO_TUNE_LO_LDO_TX2_TUNE_BIT_OFFSET  (24U)               
#define LDO_TUNE_LO_LDO_TX2_TUNE_BIT_LEN     (4U)                
#define LDO_TUNE_LO_LDO_TX2_TUNE_BIT_MASK    0xf000000UL          
#define LDO_TUNE_LO_LDO_TX1_TUNE_BIT_OFFSET  (20U)               
#define LDO_TUNE_LO_LDO_TX1_TUNE_BIT_LEN     (4U)                
#define LDO_TUNE_LO_LDO_TX1_TUNE_BIT_MASK    0xf00000UL           
#define LDO_TUNE_LO_LDO_PLL_TUNE_BIT_OFFSET  (16U)               
#define LDO_TUNE_LO_LDO_PLL_TUNE_BIT_LEN     (4U)                
#define LDO_TUNE_LO_LDO_PLL_TUNE_BIT_MASK    0xf0000UL            
#define LDO_TUNE_LO_LDO_VCO_TUNE_BIT_OFFSET  (12U)               
#define LDO_TUNE_LO_LDO_VCO_TUNE_BIT_LEN     (4U)                
#define LDO_TUNE_LO_LDO_VCO_TUNE_BIT_MASK    0xf000U              
#define LDO_TUNE_LO_LDO_MS3_TUNE_BIT_OFFSET  (8U)                
#define LDO_TUNE_LO_LDO_MS3_TUNE_BIT_LEN     (4U)                
#define LDO_TUNE_LO_LDO_MS3_TUNE_BIT_MASK    0xf00U               
#define LDO_TUNE_LO_LDO_MS2_TUNE_BIT_OFFSET  (4U)                
#define LDO_TUNE_LO_LDO_MS2_TUNE_BIT_LEN     (4U)                
#define LDO_TUNE_LO_LDO_MS2_TUNE_BIT_MASK    0xf0U                
#define LDO_TUNE_LO_LDO_MS1_TUNE_BIT_OFFSET  (0U)                
#define LDO_TUNE_LO_LDO_MS1_TUNE_BIT_LEN     (4U)                
#define LDO_TUNE_LO_LDO_MS1_TUNE_BIT_MASK    0xfU                 

/******************************************************************************
* @brief Bit definitions for register LDO_TUNE_HI
**/
#define LDO_TUNE_HI_ID                       0x70044              
#define LDO_TUNE_HI_LEN                      (4U)                
#define LDO_TUNE_HI_MASK                     0xFFFFFFFFUL        
#define LDO_TUNE_HI_LDO_HVTX_TUNE_BIT_OFFSET (24U)               
#define LDO_TUNE_HI_LDO_HVTX_TUNE_BIT_LEN    (4U)                
#define LDO_TUNE_HI_LDO_HVTX_TUNE_BIT_MASK   0xf000000UL          
#define LDO_TUNE_HI_LDO_HVXTAL_TUNE_BIT_OFFSET (16U)               
#define LDO_TUNE_HI_LDO_HVXTAL_TUNE_BIT_LEN  (8U)                
#define LDO_TUNE_HI_LDO_HVXTAL_TUNE_BIT_MASK 0xff0000UL           
#define LDO_TUNE_HI_LDO_HVAUX_TUNE_BIT_OFFSET (12U)               
#define LDO_TUNE_HI_LDO_HVAUX_TUNE_BIT_LEN   (4U)                
#define LDO_TUNE_HI_LDO_HVAUX_TUNE_BIT_MASK  0xf000U              
#define LDO_TUNE_HI_LDO_RFCH9_TUNE_BIT_OFFSET (8U)                
#define LDO_TUNE_HI_LDO_RFCH9_TUNE_BIT_LEN   (4U)                
#define LDO_TUNE_HI_LDO_RFCH9_TUNE_BIT_MASK  0xf00U               
#define LDO_TUNE_HI_LDO_RFCH5_TUNE_BIT_OFFSET (4U)                
#define LDO_TUNE_HI_LDO_RFCH5_TUNE_BIT_LEN   (4U)                
#define LDO_TUNE_HI_LDO_RFCH5_TUNE_BIT_MASK  0xf0U                
#define LDO_TUNE_HI_LDO_IF2_TUNE_BIT_OFFSET  (0U)                
#define LDO_TUNE_HI_LDO_IF2_TUNE_BIT_LEN     (4U)                
#define LDO_TUNE_HI_LDO_IF2_TUNE_BIT_MASK    0xfU                 

/******************************************************************************
* @brief Bit definitions for register LDO_CTRL
**/
#define LDO_CTRL_ID                          0x70048              
#define LDO_CTRL_LEN                         (4U)                
#define LDO_CTRL_MASK                        0xFFFFFFFFUL        
#define LDO_CTRL_LDO_VDDHVTX_VREF_BIT_OFFSET (27U)               
#define LDO_CTRL_LDO_VDDHVTX_VREF_BIT_LEN    (1U)                
#define LDO_CTRL_LDO_VDDHVTX_VREF_BIT_MASK   0x8000000UL          
#define LDO_CTRL_LDO_VDDRFCH9_VREF_BIT_OFFSET (26U)               
#define LDO_CTRL_LDO_VDDRFCH9_VREF_BIT_LEN   (1U)                
#define LDO_CTRL_LDO_VDDRFCH9_VREF_BIT_MASK  0x4000000UL          
#define LDO_CTRL_LDO_VDDRFCH5_VREF_BIT_OFFSET (25U)               
#define LDO_CTRL_LDO_VDDRFCH5_VREF_BIT_LEN   (1U)                
#define LDO_CTRL_LDO_VDDRFCH5_VREF_BIT_MASK  0x2000000UL          
#define LDO_CTRL_LDO_VDDIF2_VREF_BIT_OFFSET  (24U)               
#define LDO_CTRL_LDO_VDDIF2_VREF_BIT_LEN     (1U)                
#define LDO_CTRL_LDO_VDDIF2_VREF_BIT_MASK    0x1000000UL          
#define LDO_CTRL_LDO_VDDIF1_VREF_BIT_OFFSET  (23U)               
#define LDO_CTRL_LDO_VDDIF1_VREF_BIT_LEN     (1U)                
#define LDO_CTRL_LDO_VDDIF1_VREF_BIT_MASK    0x800000UL           
#define LDO_CTRL_LDO_VDDTX2_VREF_BIT_OFFSET  (22U)               
#define LDO_CTRL_LDO_VDDTX2_VREF_BIT_LEN     (1U)                
#define LDO_CTRL_LDO_VDDTX2_VREF_BIT_MASK    0x400000UL           
#define LDO_CTRL_LDO_VDDTX1_VREF_BIT_OFFSET  (21U)               
#define LDO_CTRL_LDO_VDDTX1_VREF_BIT_LEN     (1U)                
#define LDO_CTRL_LDO_VDDTX1_VREF_BIT_MASK    0x200000UL           
#define LDO_CTRL_LDO_VDDPLL_VREF_BIT_OFFSET  (20U)               
#define LDO_CTRL_LDO_VDDPLL_VREF_BIT_LEN     (1U)                
#define LDO_CTRL_LDO_VDDPLL_VREF_BIT_MASK    0x100000UL           
#define LDO_CTRL_LDO_VDDVCO_VREF_BIT_OFFSET  (19U)               
#define LDO_CTRL_LDO_VDDVCO_VREF_BIT_LEN     (1U)                
#define LDO_CTRL_LDO_VDDVCO_VREF_BIT_MASK    0x80000UL            
#define LDO_CTRL_LDO_VDDMS3_VREF_BIT_OFFSET  (18U)               
#define LDO_CTRL_LDO_VDDMS3_VREF_BIT_LEN     (1U)                
#define LDO_CTRL_LDO_VDDMS3_VREF_BIT_MASK    0x40000UL            
#define LDO_CTRL_LDO_VDDMS2_VREF_BIT_OFFSET  (17U)               
#define LDO_CTRL_LDO_VDDMS2_VREF_BIT_LEN     (1U)                
#define LDO_CTRL_LDO_VDDMS2_VREF_BIT_MASK    0x20000UL            
#define LDO_CTRL_LDO_VDDMS1_VREF_BIT_OFFSET  (16U)               
#define LDO_CTRL_LDO_VDDMS1_VREF_BIT_LEN     (1U)                
#define LDO_CTRL_LDO_VDDMS1_VREF_BIT_MASK    0x10000UL            
#define LDO_CTRL_LDO_VDDHVTX_EN_BIT_OFFSET   (11U)               
#define LDO_CTRL_LDO_VDDHVTX_EN_BIT_LEN      (1U)                
#define LDO_CTRL_LDO_VDDHVTX_EN_BIT_MASK     0x800U               
#define LDO_CTRL_LDO_VDDRFCH9_EN_BIT_OFFSET  (10U)               
#define LDO_CTRL_LDO_VDDRFCH9_EN_BIT_LEN     (1U)                
#define LDO_CTRL_LDO_VDDRFCH9_EN_BIT_MASK    0x400U               
#define LDO_CTRL_LDO_VDDRFCH5_EN_BIT_OFFSET  (9U)                
#define LDO_CTRL_LDO_VDDRFCH5_EN_BIT_LEN     (1U)                
#define LDO_CTRL_LDO_VDDRFCH5_EN_BIT_MASK    0x200U               
#define LDO_CTRL_LDO_VDDIF2_EN_BIT_OFFSET    (8U)                
#define LDO_CTRL_LDO_VDDIF2_EN_BIT_LEN       (1U)                
#define LDO_CTRL_LDO_VDDIF2_EN_BIT_MASK      0x100U               
#define LDO_CTRL_LDO_VDDIF1_EN_BIT_OFFSET    (7U)                
#define LDO_CTRL_LDO_VDDIF1_EN_BIT_LEN       (1U)                
#define LDO_CTRL_LDO_VDDIF1_EN_BIT_MASK      0x80U                
#define LDO_CTRL_LDO_VDDTX2_EN_BIT_OFFSET    (6U)                
#define LDO_CTRL_LDO_VDDTX2_EN_BIT_LEN       (1U)                
#define LDO_CTRL_LDO_VDDTX2_EN_BIT_MASK      0x40U                
#define LDO_CTRL_LDO_VDDTX1_EN_BIT_OFFSET    (5U)                
#define LDO_CTRL_LDO_VDDTX1_EN_BIT_LEN       (1U)                
#define LDO_CTRL_LDO_VDDTX1_EN_BIT_MASK      0x20U                
#define LDO_CTRL_LDO_VDDPLL_EN_BIT_OFFSET    (4U)                
#define LDO_CTRL_LDO_VDDPLL_EN_BIT_LEN       (1U)                
#define LDO_CTRL_LDO_VDDPLL_EN_BIT_MASK      0x10U                
#define LDO_CTRL_LDO_VDDVCO_EN_BIT_OFFSET    (3U)                
#define LDO_CTRL_LDO_VDDVCO_EN_BIT_LEN       (1U)                
#define LDO_CTRL_LDO_VDDVCO_EN_BIT_MASK      0x8U                 
#define LDO_CTRL_LDO_VDDMS3_EN_BIT_OFFSET    (2U)                
#define LDO_CTRL_LDO_VDDMS3_EN_BIT_LEN       (1U)                
#define LDO_CTRL_LDO_VDDMS3_EN_BIT_MASK      0x4U                 
#define LDO_CTRL_LDO_VDDMS2_EN_BIT_OFFSET    (1U)                
#define LDO_CTRL_LDO_VDDMS2_EN_BIT_LEN       (1U)                
#define LDO_CTRL_LDO_VDDMS2_EN_BIT_MASK      0x2U                 
#define LDO_CTRL_LDO_VDDMS1_EN_BIT_OFFSET    (0U)                
#define LDO_CTRL_LDO_VDDMS1_EN_BIT_LEN       (1U)                
#define LDO_CTRL_LDO_VDDMS1_EN_BIT_MASK      0x1U                 

