tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register LDO_VOUT
**/
#define LDO_VOUT_ID                          0x7004c              
#define LDO_VOUT_LEN                         (4U)                
#define LDO_VOUT_MASK                        0xFFFFFFFFUL        
#define LDO_VOUT_LDO_VDDHVTX_VOUT_SEL_BIT_OFFSET (26U)               
#define LDO_VOUT_LDO_VDDHVTX_VOUT_SEL_BIT_LEN (2U)                
#define LDO_VOUT_LDO_VDDHVTX_VOUT_SEL_BIT_MASK 0xc000000UL          
#define LDO_VOUT_LDO_VDDHVXTAL_VOUT_SEL_BIT_OFFSET (24U)               
#define LDO_VOUT_LDO_VDDHVXTAL_VOUT_SEL_BIT_LEN (2U)                
#define LDO_VOUT_LDO_VDDHVXTAL_VOUT_SEL_BIT_MASK 0x3000000UL          
#define LDO_VOUT_LDO_VDDHVAUX_VOUT_SEL_BIT_OFFSET (22U)               
#define LDO_VOUT_LDO_VDDHVAUX_VOUT_SEL_BIT_LEN (2U)                
#define LDO_VOUT_LDO_VDDHVAUX_VOUT_SEL_BIT_MASK 0xc00000UL           
#define LDO_VOUT_LDO_VDDRFCH9_VOUT_SEL_BIT_OFFSET (0U)                
#define LDO_VOUT_LDO_VDDRFCH9_VOUT_SEL_BIT_LEN (1U)                
#define LDO_VOUT_LDO_VDDRFCH9_VOUT_SEL_BIT_MASK 0x1U                 
#define LDO_VOUT_LDO_VDDRFCH5_VOUT_SEL_BIT_OFFSET (0U)                
#define LDO_VOUT_LDO_VDDRFCH5_VOUT_SEL_BIT_LEN (1U)                
#define LDO_VOUT_LDO_VDDRFCH5_VOUT_SEL_BIT_MASK 0x1U                 
#define LDO_VOUT_LDO_VDDIF2_VOUT_SEL_BIT_OFFSET (0U)                
#define LDO_VOUT_LDO_VDDIF2_VOUT_SEL_BIT_LEN (1U)                
#define LDO_VOUT_LDO_VDDIF2_VOUT_SEL_BIT_MASK 0x1U                 
#define LDO_VOUT_LDO_VDDIF1_VOUT_SEL_BIT_OFFSET (14U)               
#define LDO_VOUT_LDO_VDDIF1_VOUT_SEL_BIT_LEN (2U)                
#define LDO_VOUT_LDO_VDDIF1_VOUT_SEL_BIT_MASK 0xc000U              
#define LDO_VOUT_LDO_VDDTX2_VOUT_SEL_BIT_OFFSET (12U)               
#define LDO_VOUT_LDO_VDDTX2_VOUT_SEL_BIT_LEN (2U)                
#define LDO_VOUT_LDO_VDDTX2_VOUT_SEL_BIT_MASK 0x3000U              
#define LDO_VOUT_LDO_VDDTX1_VOUT_SEL_BIT_OFFSET (10U)               
#define LDO_VOUT_LDO_VDDTX1_VOUT_SEL_BIT_LEN (2U)                
#define LDO_VOUT_LDO_VDDTX1_VOUT_SEL_BIT_MASK 0xc00U               
#define LDO_VOUT_LDO_VDDPLL_VOUT_SEL_BIT_OFFSET (8U)                
#define LDO_VOUT_LDO_VDDPLL_VOUT_SEL_BIT_LEN (2U)                
#define LDO_VOUT_LDO_VDDPLL_VOUT_SEL_BIT_MASK 0x300U               
#define LDO_VOUT_LDO_VDDVCO_VOUT_SEL_BIT_OFFSET (6U)                
#define LDO_VOUT_LDO_VDDVCO_VOUT_SEL_BIT_LEN (2U)                
#define LDO_VOUT_LDO_VDDVCO_VOUT_SEL_BIT_MASK 0xc0U                
#define LDO_VOUT_LDO_VDDMS3_VOUT_SEL_BIT_OFFSET (4U)                
#define LDO_VOUT_LDO_VDDMS3_VOUT_SEL_BIT_LEN (2U)                
#define LDO_VOUT_LDO_VDDMS3_VOUT_SEL_BIT_MASK 0x30U                
#define LDO_VOUT_LDO_VDDMS2_VOUT_SEL_BIT_OFFSET (2U)                
#define LDO_VOUT_LDO_VDDMS2_VOUT_SEL_BIT_LEN (2U)                
#define LDO_VOUT_LDO_VDDMS2_VOUT_SEL_BIT_MASK 0xcU                 
#define LDO_VOUT_LDO_VDDMS1_VOUT_SEL_BIT_OFFSET (0U)                
#define LDO_VOUT_LDO_VDDMS1_VOUT_SEL_BIT_LEN (2U)                
#define LDO_VOUT_LDO_VDDMS1_VOUT_SEL_BIT_MASK 0x3U                 

/******************************************************************************
* @brief Bit definitions for register LDO_RLOAD
**/
#define LDO_RLOAD_ID                         0x70050              
#define LDO_RLOAD_LEN                        (4U)                
#define LDO_RLOAD_MASK                       0xFFFFFFFFUL        
#define LDO_RLOAD_LDO_VDDHVTX_RLOADON_SEL_BIT_OFFSET (28U)               
#define LDO_RLOAD_LDO_VDDHVTX_RLOADON_SEL_BIT_LEN (2U)                
#define LDO_RLOAD_LDO_VDDHVTX_RLOADON_SEL_BIT_MASK 0x30000000UL         
#define LDO_RLOAD_LDO_VDDHVTX_RLOAD_SEL_BIT_OFFSET (26U)               
#define LDO_RLOAD_LDO_VDDHVTX_RLOAD_SEL_BIT_LEN (2U)                
#define LDO_RLOAD_LDO_VDDHVTX_RLOAD_SEL_BIT_MASK 0xc000000UL          
#define LDO_RLOAD_LDO_VDDHVXTAL_RLOAD_SEL_BIT_OFFSET (24U)               
#define LDO_RLOAD_LDO_VDDHVXTAL_RLOAD_SEL_BIT_LEN (2U)                
#define LDO_RLOAD_LDO_VDDHVXTAL_RLOAD_SEL_BIT_MASK 0x3000000UL          
#define LDO_RLOAD_LDO_VDDHVAUX_RLOAD_SEL_BIT_OFFSET (22U)               
#define LDO_RLOAD_LDO_VDDHVAUX_RLOAD_SEL_BIT_LEN (2U)                
#define LDO_RLOAD_LDO_VDDHVAUX_RLOAD_SEL_BIT_MASK 0xc00000UL           
#define LDO_RLOAD_LDO_VDDRFCH9_RLOAD_SEL_BIT_OFFSET (0U)                
#define LDO_RLOAD_LDO_VDDRFCH9_RLOAD_SEL_BIT_LEN (1U)                
#define LDO_RLOAD_LDO_VDDRFCH9_RLOAD_SEL_BIT_MASK 0x1U                 
#define LDO_RLOAD_LDO_VDDRFCH5_RLOAD_SEL_BIT_OFFSET (0U)                
#define LDO_RLOAD_LDO_VDDRFCH5_RLOAD_SEL_BIT_LEN (1U)                
#define LDO_RLOAD_LDO_VDDRFCH5_RLOAD_SEL_BIT_MASK 0x1U                 
#define LDO_RLOAD_LDO_VDDIF2_RLOAD_SEL_BIT_OFFSET (0U)                
#define LDO_RLOAD_LDO_VDDIF2_RLOAD_SEL_BIT_LEN (1U)                
#define LDO_RLOAD_LDO_VDDIF2_RLOAD_SEL_BIT_MASK 0x1U                 
#define LDO_RLOAD_LDO_VDDIF1_RLOAD_SEL_BIT_OFFSET (14U)               
#define LDO_RLOAD_LDO_VDDIF1_RLOAD_SEL_BIT_LEN (2U)                
#define LDO_RLOAD_LDO_VDDIF1_RLOAD_SEL_BIT_MASK 0xc000U              
#define LDO_RLOAD_LDO_VDDTX2_RLOAD_SEL_BIT_OFFSET (12U)               
#define LDO_RLOAD_LDO_VDDTX2_RLOAD_SEL_BIT_LEN (2U)                
#define LDO_RLOAD_LDO_VDDTX2_RLOAD_SEL_BIT_MASK 0x3000U              
#define LDO_RLOAD_LDO_VDDTX1_RLOAD_SEL_BIT_OFFSET (10U)               
#define LDO_RLOAD_LDO_VDDTX1_RLOAD_SEL_BIT_LEN (2U)                
#define LDO_RLOAD_LDO_VDDTX1_RLOAD_SEL_BIT_MASK 0xc00U               
#define LDO_RLOAD_LDO_VDDPLL_RLOAD_SEL_BIT_OFFSET (8U)                
#define LDO_RLOAD_LDO_VDDPLL_RLOAD_SEL_BIT_LEN (2U)                
#define LDO_RLOAD_LDO_VDDPLL_RLOAD_SEL_BIT_MASK 0x300U               
#define LDO_RLOAD_LDO_VDDVCO_RLOAD_SEL_BIT_OFFSET (6U)                
#define LDO_RLOAD_LDO_VDDVCO_RLOAD_SEL_BIT_LEN (2U)                
#define LDO_RLOAD_LDO_VDDVCO_RLOAD_SEL_BIT_MASK 0xc0U                
#define LDO_RLOAD_LDO_VDDMS3_RLOAD_SEL_BIT_OFFSET (4U)                
#define LDO_RLOAD_LDO_VDDMS3_RLOAD_SEL_BIT_LEN (2U)                
#define LDO_RLOAD_LDO_VDDMS3_RLOAD_SEL_BIT_MASK 0x30U                
#define LDO_RLOAD_LDO_VDDMS2_RLOAD_SEL_BIT_OFFSET (2U)                
#define LDO_RLOAD_LDO_VDDMS2_RLOAD_SEL_BIT_LEN (2U)                
#define LDO_RLOAD_LDO_VDDMS2_RLOAD_SEL_BIT_MASK 0xcU                 
#define LDO_RLOAD_LDO_VDDMS1_RLOAD_SEL_BIT_OFFSET (0U)                
#define LDO_RLOAD_LDO_VDDMS1_RLOAD_SEL_BIT_LEN (2U)                
#define LDO_RLOAD_LDO_VDDMS1_RLOAD_SEL_BIT_MASK 0x3U                 

