tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register LDO_BYPASS
**/
#define LDO_BYPASS_ID                        0x70054              
#define LDO_BYPASS_LEN                       (4U)                
#define LDO_BYPASS_MASK                      0xFFFFFFFFUL        
#define LDO_BYPASS_DIG_SMPS_TEST_SEL_BIT_OFFSET (29U)               
#define LDO_BYPASS_DIG_SMPS_TEST_SEL_BIT_LEN (2U)                
#define LDO_BYPASS_DIG_SMPS_TEST_SEL_BIT_MASK 0x60000000UL         
#define LDO_BYPASS_DIG_SMPS_TEST_EN_BIT_OFFSET (28U)               
#define LDO_BYPASS_DIG_SMPS_TEST_EN_BIT_LEN  (1U)                
#define LDO_BYPASS_DIG_SMPS_TEST_EN_BIT_MASK 0x10000000UL         
#define LDO_BYPASS_OVR_LDO_PWRGOOD_BIT_OFFSET (27U)               
#define LDO_BYPASS_OVR_LDO_PWRGOOD_BIT_LEN   (1U)                
#define LDO_BYPASS_OVR_LDO_PWRGOOD_BIT_MASK  0x8000000UL          
#define LDO_BYPASS_LDO_VDDTX1_FAST_EN_BIT_OFFSET (26U)               
#define LDO_BYPASS_LDO_VDDTX1_FAST_EN_BIT_LEN (1U)                
#define LDO_BYPASS_LDO_VDDTX1_FAST_EN_BIT_MASK 0x4000000UL          
#define LDO_BYPASS_LDO_VDDHVTX_HIBW_BIT_OFFSET (25U)               
#define LDO_BYPASS_LDO_VDDHVTX_HIBW_BIT_LEN  (1U)                
#define LDO_BYPASS_LDO_VDDHVTX_HIBW_BIT_MASK 0x2000000UL          
#define LDO_BYPASS_LDO_VDDHVTX_FAST_PD_BIT_OFFSET (24U)               
#define LDO_BYPASS_LDO_VDDHVTX_FAST_PD_BIT_LEN (1U)                
#define LDO_BYPASS_LDO_VDDHVTX_FAST_PD_BIT_MASK 0x1000000UL          
#define LDO_BYPASS_LDO_VDDHVTX_DC_TST_EN_BIT_OFFSET (21U)               
#define LDO_BYPASS_LDO_VDDHVTX_DC_TST_EN_BIT_LEN (3U)                
#define LDO_BYPASS_LDO_VDDHVTX_DC_TST_EN_BIT_MASK 0xe00000UL           
#define LDO_BYPASS_LDO_VDDHVXTAL_DC_TST_EN_BIT_OFFSET (18U)               
#define LDO_BYPASS_LDO_VDDHVXTAL_DC_TST_EN_BIT_LEN (3U)                
#define LDO_BYPASS_LDO_VDDHVXTAL_DC_TST_EN_BIT_MASK 0x1c0000UL           
#define LDO_BYPASS_LDO_VDDHVAUX_DC_TST_EN_BIT_OFFSET (15U)               
#define LDO_BYPASS_LDO_VDDHVAUX_DC_TST_EN_BIT_LEN (3U)                
#define LDO_BYPASS_LDO_VDDHVAUX_DC_TST_EN_BIT_MASK 0x38000UL            
#define LDO_BYPASS_LDO_VDDRFCH9_DC_TST_EN_LO_BIT_OFFSET (14U)               
#define LDO_BYPASS_LDO_VDDRFCH9_DC_TST_EN_LO_BIT_LEN (1U)                
#define LDO_BYPASS_LDO_VDDRFCH9_DC_TST_EN_LO_BIT_MASK 0x4000U              
#define LDO_BYPASS_LDO_VDDHVTX_BYP_EN_BIT_OFFSET (13U)               
#define LDO_BYPASS_LDO_VDDHVTX_BYP_EN_BIT_LEN (1U)                
#define LDO_BYPASS_LDO_VDDHVTX_BYP_EN_BIT_MASK 0x2000U              
#define LDO_BYPASS_LDO_VDDHVXTAL_BYP_EN_BIT_OFFSET (12U)               
#define LDO_BYPASS_LDO_VDDHVXTAL_BYP_EN_BIT_LEN (1U)                
#define LDO_BYPASS_LDO_VDDHVXTAL_BYP_EN_BIT_MASK 0x1000U              
#define LDO_BYPASS_LDO_VDDHVAUX_BYP_EN_BIT_OFFSET (11U)               
#define LDO_BYPASS_LDO_VDDHVAUX_BYP_EN_BIT_LEN (1U)                
#define LDO_BYPASS_LDO_VDDHVAUX_BYP_EN_BIT_MASK 0x800U               
#define LDO_BYPASS_LDO_VDDRFCH9_BYP_EN_BIT_OFFSET (10U)               
#define LDO_BYPASS_LDO_VDDRFCH9_BYP_EN_BIT_LEN (1U)                
#define LDO_BYPASS_LDO_VDDRFCH9_BYP_EN_BIT_MASK 0x400U               
#define LDO_BYPASS_LDO_VDDRCH5_BYP_EN_BIT_OFFSET (9U)                
#define LDO_BYPASS_LDO_VDDRCH5_BYP_EN_BIT_LEN (1U)                
#define LDO_BYPASS_LDO_VDDRCH5_BYP_EN_BIT_MASK 0x200U               
#define LDO_BYPASS_LDO_VDDIF2_BYP_EN_BIT_OFFSET (8U)                
#define LDO_BYPASS_LDO_VDDIF2_BYP_EN_BIT_LEN (1U)                
#define LDO_BYPASS_LDO_VDDIF2_BYP_EN_BIT_MASK 0x100U               
#define LDO_BYPASS_LDO_VDDIF1_BYP_EN_BIT_OFFSET (7U)                
#define LDO_BYPASS_LDO_VDDIF1_BYP_EN_BIT_LEN (1U)                
#define LDO_BYPASS_LDO_VDDIF1_BYP_EN_BIT_MASK 0x80U                
#define LDO_BYPASS_LDO_VDDTX2_BYP_EN_BIT_OFFSET (6U)                
#define LDO_BYPASS_LDO_VDDTX2_BYP_EN_BIT_LEN (1U)                
#define LDO_BYPASS_LDO_VDDTX2_BYP_EN_BIT_MASK 0x40U                
#define LDO_BYPASS_LDO_VDDTX1_BYP_EN_BIT_OFFSET (5U)                
#define LDO_BYPASS_LDO_VDDTX1_BYP_EN_BIT_LEN (1U)                
#define LDO_BYPASS_LDO_VDDTX1_BYP_EN_BIT_MASK 0x20U                
#define LDO_BYPASS_LDO_VDDPLL_BYP_EN_BIT_OFFSET (4U)                
#define LDO_BYPASS_LDO_VDDPLL_BYP_EN_BIT_LEN (1U)                
#define LDO_BYPASS_LDO_VDDPLL_BYP_EN_BIT_MASK 0x10U                
#define LDO_BYPASS_LDO_VDDVCO_BYP_EN_BIT_OFFSET (3U)                
#define LDO_BYPASS_LDO_VDDVCO_BYP_EN_BIT_LEN (1U)                
#define LDO_BYPASS_LDO_VDDVCO_BYP_EN_BIT_MASK 0x8U                 
#define LDO_BYPASS_LDO_VDDMS3_BYP_EN_BIT_OFFSET (2U)                
#define LDO_BYPASS_LDO_VDDMS3_BYP_EN_BIT_LEN (1U)                
#define LDO_BYPASS_LDO_VDDMS3_BYP_EN_BIT_MASK 0x4U                 
#define LDO_BYPASS_LDO_VDDMS2_BYP_EN_BIT_OFFSET (1U)                
#define LDO_BYPASS_LDO_VDDMS2_BYP_EN_BIT_LEN (1U)                
#define LDO_BYPASS_LDO_VDDMS2_BYP_EN_BIT_MASK 0x2U                 
#define LDO_BYPASS_LDO_VDDMS1_BYP_EN_BIT_OFFSET (0U)                
#define LDO_BYPASS_LDO_VDDMS1_BYP_EN_BIT_LEN (1U)                
#define LDO_BYPASS_LDO_VDDMS1_BYP_EN_BIT_MASK 0x1U                 

/******************************************************************************
* @brief Bit definitions for register LDO_DC_TST
**/
#define LDO_DC_TST_ID                        0x70058              
#define LDO_DC_TST_LEN                       (4U)                
#define LDO_DC_TST_MASK                      0xFFFFFFFFUL        
#define LDO_DC_TST_LDO_VDDRFCH9_DC_TST_EN_HI_BIT_OFFSET (30U)               
#define LDO_DC_TST_LDO_VDDRFCH9_DC_TST_EN_HI_BIT_LEN (2U)                
#define LDO_DC_TST_LDO_VDDRFCH9_DC_TST_EN_HI_BIT_MASK 0xc0000000UL         
#define LDO_DC_TST_LDO_VDDRCH5_DC_TST_EN_BIT_OFFSET (27U)               
#define LDO_DC_TST_LDO_VDDRCH5_DC_TST_EN_BIT_LEN (3U)                
#define LDO_DC_TST_LDO_VDDRCH5_DC_TST_EN_BIT_MASK 0x38000000UL         
#define LDO_DC_TST_LDO_VDDIF2_DC_TST_EN_BIT_OFFSET (24U)               
#define LDO_DC_TST_LDO_VDDIF2_DC_TST_EN_BIT_LEN (3U)                
#define LDO_DC_TST_LDO_VDDIF2_DC_TST_EN_BIT_MASK 0x7000000UL          
#define LDO_DC_TST_LDO_VDDIF1_DC_TST_EN_BIT_OFFSET (21U)               
#define LDO_DC_TST_LDO_VDDIF1_DC_TST_EN_BIT_LEN (3U)                
#define LDO_DC_TST_LDO_VDDIF1_DC_TST_EN_BIT_MASK 0xe00000UL           
#define LDO_DC_TST_LDO_VDDTX2_DC_TST_EN_BIT_OFFSET (18U)               
#define LDO_DC_TST_LDO_VDDTX2_DC_TST_EN_BIT_LEN (3U)                
#define LDO_DC_TST_LDO_VDDTX2_DC_TST_EN_BIT_MASK 0x1c0000UL           
#define LDO_DC_TST_LDO_VDDTX1_DC_TST_EN_BIT_OFFSET (15U)               
#define LDO_DC_TST_LDO_VDDTX1_DC_TST_EN_BIT_LEN (3U)                
#define LDO_DC_TST_LDO_VDDTX1_DC_TST_EN_BIT_MASK 0x38000UL            
#define LDO_DC_TST_LDO_VDDPLL_DC_TST_EN_BIT_OFFSET (12U)               
#define LDO_DC_TST_LDO_VDDPLL_DC_TST_EN_BIT_LEN (3U)                
#define LDO_DC_TST_LDO_VDDPLL_DC_TST_EN_BIT_MASK 0x7000U              
#define LDO_DC_TST_LDO_VDDVCO_DC_TST_EN_BIT_OFFSET (9U)                
#define LDO_DC_TST_LDO_VDDVCO_DC_TST_EN_BIT_LEN (3U)                
#define LDO_DC_TST_LDO_VDDVCO_DC_TST_EN_BIT_MASK 0xe00U               
#define LDO_DC_TST_LDO_VDDMS3_DC_TST_EN_BIT_OFFSET (6U)                
#define LDO_DC_TST_LDO_VDDMS3_DC_TST_EN_BIT_LEN (3U)                
#define LDO_DC_TST_LDO_VDDMS3_DC_TST_EN_BIT_MASK 0x1c0U               
#define LDO_DC_TST_LDO_VDDMS2_DC_TST_EN_BIT_OFFSET (3U)                
#define LDO_DC_TST_LDO_VDDMS2_DC_TST_EN_BIT_LEN (3U)                
#define LDO_DC_TST_LDO_VDDMS2_DC_TST_EN_BIT_MASK 0x38U                
#define LDO_DC_TST_LDO_VDDMS1_DC_TST_EN_BIT_OFFSET (0U)                
#define LDO_DC_TST_LDO_VDDMS1_DC_TST_EN_BIT_LEN (3U)                
#define LDO_DC_TST_LDO_VDDMS1_DC_TST_EN_BIT_MASK 0x7U                 

