tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register SAR_CTRL
**/
#define SAR_CTRL_ID                          0x80000              
#define SAR_CTRL_LEN                         (4U)                
#define SAR_CTRL_MASK                        0xFFFFFFFFUL        
#define SAR_CTRL_SAR_SEL_TXLVL_BIT_OFFSET    (15U)               
#define SAR_CTRL_SAR_SEL_TXLVL_BIT_LEN       (1U)                
#define SAR_CTRL_SAR_SEL_TXLVL_BIT_MASK      0x8000U              
#define SAR_CTRL_SAR_FORCE_SEL_BIT_OFFSET    (12U)               
#define SAR_CTRL_SAR_FORCE_SEL_BIT_LEN       (3U)                
#define SAR_CTRL_SAR_FORCE_SEL_BIT_MASK      0x7000U              
#define SAR_CTRL_SAR_OVR_ADC_EN_BIT_OFFSET   (11U)               
#define SAR_CTRL_SAR_OVR_ADC_EN_BIT_LEN      (1U)                
#define SAR_CTRL_SAR_OVR_ADC_EN_BIT_MASK     0x800U               
#define SAR_CTRL_SAR_OVR_SCT_BIT_OFFSET      (6U)                
#define SAR_CTRL_SAR_OVR_SCT_BIT_LEN         (5U)                
#define SAR_CTRL_SAR_OVR_SCT_BIT_MASK        0x7c0U               
#define SAR_CTRL_SAR_OVR_MUX_EN_BIT_OFFSET   (5U)                
#define SAR_CTRL_SAR_OVR_MUX_EN_BIT_LEN      (1U)                
#define SAR_CTRL_SAR_OVR_MUX_EN_BIT_MASK     0x20U                
#define SAR_CTRL_SAR_OVR_START_BIT_OFFSET    (4U)                
#define SAR_CTRL_SAR_OVR_START_BIT_LEN       (1U)                
#define SAR_CTRL_SAR_OVR_START_BIT_MASK      0x10U                
#define SAR_CTRL_SAR_OVR_RSTN_BIT_OFFSET     (3U)                
#define SAR_CTRL_SAR_OVR_RSTN_BIT_LEN        (1U)                
#define SAR_CTRL_SAR_OVR_RSTN_BIT_MASK       0x8U                 
#define SAR_CTRL_SAR_OVR_CLK_BIT_OFFSET      (2U)                
#define SAR_CTRL_SAR_OVR_CLK_BIT_LEN         (1U)                
#define SAR_CTRL_SAR_OVR_CLK_BIT_MASK        0x4U                 
#define SAR_CTRL_SAR_OVR_EN_BIT_OFFSET       (1U)                
#define SAR_CTRL_SAR_OVR_EN_BIT_LEN          (1U)                
#define SAR_CTRL_SAR_OVR_EN_BIT_MASK         0x2U                 
#define SAR_CTRL_SAR_START_BIT_OFFSET        (0U)                
#define SAR_CTRL_SAR_START_BIT_LEN           (1U)                
#define SAR_CTRL_SAR_START_BIT_MASK          0x1U                 

/******************************************************************************
* @brief Bit definitions for register SAR_STATUS
**/
#define SAR_STATUS_ID                        0x80004              
#define SAR_STATUS_LEN                       (4U)                
#define SAR_STATUS_MASK                      0xFFFFFFFFUL        
#define SAR_STATUS_SAR_STATUS_BIT_OFFSET     (1U)                
#define SAR_STATUS_SAR_STATUS_BIT_LEN        (6U)                
#define SAR_STATUS_SAR_STATUS_BIT_MASK       0x7eU                
#define SAR_STATUS_SAR_CONV_DONE_BIT_OFFSET  (0U)                
#define SAR_STATUS_SAR_CONV_DONE_BIT_LEN     (1U)                
#define SAR_STATUS_SAR_CONV_DONE_BIT_MASK    0x1U                 

/******************************************************************************
* @brief Bit definitions for register SAR_READING
**/
#define SAR_READING_ID                       0x80008              
#define SAR_READING_LEN                      (4U)                
#define SAR_READING_MASK                     0xFFFFFFFFUL        
#define SAR_READING_SAR_READING_TXLVL_BIT_OFFSET (16U)               
#define SAR_READING_SAR_READING_TXLVL_BIT_LEN (8U)                
#define SAR_READING_SAR_READING_TXLVL_BIT_MASK 0xff0000UL           
#define SAR_READING_SAR_READING_TEMP_BIT_OFFSET (8U)                
#define SAR_READING_SAR_READING_TEMP_BIT_LEN (8U)                
#define SAR_READING_SAR_READING_TEMP_BIT_MASK 0xff00U              
#define SAR_READING_SAR_READING_VBAT_BIT_OFFSET (0U)                
#define SAR_READING_SAR_READING_VBAT_BIT_LEN (8U)                
#define SAR_READING_SAR_READING_VBAT_BIT_MASK 0xffU                

/******************************************************************************
* @brief Bit definitions for register SAR_OLD_READ
**/
#define SAR_OLD_READ_ID                      0x8000c              
#define SAR_OLD_READ_LEN                     (4U)                
#define SAR_OLD_READ_MASK                    0xFFFFFFFFUL        
#define SAR_OLD_READ_SAR_LAST_TEMP_BIT_OFFSET (8U)                
#define SAR_OLD_READ_SAR_LAST_TEMP_BIT_LEN   (8U)                
#define SAR_OLD_READ_SAR_LAST_TEMP_BIT_MASK  0xff00U              
#define SAR_OLD_READ_SAR_LAST_VBAT_BIT_OFFSET (0U)                
#define SAR_OLD_READ_SAR_LAST_VBAT_BIT_LEN   (8U)                
#define SAR_OLD_READ_SAR_LAST_VBAT_BIT_MASK  0xffU                

/******************************************************************************
* @brief Bit definitions for register PGC_CTRL
**/
#define PGC_CTRL_ID                          0x80010              
#define PGC_CTRL_LEN                         (4U)                
#define PGC_CTRL_MASK                        0xFFFFFFFFUL        
#define PGC_CTRL_PGC_START_VAL_BIT_OFFSET    (8U)                
#define PGC_CTRL_PGC_START_VAL_BIT_LEN       (1U)                
#define PGC_CTRL_PGC_START_VAL_BIT_MASK      0x100U               
#define PGC_CTRL_CAL_DIR_BIT_OFFSET          (7U)                
#define PGC_CTRL_CAL_DIR_BIT_LEN             (1U)                
#define PGC_CTRL_CAL_DIR_BIT_MASK            0x80U                
#define PGC_CTRL_CAL_ON_TX_BIT_OFFSET        (6U)                
#define PGC_CTRL_CAL_ON_TX_BIT_LEN           (1U)                
#define PGC_CTRL_CAL_ON_TX_BIT_MASK          0x40U                
#define PGC_CTRL_PGC_TMEAS_BIT_OFFSET        (2U)                
#define PGC_CTRL_PGC_TMEAS_BIT_LEN           (4U)                
#define PGC_CTRL_PGC_TMEAS_BIT_MASK          0x3cU                
#define PGC_CTRL_PGC_AUTO_CAL_BIT_OFFSET     (1U)                
#define PGC_CTRL_PGC_AUTO_CAL_BIT_LEN        (1U)                
#define PGC_CTRL_PGC_AUTO_CAL_BIT_MASK       0x2U                 
#define PGC_CTRL_PGC_START_BIT_OFFSET        (0U)                
#define PGC_CTRL_PGC_START_BIT_LEN           (1U)                
#define PGC_CTRL_PGC_START_BIT_MASK          0x1U                 

