tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register PGC_STATUS
**/
#define PGC_STATUS_ID                        0x80014              
#define PGC_STATUS_LEN                       (4U)                
#define PGC_STATUS_MASK                      0xFFFFFFFFUL        
#define PGC_STATUS_AUTOCAL_DONE_BIT_OFFSET   (12U)               
#define PGC_STATUS_AUTOCAL_DONE_BIT_LEN      (1U)                
#define PGC_STATUS_AUTOCAL_DONE_BIT_MASK     0x1000U              
#define PGC_STATUS_PG_DELAY_COUNT_BIT_OFFSET (0U)                
#define PGC_STATUS_PG_DELAY_COUNT_BIT_LEN    (12U)               
#define PGC_STATUS_PG_DELAY_COUNT_BIT_MASK   0xfffU               

/******************************************************************************
* @brief Bit definitions for register PG_TEST
**/
#define PG_TEST_ID                           0x80018              
#define PG_TEST_LEN                          (4U)                
#define PG_TEST_MASK                         0xFFFFFFFFUL        
#define PG_TEST_TX_TEST_CH4_BIT_OFFSET       (12U)               
#define PG_TEST_TX_TEST_CH4_BIT_LEN          (4U)                
#define PG_TEST_TX_TEST_CH4_BIT_MASK         0xf000U              
#define PG_TEST_TX_TEST_CH3_BIT_OFFSET       (8U)                
#define PG_TEST_TX_TEST_CH3_BIT_LEN          (4U)                
#define PG_TEST_TX_TEST_CH3_BIT_MASK         0xf00U               
#define PG_TEST_TX_TEST_CH2_BIT_OFFSET       (4U)                
#define PG_TEST_TX_TEST_CH2_BIT_LEN          (4U)                
#define PG_TEST_TX_TEST_CH2_BIT_MASK         0xf0U                
#define PG_TEST_TX_TEST_CH1_BIT_OFFSET       (0U)                
#define PG_TEST_TX_TEST_CH1_BIT_LEN          (4U)                
#define PG_TEST_TX_TEST_CH1_BIT_MASK         0xfU                 

/******************************************************************************
* @brief Bit definitions for register PG_CAL_TARGET
**/
#define PG_CAL_TARGET_ID                     0x8001c              
#define PG_CAL_TARGET_LEN                    (4U)                
#define PG_CAL_TARGET_MASK                   0xFFFFFFFFUL        
#define PG_CAL_TARGET_TARGET_BIT_OFFSET      (0U)                
#define PG_CAL_TARGET_TARGET_BIT_LEN         (12U)               
#define PG_CAL_TARGET_TARGET_BIT_MASK        0xfffU               

/******************************************************************************
* @brief Bit definitions for register DELTA_VBAT
**/
#define DELTA_VBAT_ID                        0x80020              
#define DELTA_VBAT_LEN                       (4U)                
#define DELTA_VBAT_MASK                      0xFFFFFFFFUL        
#define DELTA_VBAT_VBAT_EN_BIT_OFFSET        (7U)                
#define DELTA_VBAT_VBAT_EN_BIT_LEN           (1U)                
#define DELTA_VBAT_VBAT_EN_BIT_MASK          0x80U                
#define DELTA_VBAT_VBAT_BIT_OFFSET           (0U)                
#define DELTA_VBAT_VBAT_BIT_LEN              (7U)                
#define DELTA_VBAT_VBAT_BIT_MASK             0x7fU                

/******************************************************************************
* @brief Bit definitions for register DELTA_TEMP
**/
#define DELTA_TEMP_ID                        0x80024              
#define DELTA_TEMP_LEN                       (4U)                
#define DELTA_TEMP_MASK                      0xFFFFFFFFUL        
#define DELTA_TEMP_TEMP_EN_BIT_OFFSET        (7U)                
#define DELTA_TEMP_TEMP_EN_BIT_LEN           (1U)                
#define DELTA_TEMP_TEMP_EN_BIT_MASK          0x80U                
#define DELTA_TEMP_TEMP_BIT_OFFSET           (0U)                
#define DELTA_TEMP_TEMP_BIT_LEN              (7U)                
#define DELTA_TEMP_TEMP_BIT_MASK             0x7fU                

/******************************************************************************
* @brief Bit definitions for register DELTA_IRQ
**/
#define DELTA_IRQ_ID                         0x80028              
#define DELTA_IRQ_LEN                        (4U)                
#define DELTA_IRQ_MASK                       0xFFFFFFFFUL        
#define DELTA_IRQ_UPDATE_VBAT_COMP_BIT_OFFSET (3U)                
#define DELTA_IRQ_UPDATE_VBAT_COMP_BIT_LEN   (1U)                
#define DELTA_IRQ_UPDATE_VBAT_COMP_BIT_MASK  0x8U                 
#define DELTA_IRQ_UPDATE_TEMP_COMP_BIT_OFFSET (2U)                
#define DELTA_IRQ_UPDATE_TEMP_COMP_BIT_LEN   (1U)                
#define DELTA_IRQ_UPDATE_TEMP_COMP_BIT_MASK  0x4U                 
#define DELTA_IRQ_VTEMP_IRQ_STATUS_BIT_OFFSET (1U)                
#define DELTA_IRQ_VTEMP_IRQ_STATUS_BIT_LEN   (1U)                
#define DELTA_IRQ_VTEMP_IRQ_STATUS_BIT_MASK  0x2U                 
#define DELTA_IRQ_VBAT_IRQ_STATUS_BIT_OFFSET (0U)                
#define DELTA_IRQ_VBAT_IRQ_STATUS_BIT_LEN    (1U)                
#define DELTA_IRQ_VBAT_IRQ_STATUS_BIT_MASK   0x1U                 

/******************************************************************************
* @brief Bit definitions for register FOSC_CAL
**/
#define FOSC_CAL_ID                          0x8002c              
#define FOSC_CAL_LEN                         (4U)                
#define FOSC_CAL_MASK                        0xFFFFFFFFUL        
#define FOSC_CAL_FOSC_CAL_DONE_BIT_OFFSET    (16U)               
#define FOSC_CAL_FOSC_CAL_DONE_BIT_LEN       (1U)                
#define FOSC_CAL_FOSC_CAL_DONE_BIT_MASK      0x10000UL            
#define FOSC_CAL_FOSC_COUNT_BIT_OFFSET       (8U)                
#define FOSC_CAL_FOSC_COUNT_BIT_LEN          (8U)                
#define FOSC_CAL_FOSC_COUNT_BIT_MASK         0xff00U              
#define FOSC_CAL_FOSC_CAL_EN_BIT_OFFSET      (0U)                
#define FOSC_CAL_FOSC_CAL_EN_BIT_LEN         (1U)                
#define FOSC_CAL_FOSC_CAL_EN_BIT_MASK        0x1U                 

/******************************************************************************
* @brief Bit definitions for register PLL_CFG
**/
#define PLL_CFG_ID                           0x90000              
#define PLL_CFG_LEN                          (4U)                
#define PLL_CFG_MASK                         0xFFFFFFFFUL        
#define PLL_CFG_PLL_LD_SEL_BIT_OFFSET        (12U)               
#define PLL_CFG_PLL_LD_SEL_BIT_LEN           (2U)                
#define PLL_CFG_PLL_LD_SEL_BIT_MASK          0x3000U              
#define PLL_CFG_CH5_CP_ITUNE_BIT_OFFSET      (9U)                
#define PLL_CFG_CH5_CP_ITUNE_BIT_LEN         (3U)                
#define PLL_CFG_CH5_CP_ITUNE_BIT_MASK        0xe00U               
#define PLL_CFG_CH5_WD_COMP_TUNE_BIT_OFFSET  (6U)                
#define PLL_CFG_CH5_WD_COMP_TUNE_BIT_LEN     (3U)                
#define PLL_CFG_CH5_WD_COMP_TUNE_BIT_MASK    0x1c0U               
#define PLL_CFG_CH9_CP_ITUNE_BIT_OFFSET      (3U)                
#define PLL_CFG_CH9_CP_ITUNE_BIT_LEN         (3U)                
#define PLL_CFG_CH9_CP_ITUNE_BIT_MASK        0x38U                
#define PLL_CFG_CH9_WD_COMP_TUNE_BIT_OFFSET  (0U)                
#define PLL_CFG_CH9_WD_COMP_TUNE_BIT_LEN     (3U)                
#define PLL_CFG_CH9_WD_COMP_TUNE_BIT_MASK    0x7U                 

