tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register PLL_COARSE_CODE
**/
#define PLL_COARSE_CODE_ID                   0x90004              
#define PLL_COARSE_CODE_LEN                  (4U)                
#define PLL_COARSE_CODE_MASK                 0xFFFFFFFFUL        
#define PLL_COARSE_CODE_CH9_RVCO_FREQ_BOOST_BIT_OFFSET (24U)               
#define PLL_COARSE_CODE_CH9_RVCO_FREQ_BOOST_BIT_LEN (1U)                
#define PLL_COARSE_CODE_CH9_RVCO_FREQ_BOOST_BIT_MASK 0x1000000UL          
#define PLL_COARSE_CODE_CH5_VCO_COARSE_TUNE_BIT_OFFSET (8U)                
#define PLL_COARSE_CODE_CH5_VCO_COARSE_TUNE_BIT_LEN (14U)               
#define PLL_COARSE_CODE_CH5_VCO_COARSE_TUNE_BIT_MASK 0x3fff00UL           
#define PLL_COARSE_CODE_CH9_VCO_COARSE_TUNE_BIT_OFFSET (0U)                
#define PLL_COARSE_CODE_CH9_VCO_COARSE_TUNE_BIT_LEN (5U)                
#define PLL_COARSE_CODE_CH9_VCO_COARSE_TUNE_BIT_MASK 0x1fU                

/******************************************************************************
* @brief Bit definitions for register PLL_CAL
**/
#define PLL_CAL_ID                           0x90008              
#define PLL_CAL_LEN                          (4U)                
#define PLL_CAL_MASK                         0xFFFFFFFFUL        
#define PLL_CAL_PLL_WD_EN_BIT_OFFSET         (19U)               
#define PLL_CAL_PLL_WD_EN_BIT_LEN            (1U)                
#define PLL_CAL_PLL_WD_EN_BIT_MASK           0x80000UL            
#define PLL_CAL_PLL_DBG_CLR_BIT_OFFSET       (18U)               
#define PLL_CAL_PLL_DBG_CLR_BIT_LEN          (1U)                
#define PLL_CAL_PLL_DBG_CLR_BIT_MASK         0x40000UL            
#define PLL_CAL_PLL_DBG_EN_BIT_OFFSET        (17U)               
#define PLL_CAL_PLL_DBG_EN_BIT_LEN           (1U)                
#define PLL_CAL_PLL_DBG_EN_BIT_MASK          0x20000UL            
#define PLL_CAL_PLL_CAL_CLR_BIT_OFFSET       (16U)               
#define PLL_CAL_PLL_CAL_CLR_BIT_LEN          (1U)                
#define PLL_CAL_PLL_CAL_CLR_BIT_MASK         0x10000UL            
#define PLL_CAL_PLL_CAL_EN_BIT_OFFSET        (8U)                
#define PLL_CAL_PLL_CAL_EN_BIT_LEN           (1U)                
#define PLL_CAL_PLL_CAL_EN_BIT_MASK          0x100U               
#define PLL_CAL_PLL_LOCK_DLY_BIT_OFFSET      (3U)                
#define PLL_CAL_PLL_LOCK_DLY_BIT_LEN         (5U)                
#define PLL_CAL_PLL_LOCK_DLY_BIT_MASK        0xf8U                
#define PLL_CAL_PLL_TUNE_OVR_BIT_OFFSET      (2U)                
#define PLL_CAL_PLL_TUNE_OVR_BIT_LEN         (1U)                
#define PLL_CAL_PLL_TUNE_OVR_BIT_MASK        0x4U                 
#define PLL_CAL_PLL_USE_OLD_BIT_OFFSET       (1U)                
#define PLL_CAL_PLL_USE_OLD_BIT_LEN          (1U)                
#define PLL_CAL_PLL_USE_OLD_BIT_MASK         0x2U                 
#define PLL_CAL_PLL_CH9_FB_OVR_BIT_OFFSET    (0U)                
#define PLL_CAL_PLL_CH9_FB_OVR_BIT_LEN       (1U)                
#define PLL_CAL_PLL_CH9_FB_OVR_BIT_MASK      0x1U                 

/******************************************************************************
* @brief Bit definitions for register PLL_STATUS
**/
#define PLL_STATUS_ID                        0x9000c              
#define PLL_STATUS_LEN                       (4U)                
#define PLL_STATUS_MASK                      0xFFFFFFFFUL        
#define PLL_STATUS_LD_CODE_BIT_OFFSET        (8U)                
#define PLL_STATUS_LD_CODE_BIT_LEN           (5U)                
#define PLL_STATUS_LD_CODE_BIT_MASK          0x1f00U              
#define PLL_STATUS_XTAL_AMP_SETTLED_BIT_OFFSET (6U)                
#define PLL_STATUS_XTAL_AMP_SETTLED_BIT_LEN  (1U)                
#define PLL_STATUS_XTAL_AMP_SETTLED_BIT_MASK 0x40U                
#define PLL_STATUS_VCO_TUNE_UPDATE_BIT_OFFSET (5U)                
#define PLL_STATUS_VCO_TUNE_UPDATE_BIT_LEN   (1U)                
#define PLL_STATUS_VCO_TUNE_UPDATE_BIT_MASK  0x20U                
#define PLL_STATUS_PLL_OVRFLOW_BIT_OFFSET    (4U)                
#define PLL_STATUS_PLL_OVRFLOW_BIT_LEN       (1U)                
#define PLL_STATUS_PLL_OVRFLOW_BIT_MASK      0x10U                
#define PLL_STATUS_PLL_HI_FLAG_BIT_OFFSET    (3U)                
#define PLL_STATUS_PLL_HI_FLAG_BIT_LEN       (1U)                
#define PLL_STATUS_PLL_HI_FLAG_BIT_MASK      0x8U                 
#define PLL_STATUS_PLL_LO_FLAG_N_BIT_OFFSET  (2U)                
#define PLL_STATUS_PLL_LO_FLAG_N_BIT_LEN     (1U)                
#define PLL_STATUS_PLL_LO_FLAG_N_BIT_MASK    0x4U                 
#define PLL_STATUS_PLL_LOCK_FLAG_BIT_OFFSET  (1U)                
#define PLL_STATUS_PLL_LOCK_FLAG_BIT_LEN     (1U)                
#define PLL_STATUS_PLL_LOCK_FLAG_BIT_MASK    0x2U                 
#define PLL_STATUS_CPC_CAL_DONE_BIT_OFFSET   (0U)                
#define PLL_STATUS_CPC_CAL_DONE_BIT_LEN      (1U)                
#define PLL_STATUS_CPC_CAL_DONE_BIT_MASK     0x1U                 

/******************************************************************************
* @brief Bit definitions for register PLL_COMMON
**/
#define PLL_COMMON_ID                        0x90010              
#define PLL_COMMON_LEN                       (4U)                
#define PLL_COMMON_MASK                      0xFFFFFFFFUL        
#define PLL_COMMON_PLL_BIAS_TRIM_BIT_OFFSET  (13U)               
#define PLL_COMMON_PLL_BIAS_TRIM_BIT_LEN     (3U)                
#define PLL_COMMON_PLL_BIAS_TRIM_BIT_MASK    0xe000U              
#define PLL_COMMON_DIG_PLL_WD_SEL_REF_CLK_DIVBY16_ULV_BIT_OFFSET (12U)               
#define PLL_COMMON_DIG_PLL_WD_SEL_REF_CLK_DIVBY16_ULV_BIT_LEN (1U)                
#define PLL_COMMON_DIG_PLL_WD_SEL_REF_CLK_DIVBY16_ULV_BIT_MASK 0x1000U              
#define PLL_COMMON_DIG_PLL_WD_SEL_EXT_CLK_ULV_BIT_OFFSET (11U)               
#define PLL_COMMON_DIG_PLL_WD_SEL_EXT_CLK_ULV_BIT_LEN (1U)                
#define PLL_COMMON_DIG_PLL_WD_SEL_EXT_CLK_ULV_BIT_MASK 0x800U               
#define PLL_COMMON_DIG_WD_EXT_CLK_ULV_BIT_OFFSET (10U)               
#define PLL_COMMON_DIG_WD_EXT_CLK_ULV_BIT_LEN (1U)                
#define PLL_COMMON_DIG_WD_EXT_CLK_ULV_BIT_MASK 0x400U               
#define PLL_COMMON_PLL_WD_HYST_BOOST_BIT_OFFSET (9U)                
#define PLL_COMMON_PLL_WD_HYST_BOOST_BIT_LEN (1U)                
#define PLL_COMMON_PLL_WD_HYST_BOOST_BIT_MASK 0x200U               
#define PLL_COMMON_PLL_PTAT_SEL_BIT_OFFSET   (8U)                
#define PLL_COMMON_PLL_PTAT_SEL_BIT_LEN      (1U)                
#define PLL_COMMON_PLL_PTAT_SEL_BIT_MASK     0x100U               
#define PLL_COMMON_PLL_PFD_DLY_TUNE_BIT_OFFSET (4U)                
#define PLL_COMMON_PLL_PFD_DLY_TUNE_BIT_LEN  (4U)                
#define PLL_COMMON_PLL_PFD_DLY_TUNE_BIT_MASK 0xf0U                
#define PLL_COMMON_PLL_LD_DLY_TUNE_BIT_OFFSET (0U)                
#define PLL_COMMON_PLL_LD_DLY_TUNE_BIT_LEN   (4U)                
#define PLL_COMMON_PLL_LD_DLY_TUNE_BIT_MASK  0xfU                 

