tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register XTAL
**/
#define XTAL_ID                              0x90014              
#define XTAL_LEN                             (4U)                
#define XTAL_MASK                            0xFFFFFFFFUL        
#define XTAL_XTAL_SPARE_BIT_OFFSET           (28U)               
#define XTAL_XTAL_SPARE_BIT_LEN              (4U)                
#define XTAL_XTAL_SPARE_BIT_MASK             0xf0000000UL         
#define XTAL_XTAL_R2R_SEQ_EN_BIT_OFFSET      (27U)               
#define XTAL_XTAL_R2R_SEQ_EN_BIT_LEN         (1U)                
#define XTAL_XTAL_R2R_SEQ_EN_BIT_MASK        0x8000000UL          
#define XTAL_XTAL_R2R_GEN_BIT_OFFSET         (26U)               
#define XTAL_XTAL_R2R_GEN_BIT_LEN            (1U)                
#define XTAL_XTAL_R2R_GEN_BIT_MASK           0x4000000UL          
#define XTAL_XTAL_AMP_OK_OVERRIDE_ULV_BIT_OFFSET (25U)               
#define XTAL_XTAL_AMP_OK_OVERRIDE_ULV_BIT_LEN (1U)                
#define XTAL_XTAL_AMP_OK_OVERRIDE_ULV_BIT_MASK 0x2000000UL          
#define XTAL_XTAL_CLK_CAPDAC_SEL_ULV_BIT_OFFSET (23U)               
#define XTAL_XTAL_CLK_CAPDAC_SEL_ULV_BIT_LEN (2U)                
#define XTAL_XTAL_CLK_CAPDAC_SEL_ULV_BIT_MASK 0x1800000UL          
#define XTAL_XTAL_DIGTEST_EN_ULV_BIT_OFFSET  (22U)               
#define XTAL_XTAL_DIGTEST_EN_ULV_BIT_LEN     (1U)                
#define XTAL_XTAL_DIGTEST_EN_ULV_BIT_MASK    0x400000UL           
#define XTAL_XTAL_DIGTEST_SEL_ULV_BIT_OFFSET (19U)               
#define XTAL_XTAL_DIGTEST_SEL_ULV_BIT_LEN    (3U)                
#define XTAL_XTAL_DIGTEST_SEL_ULV_BIT_MASK   0x380000UL           
#define XTAL_XTAL_BIASSEL_ULV_BIT_OFFSET     (17U)               
#define XTAL_XTAL_BIASSEL_ULV_BIT_LEN        (2U)                
#define XTAL_XTAL_BIASSEL_ULV_BIT_MASK       0x60000UL            
#define XTAL_XTAL_IFIXED_PROG_ULV_BIT_OFFSET (14U)               
#define XTAL_XTAL_IFIXED_PROG_ULV_BIT_LEN    (3U)                
#define XTAL_XTAL_IFIXED_PROG_ULV_BIT_MASK   0x1c000UL            
#define XTAL_XTAL_IVAR_PROG_ULV_BIT_OFFSET   (11U)               
#define XTAL_XTAL_IVAR_PROG_ULV_BIT_LEN      (3U)                
#define XTAL_XTAL_IVAR_PROG_ULV_BIT_MASK     0x3800U              
#define XTAL_XTAL_REFCLK_COMP_EN_ULV_BIT_OFFSET (10U)               
#define XTAL_XTAL_REFCLK_COMP_EN_ULV_BIT_LEN (1U)                
#define XTAL_XTAL_REFCLK_COMP_EN_ULV_BIT_MASK 0x400U               
#define XTAL_XTAL_VAMP_DET_RANGE_CRTL_ULV_BIT_OFFSET (8U)                
#define XTAL_XTAL_VAMP_DET_RANGE_CRTL_ULV_BIT_LEN (2U)                
#define XTAL_XTAL_VAMP_DET_RANGE_CRTL_ULV_BIT_MASK 0x300U               
#define XTAL_XTAL_TRIM_BIT_OFFSET            (0U)                
#define XTAL_XTAL_TRIM_BIT_LEN               (7U)                
#define XTAL_XTAL_TRIM_BIT_MASK              0x7fU                

/******************************************************************************
* @brief Bit definitions for register PLL_LOCK_TIME_DBG
**/
#define PLL_LOCK_TIME_DBG_ID                 0x90018              
#define PLL_LOCK_TIME_DBG_LEN                (4U)                
#define PLL_LOCK_TIME_DBG_MASK               0xFFFFFFFFUL        
#define PLL_LOCK_TIME_DBG_CLKPLL_CH5_LOCK_EVENTS_BIT_OFFSET (8U)                
#define PLL_LOCK_TIME_DBG_CLKPLL_CH5_LOCK_EVENTS_BIT_LEN (4U)                
#define PLL_LOCK_TIME_DBG_CLKPLL_CH5_LOCK_EVENTS_BIT_MASK 0xf00U               
#define PLL_LOCK_TIME_DBG_CLKPLL_CH5_LOCK_TIME_BIT_OFFSET (0U)                
#define PLL_LOCK_TIME_DBG_CLKPLL_CH5_LOCK_TIME_BIT_LEN (8U)                
#define PLL_LOCK_TIME_DBG_CLKPLL_CH5_LOCK_TIME_BIT_MASK 0xffU                

/******************************************************************************
* @brief Bit definitions for register AON_DIG_CFG
**/
#define AON_DIG_CFG_ID                       0xa0000              
#define AON_DIG_CFG_LEN                      (4U)                
#define AON_DIG_CFG_MASK                     0xFFFFFFFFUL        
#define AON_DIG_CFG_ONWAKE_LOAD_DGC_ALT_BIT_OFFSET (18U)               
#define AON_DIG_CFG_ONWAKE_LOAD_DGC_ALT_BIT_LEN (1U)                
#define AON_DIG_CFG_ONWAKE_LOAD_DGC_ALT_BIT_MASK 0x40000UL            
#define AON_DIG_CFG_VWARN_COMP_POL_BIT_OFFSET (17U)               
#define AON_DIG_CFG_VWARN_COMP_POL_BIT_LEN   (1U)                
#define AON_DIG_CFG_VWARN_COMP_POL_BIT_MASK  0x20000UL            
#define AON_DIG_CFG_VWARN_COMP_TRIM_BIT_OFFSET (13U)               
#define AON_DIG_CFG_VWARN_COMP_TRIM_BIT_LEN  (4U)                
#define AON_DIG_CFG_VWARN_COMP_TRIM_BIT_MASK 0x1e000UL            
#define AON_DIG_CFG_VWARN_COMP_EN_BIT_OFFSET (12U)               
#define AON_DIG_CFG_VWARN_COMP_EN_BIT_LEN    (1U)                
#define AON_DIG_CFG_VWARN_COMP_EN_BIT_MASK   0x1000U              
#define AON_DIG_CFG_ONWAKE_PGFCAL_BIT_OFFSET (11U)               
#define AON_DIG_CFG_ONWAKE_PGFCAL_BIT_LEN    (1U)                
#define AON_DIG_CFG_ONWAKE_PGFCAL_BIT_MASK   0x800U               
#define AON_DIG_CFG_ONWAKE_PLLVAL_BIT_OFFSET (10U)               
#define AON_DIG_CFG_ONWAKE_PLLVAL_BIT_LEN    (1U)                
#define AON_DIG_CFG_ONWAKE_PLLVAL_BIT_MASK   0x400U               
#define AON_DIG_CFG_ONWAKE_GO2RX_BIT_OFFSET  (9U)                
#define AON_DIG_CFG_ONWAKE_GO2RX_BIT_LEN     (1U)                
#define AON_DIG_CFG_ONWAKE_GO2RX_BIT_MASK    0x200U               
#define AON_DIG_CFG_ONWAKE_GO2IDLE_BIT_OFFSET (8U)                
#define AON_DIG_CFG_ONWAKE_GO2IDLE_BIT_LEN   (1U)                
#define AON_DIG_CFG_ONWAKE_GO2IDLE_BIT_MASK  0x100U               
#define AON_DIG_CFG_ONWAKE_GEAR_SEL_BIT_OFFSET (6U)                
#define AON_DIG_CFG_ONWAKE_GEAR_SEL_BIT_LEN  (2U)                
#define AON_DIG_CFG_ONWAKE_GEAR_SEL_BIT_MASK 0xc0U                
#define AON_DIG_CFG_ONWAKE_LOAD_GEAR_BIT_OFFSET (5U)                
#define AON_DIG_CFG_ONWAKE_LOAD_GEAR_BIT_LEN (1U)                
#define AON_DIG_CFG_ONWAKE_LOAD_GEAR_BIT_MASK 0x20U                
#define AON_DIG_CFG_ONWAKE_LOAD_LDO_BIT_OFFSET (4U)                
#define AON_DIG_CFG_ONWAKE_LOAD_LDO_BIT_LEN  (1U)                
#define AON_DIG_CFG_ONWAKE_LOAD_LDO_BIT_MASK 0x10U                
#define AON_DIG_CFG_ONWAKE_LOAD_DGC_BIT_OFFSET (3U)                
#define AON_DIG_CFG_ONWAKE_LOAD_DGC_BIT_LEN  (1U)                
#define AON_DIG_CFG_ONWAKE_LOAD_DGC_BIT_MASK 0x8U                 
#define AON_DIG_CFG_ONWAKE_LOAD_BIAS_BIT_OFFSET (2U)                
#define AON_DIG_CFG_ONWAKE_LOAD_BIAS_BIT_LEN (1U)                
#define AON_DIG_CFG_ONWAKE_LOAD_BIAS_BIT_MASK 0x4U                 
#define AON_DIG_CFG_ONWAKE_RUN_SAR_BIT_OFFSET (1U)                
#define AON_DIG_CFG_ONWAKE_RUN_SAR_BIT_LEN   (1U)                
#define AON_DIG_CFG_ONWAKE_RUN_SAR_BIT_MASK  0x2U                 
#define AON_DIG_CFG_ONWAKE_AON_DLD_BIT_OFFSET (0U)                
#define AON_DIG_CFG_ONWAKE_AON_DLD_BIT_LEN   (1U)                
#define AON_DIG_CFG_ONWAKE_AON_DLD_BIT_MASK  0x1U                 

