tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register AON_CTRL
**/
#define AON_CTRL_ID                          0xa0004              
#define AON_CTRL_LEN                         (4U)                
#define AON_CTRL_MASK                        0xFFFFFFFFUL        
#define AON_CTRL_OVERRIDE_EN_BIT_OFFSET      (7U)                
#define AON_CTRL_OVERRIDE_EN_BIT_LEN         (1U)                
#define AON_CTRL_OVERRIDE_EN_BIT_MASK        0x80U                
#define AON_CTRL_AON_CLK_EDGE_SEL_BIT_OFFSET (6U)                
#define AON_CTRL_AON_CLK_EDGE_SEL_BIT_LEN    (1U)                
#define AON_CTRL_AON_CLK_EDGE_SEL_BIT_MASK   0x40U                
#define AON_CTRL_OVR_WR_CFG_EN_BIT_OFFSET    (5U)                
#define AON_CTRL_OVR_WR_CFG_EN_BIT_LEN       (1U)                
#define AON_CTRL_OVR_WR_CFG_EN_BIT_MASK      0x20U                
#define AON_CTRL_OVR_WRITE_EN_BIT_OFFSET     (4U)                
#define AON_CTRL_OVR_WRITE_EN_BIT_LEN        (1U)                
#define AON_CTRL_OVR_WRITE_EN_BIT_MASK       0x10U                
#define AON_CTRL_OVR_READ_EN_BIT_OFFSET      (3U)                
#define AON_CTRL_OVR_READ_EN_BIT_LEN         (1U)                
#define AON_CTRL_OVR_READ_EN_BIT_MASK        0x8U                 
#define AON_CTRL_CONFIG_UPLOAD_BIT_OFFSET    (2U)                
#define AON_CTRL_CONFIG_UPLOAD_BIT_LEN       (1U)                
#define AON_CTRL_CONFIG_UPLOAD_BIT_MASK      0x4U                 
#define AON_CTRL_ARRAY_UPLOAD_BIT_OFFSET     (1U)                
#define AON_CTRL_ARRAY_UPLOAD_BIT_LEN        (1U)                
#define AON_CTRL_ARRAY_UPLOAD_BIT_MASK       0x2U                 
#define AON_CTRL_ARRAY_DOWNLOAD_BIT_OFFSET   (0U)                
#define AON_CTRL_ARRAY_DOWNLOAD_BIT_LEN      (1U)                
#define AON_CTRL_ARRAY_DOWNLOAD_BIT_MASK     0x1U                 

/******************************************************************************
* @brief Bit definitions for register AON_RDATA
**/
#define AON_RDATA_ID                         0xa0008              
#define AON_RDATA_LEN                        (4U)                
#define AON_RDATA_MASK                       0xFFFFFFFFUL        
#define AON_RDATA_RDATA_BIT_OFFSET           (0U)                
#define AON_RDATA_RDATA_BIT_LEN              (8U)                
#define AON_RDATA_RDATA_BIT_MASK             0xffU                

/******************************************************************************
* @brief Bit definitions for register AON_ADDR
**/
#define AON_ADDR_ID                          0xa000c              
#define AON_ADDR_LEN                         (4U)                
#define AON_ADDR_MASK                        0xFFFFFFFFUL        
#define AON_ADDR_ADDR_BIT_OFFSET             (0U)                
#define AON_ADDR_ADDR_BIT_LEN                (9U)                
#define AON_ADDR_ADDR_BIT_MASK               0x1ffU               

/******************************************************************************
* @brief Bit definitions for register AON_WDATA
**/
#define AON_WDATA_ID                         0xa0010              
#define AON_WDATA_LEN                        (4U)                
#define AON_WDATA_MASK                       0xFFFFFFFFUL        
#define AON_WDATA_WDATA_BIT_OFFSET           (0U)                
#define AON_WDATA_WDATA_BIT_LEN              (8U)                
#define AON_WDATA_WDATA_BIT_MASK             0xffU                

/******************************************************************************
* @brief Bit definitions for register ANA_CFG
**/
#define ANA_CFG_ID                           0xa0014              
#define ANA_CFG_LEN                          (4U)                
#define ANA_CFG_MASK                         0xFFFFFFFFUL        
#define ANA_CFG_SLEEP_CNT_RPT_BIT_OFFSET     (6U)                
#define ANA_CFG_SLEEP_CNT_RPT_BIT_LEN        (1U)                
#define ANA_CFG_SLEEP_CNT_RPT_BIT_MASK       0x40U                
#define ANA_CFG_SLEEP_PRESERVE_BIT_OFFSET    (5U)                
#define ANA_CFG_SLEEP_PRESERVE_BIT_LEN       (1U)                
#define ANA_CFG_SLEEP_PRESERVE_BIT_MASK      0x20U                
#define ANA_CFG_WAKEON_WUP_BIT_OFFSET        (4U)                
#define ANA_CFG_WAKEON_WUP_BIT_LEN           (1U)                
#define ANA_CFG_WAKEON_WUP_BIT_MASK          0x10U                
#define ANA_CFG_WAKEON_CSN_BIT_OFFSET        (3U)                
#define ANA_CFG_WAKEON_CSN_BIT_LEN           (1U)                
#define ANA_CFG_WAKEON_CSN_BIT_MASK          0x8U                 
#define ANA_CFG_BROUT_KEEP_ON_BIT_OFFSET     (2U)                
#define ANA_CFG_BROUT_KEEP_ON_BIT_LEN        (1U)                
#define ANA_CFG_BROUT_KEEP_ON_BIT_MASK       0x4U                 
#define ANA_CFG_DEEPSLEEP_EN_BIT_OFFSET      (1U)                
#define ANA_CFG_DEEPSLEEP_EN_BIT_LEN         (1U)                
#define ANA_CFG_DEEPSLEEP_EN_BIT_MASK        0x2U                 
#define ANA_CFG_SLEEP_EN_BIT_OFFSET          (0U)                
#define ANA_CFG_SLEEP_EN_BIT_LEN             (1U)                
#define ANA_CFG_SLEEP_EN_BIT_MASK            0x1U                 

/******************************************************************************
* @brief Bit definitions for register NVM_WDATA
**/
#define NVM_WDATA_ID                         0xb0000              
#define NVM_WDATA_LEN                        (4U)                
#define NVM_WDATA_MASK                       0xFFFFFFFFUL        
#define NVM_WDATA_NVM_WDATA_BIT_OFFSET       (0U)                
#define NVM_WDATA_NVM_WDATA_BIT_LEN          (32U)               
#define NVM_WDATA_NVM_WDATA_BIT_MASK         0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register NVM_ADDR
**/
#define NVM_ADDR_ID                          0xb0004              
#define NVM_ADDR_LEN                         (4U)                
#define NVM_ADDR_MASK                        0xFFFFFFFFUL        
#define NVM_ADDR_NVM_ADDR_BIT_OFFSET         (0U)                
#define NVM_ADDR_NVM_ADDR_BIT_LEN            (11U)               
#define NVM_ADDR_NVM_ADDR_BIT_MASK           0x7ffU               

