tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register NVM_CFG
**/
#define NVM_CFG_ID                           0xb0008              
#define NVM_CFG_LEN                          (4U)                
#define NVM_CFG_MASK                         0xFFFFFFFFUL        
#define NVM_CFG_DGC_SEL_BIT_OFFSET           (13U)               
#define NVM_CFG_DGC_SEL_BIT_LEN              (1U)                
#define NVM_CFG_DGC_SEL_BIT_MASK             0x2000U              
#define NVM_CFG_GEAR_ID_BIT_OFFSET           (11U)               
#define NVM_CFG_GEAR_ID_BIT_LEN              (2U)                
#define NVM_CFG_GEAR_ID_BIT_MASK             0x1800U              
#define NVM_CFG_GEAR_KICK_BIT_OFFSET         (10U)               
#define NVM_CFG_GEAR_KICK_BIT_LEN            (1U)                
#define NVM_CFG_GEAR_KICK_BIT_MASK           0x400U               
#define NVM_CFG_NVM_PD_BIT_OFFSET            (9U)                
#define NVM_CFG_NVM_PD_BIT_LEN               (1U)                
#define NVM_CFG_NVM_PD_BIT_MASK              0x200U               
#define NVM_CFG_BIAS_KICK_BIT_OFFSET         (8U)                
#define NVM_CFG_BIAS_KICK_BIT_LEN            (1U)                
#define NVM_CFG_BIAS_KICK_BIT_MASK           0x100U               
#define NVM_CFG_LDO_KICK_BIT_OFFSET          (7U)                
#define NVM_CFG_LDO_KICK_BIT_LEN             (1U)                
#define NVM_CFG_LDO_KICK_BIT_MASK            0x80U                
#define NVM_CFG_DGC_KICK_BIT_OFFSET          (6U)                
#define NVM_CFG_DGC_KICK_BIT_LEN             (1U)                
#define NVM_CFG_DGC_KICK_BIT_MASK            0x40U                
#define NVM_CFG_ADDR_INC_BIT_OFFSET          (5U)                
#define NVM_CFG_ADDR_INC_BIT_LEN             (1U)                
#define NVM_CFG_ADDR_INC_BIT_MASK            0x20U                
#define NVM_CFG_NVM_MODE_SEL_BIT_OFFSET      (4U)                
#define NVM_CFG_NVM_MODE_SEL_BIT_LEN         (1U)                
#define NVM_CFG_NVM_MODE_SEL_BIT_MASK        0x10U                
#define NVM_CFG_NVM_WRITE_MR_BIT_OFFSET      (3U)                
#define NVM_CFG_NVM_WRITE_MR_BIT_LEN         (1U)                
#define NVM_CFG_NVM_WRITE_MR_BIT_MASK        0x8U                 
#define NVM_CFG_NVM_WRITE_BIT_OFFSET         (2U)                
#define NVM_CFG_NVM_WRITE_BIT_LEN            (1U)                
#define NVM_CFG_NVM_WRITE_BIT_MASK           0x4U                 
#define NVM_CFG_NVM_READ_BIT_OFFSET          (1U)                
#define NVM_CFG_NVM_READ_BIT_LEN             (1U)                
#define NVM_CFG_NVM_READ_BIT_MASK            0x2U                 
#define NVM_CFG_NVM_MAN_CTR_EN_BIT_OFFSET    (0U)                
#define NVM_CFG_NVM_MAN_CTR_EN_BIT_LEN       (1U)                
#define NVM_CFG_NVM_MAN_CTR_EN_BIT_MASK      0x1U                 

/******************************************************************************
* @brief Bit definitions for register NVM_STATUS
**/
#define NVM_STATUS_ID                        0xb000c              
#define NVM_STATUS_LEN                       (4U)                
#define NVM_STATUS_MASK                      0xFFFFFFFFUL        
#define NVM_STATUS_NVM_UNLOCKED_BIT_OFFSET   (11U)               
#define NVM_STATUS_NVM_UNLOCKED_BIT_LEN      (1U)                
#define NVM_STATUS_NVM_UNLOCKED_BIT_MASK     0x800U               
#define NVM_STATUS_NVM_STATE_BIT_OFFSET      (7U)                
#define NVM_STATUS_NVM_STATE_BIT_LEN         (4U)                
#define NVM_STATUS_NVM_STATE_BIT_MASK        0x780U               
#define NVM_STATUS_NVM_SEQ_STATE_BIT_OFFSET  (3U)                
#define NVM_STATUS_NVM_SEQ_STATE_BIT_LEN     (4U)                
#define NVM_STATUS_NVM_SEQ_STATE_BIT_MASK    0x78U                
#define NVM_STATUS_NVM_SO_BIT_OFFSET         (2U)                
#define NVM_STATUS_NVM_SO_BIT_LEN            (1U)                
#define NVM_STATUS_NVM_SO_BIT_MASK           0x4U                 
#define NVM_STATUS_NVM_VPP_OK_BIT_OFFSET     (1U)                
#define NVM_STATUS_NVM_VPP_OK_BIT_LEN        (1U)                
#define NVM_STATUS_NVM_VPP_OK_BIT_MASK       0x2U                 
#define NVM_STATUS_NVM_PROG_DONE_BIT_OFFSET  (0U)                
#define NVM_STATUS_NVM_PROG_DONE_BIT_LEN     (1U)                
#define NVM_STATUS_NVM_PROG_DONE_BIT_MASK    0x1U                 

/******************************************************************************
* @brief Bit definitions for register NVM_RDATA
**/
#define NVM_RDATA_ID                         0xb0010              
#define NVM_RDATA_LEN                        (4U)                
#define NVM_RDATA_MASK                       0xFFFFFFFFUL        
#define NVM_RDATA_NVM_RDATA_BIT_OFFSET       (0U)                
#define NVM_RDATA_NVM_RDATA_BIT_LEN          (32U)               
#define NVM_RDATA_NVM_RDATA_BIT_MASK         0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register NVM_SRDATA
**/
#define NVM_SRDATA_ID                        0xb0014              
#define NVM_SRDATA_LEN                       (4U)                
#define NVM_SRDATA_MASK                      0xFFFFFFFFUL        
#define NVM_SRDATA_NVM_SRDATA_BIT_OFFSET     (0U)                
#define NVM_SRDATA_NVM_SRDATA_BIT_LEN        (32U)               
#define NVM_SRDATA_NVM_SRDATA_BIT_MASK       0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register IP_TOA_LO
**/
#define IP_TOA_LO_ID                         0xc0000              
#define IP_TOA_LO_LEN                        (4U)                
#define IP_TOA_LO_MASK                       0xFFFFFFFFUL        
#define IP_TOA_LO_RX_TOA_BIT_OFFSET          (0U)                
#define IP_TOA_LO_RX_TOA_BIT_LEN             (32U)               
#define IP_TOA_LO_RX_TOA_BIT_MASK            0xffffffffUL         

