tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register IP_TOA_HI
**/
#define IP_TOA_HI_ID                         0xc0004              
#define IP_TOA_HI_LEN                        (4U)                
#define IP_TOA_HI_MASK                       0xFFFFFFFFUL        
#define IP_TOA_HI_STATUS_BIT_OFFSET          (24U)               
#define IP_TOA_HI_STATUS_BIT_LEN             (8U)                
#define IP_TOA_HI_STATUS_BIT_MASK            0xff000000UL         
#define IP_TOA_HI_POA_BIT_OFFSET             (8U)                
#define IP_TOA_HI_POA_BIT_LEN                (14U)               
#define IP_TOA_HI_POA_BIT_MASK               0x3fff00UL           
#define IP_TOA_HI_RX_TOA_BIT_OFFSET          (0U)                
#define IP_TOA_HI_RX_TOA_BIT_LEN             (8U)                
#define IP_TOA_HI_RX_TOA_BIT_MASK            0xffU                

/******************************************************************************
* @brief Bit definitions for register CY0_TOA_LO
**/
#define CY0_TOA_LO_ID                        0xc0008              
#define CY0_TOA_LO_LEN                       (4U)                
#define CY0_TOA_LO_MASK                      0xFFFFFFFFUL        
#define CY0_TOA_LO_RX_TOA_BIT_OFFSET         (0U)                
#define CY0_TOA_LO_RX_TOA_BIT_LEN            (32U)               
#define CY0_TOA_LO_RX_TOA_BIT_MASK           0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register CY0_TOA_HI
**/
#define CY0_TOA_HI_ID                        0xc000c              
#define CY0_TOA_HI_LEN                       (4U)                
#define CY0_TOA_HI_MASK                      0xFFFFFFFFUL        
#define CY0_TOA_HI_STATUS_BIT_OFFSET         (23U)               
#define CY0_TOA_HI_STATUS_BIT_LEN            (9U)                
#define CY0_TOA_HI_STATUS_BIT_MASK           0xff800000UL         
#define CY0_TOA_HI_POA_BIT_OFFSET            (8U)                
#define CY0_TOA_HI_POA_BIT_LEN               (14U)               
#define CY0_TOA_HI_POA_BIT_MASK              0x3fff00UL           
#define CY0_TOA_HI_RXTOA_BIT_OFFSET          (0U)                
#define CY0_TOA_HI_RXTOA_BIT_LEN             (8U)                
#define CY0_TOA_HI_RXTOA_BIT_MASK            0xffU                

/******************************************************************************
* @brief Bit definitions for register CY1_TOA_LO
**/
#define CY1_TOA_LO_ID                        0xc0010              
#define CY1_TOA_LO_LEN                       (4U)                
#define CY1_TOA_LO_MASK                      0xFFFFFFFFUL        
#define CY1_TOA_LO_RX_TOA_BIT_OFFSET         (0U)                
#define CY1_TOA_LO_RX_TOA_BIT_LEN            (32U)               
#define CY1_TOA_LO_RX_TOA_BIT_MASK           0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register CY1_TOA_HI
**/
#define CY1_TOA_HI_ID                        0xc0014              
#define CY1_TOA_HI_LEN                       (4U)                
#define CY1_TOA_HI_MASK                      0xFFFFFFFFUL        
#define CY1_TOA_HI_STATUS_BIT_OFFSET         (23U)               
#define CY1_TOA_HI_STATUS_BIT_LEN            (9U)                
#define CY1_TOA_HI_STATUS_BIT_MASK           0xff800000UL         
#define CY1_TOA_HI_POA_BIT_OFFSET            (8U)                
#define CY1_TOA_HI_POA_BIT_LEN               (14U)               
#define CY1_TOA_HI_POA_BIT_MASK              0x3fff00UL           
#define CY1_TOA_HI_RXTOA_BIT_OFFSET          (0U)                
#define CY1_TOA_HI_RXTOA_BIT_LEN             (8U)                
#define CY1_TOA_HI_RXTOA_BIT_MASK            0xffU                

/******************************************************************************
* @brief Bit definitions for register CIA_TDOA_0
**/
#define CIA_TDOA_0_ID                        0xc0018              
#define CIA_TDOA_0_LEN                       (4U)                
#define CIA_TDOA_0_MASK                      0xFFFFFFFFUL        
#define CIA_TDOA_0_RX_TDOA_BIT_OFFSET        (0U)                
#define CIA_TDOA_0_RX_TDOA_BIT_LEN           (32U)               
#define CIA_TDOA_0_RX_TDOA_BIT_MASK          0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register CIA_TDOA_1_PDOA
**/
#define CIA_TDOA_1_PDOA_ID                   0xc001c              
#define CIA_TDOA_1_PDOA_LEN                  (4U)                
#define CIA_TDOA_1_PDOA_MASK                 0xFFFFFFFFUL        
#define CIA_TDOA_1_PDOA_FP_AGREED_BIT_OFFSET (30U)               
#define CIA_TDOA_1_PDOA_FP_AGREED_BIT_LEN    (1U)                
#define CIA_TDOA_1_PDOA_FP_AGREED_BIT_MASK   0x40000000UL         
#define CIA_TDOA_1_PDOA_RX_PDOA_BIT_OFFSET   (16U)               
#define CIA_TDOA_1_PDOA_RX_PDOA_BIT_LEN      (14U)               
#define CIA_TDOA_1_PDOA_RX_PDOA_BIT_MASK     0x3fff0000UL         
#define CIA_TDOA_1_PDOA_RX_TDOA_BIT_OFFSET   (0U)                
#define CIA_TDOA_1_PDOA_RX_TDOA_BIT_LEN      (9U)                
#define CIA_TDOA_1_PDOA_RX_TDOA_BIT_MASK     0x1ffU               

/******************************************************************************
* @brief Bit definitions for register CIA_DIAG_0
**/
#define CIA_DIAG_0_ID                        0xc0020              
#define CIA_DIAG_0_LEN                       (4U)                
#define CIA_DIAG_0_MASK                      0xFFFFFFFFUL        
#define CIA_DIAG_0_ISOLATION_INDEX0_BIT_OFFSET (27U)               
#define CIA_DIAG_0_ISOLATION_INDEX0_BIT_LEN  (5U)                
#define CIA_DIAG_0_ISOLATION_INDEX0_BIT_MASK 0xf8000000UL         
#define CIA_DIAG_0_PDOA_OFFSET_BIT_OFFSET    (13U)               
#define CIA_DIAG_0_PDOA_OFFSET_BIT_LEN       (14U)               
#define CIA_DIAG_0_PDOA_OFFSET_BIT_MASK      0x7ffe000UL          
#define CIA_DIAG_0_XTALOFFSET_BIT_OFFSET     (0U)                
#define CIA_DIAG_0_XTALOFFSET_BIT_LEN        (13U)               
#define CIA_DIAG_0_XTALOFFSET_BIT_MASK       0x1fffU              

