tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register CIA_DIAG_1
**/
#define CIA_DIAG_1_ID                        0xc0024              
#define CIA_DIAG_1_LEN                       (4U)                
#define CIA_DIAG_1_MASK                      0xFFFFFFFFUL        
#define CIA_DIAG_1_ISOLATION_INDEX1_BIT_OFFSET (30U)               
#define CIA_DIAG_1_ISOLATION_INDEX1_BIT_LEN  (2U)                
#define CIA_DIAG_1_ISOLATION_INDEX1_BIT_MASK 0xc0000000UL         
#define CIA_DIAG_1_CARRIERINT_BIT_OFFSET     (8U)                
#define CIA_DIAG_1_CARRIERINT_BIT_LEN        (21U)               
#define CIA_DIAG_1_CARRIERINT_BIT_MASK       0x1fffff00UL         
#define CIA_DIAG_1_RESAMPLERDELAY_BIT_OFFSET (0U)                
#define CIA_DIAG_1_RESAMPLERDELAY_BIT_LEN    (8U)                
#define CIA_DIAG_1_RESAMPLERDELAY_BIT_MASK   0xffU                

/******************************************************************************
* @brief Bit definitions for register IP_DIAG_0
**/
#define IP_DIAG_0_ID                         0xc0028              
#define IP_DIAG_0_LEN                        (4U)                
#define IP_DIAG_0_MASK                       0xFFFFFFFFUL        
#define IP_DIAG_0_PEAKLOC_BIT_OFFSET         (21U)               
#define IP_DIAG_0_PEAKLOC_BIT_LEN            (10U)               
#define IP_DIAG_0_PEAKLOC_BIT_MASK           0x7fe00000UL         
#define IP_DIAG_0_PEAKAMP_BIT_OFFSET         (0U)                
#define IP_DIAG_0_PEAKAMP_BIT_LEN            (21U)               
#define IP_DIAG_0_PEAKAMP_BIT_MASK           0x1fffffUL           

/******************************************************************************
* @brief Bit definitions for register IP_DIAG_1
**/
#define IP_DIAG_1_ID                         0xc002c              
#define IP_DIAG_1_LEN                        (4U)                
#define IP_DIAG_1_MASK                       0xFFFFFFFFUL        
#define IP_DIAG_1_IPCHANNELAREA_BIT_OFFSET   (0U)                
#define IP_DIAG_1_IPCHANNELAREA_BIT_LEN      (17U)               
#define IP_DIAG_1_IPCHANNELAREA_BIT_MASK     0x1ffffUL            

/******************************************************************************
* @brief Bit definitions for register IP_DIAG_2
**/
#define IP_DIAG_2_ID                         0xc0030              
#define IP_DIAG_2_LEN                        (4U)                
#define IP_DIAG_2_MASK                       0xFFFFFFFFUL        
#define IP_DIAG_2_IPF1_BIT_OFFSET            (0U)                
#define IP_DIAG_2_IPF1_BIT_LEN               (22U)               
#define IP_DIAG_2_IPF1_BIT_MASK              0x3fffffUL           

/******************************************************************************
* @brief Bit definitions for register IP_DIAG_3
**/
#define IP_DIAG_3_ID                         0xc0034              
#define IP_DIAG_3_LEN                        (4U)                
#define IP_DIAG_3_MASK                       0xFFFFFFFFUL        
#define IP_DIAG_3_IPF2_BIT_OFFSET            (0U)                
#define IP_DIAG_3_IPF2_BIT_LEN               (22U)               
#define IP_DIAG_3_IPF2_BIT_MASK              0x3fffffUL           

/******************************************************************************
* @brief Bit definitions for register IP_DIAG_4
**/
#define IP_DIAG_4_ID                         0xc0038              
#define IP_DIAG_4_LEN                        (4U)                
#define IP_DIAG_4_MASK                       0xFFFFFFFFUL        
#define IP_DIAG_4_IPF3_BIT_OFFSET            (0U)                
#define IP_DIAG_4_IPF3_BIT_LEN               (22U)               
#define IP_DIAG_4_IPF3_BIT_MASK              0x3fffffUL           

/******************************************************************************
* @brief Bit definitions for register IP_DIAG_5
**/
#define IP_DIAG_5_ID                         0xc003c              
#define IP_DIAG_5_LEN                        (4U)                
#define IP_DIAG_5_MASK                       0xFFFFFFFFUL        
#define IP_DIAG_5_NOISELOC_BIT_OFFSET        (22U)               
#define IP_DIAG_5_NOISELOC_BIT_LEN           (10U)               
#define IP_DIAG_5_NOISELOC_BIT_MASK          0xffc00000UL         
#define IP_DIAG_5_NOISEMAD_BIT_OFFSET        (0U)                
#define IP_DIAG_5_NOISEMAD_BIT_LEN           (22U)               
#define IP_DIAG_5_NOISEMAD_BIT_MASK          0x3fffffUL           

/******************************************************************************
* @brief Bit definitions for register IP_DIAG_6
**/
#define IP_DIAG_6_ID                         0xc0040              
#define IP_DIAG_6_LEN                        (4U)                
#define IP_DIAG_6_MASK                       0xFFFFFFFFUL        
#define IP_DIAG_6_IPMAXLOC_BIT_OFFSET        (22U)               
#define IP_DIAG_6_IPMAXLOC_BIT_LEN           (10U)               
#define IP_DIAG_6_IPMAXLOC_BIT_MASK          0xffc00000UL         
#define IP_DIAG_6_IPNOISEPEAK_BIT_OFFSET     (0U)                
#define IP_DIAG_6_IPNOISEPEAK_BIT_LEN        (22U)               
#define IP_DIAG_6_IPNOISEPEAK_BIT_MASK       0x3fffffUL           

/******************************************************************************
* @brief Bit definitions for register IP_DIAG_7
**/
#define IP_DIAG_7_ID                         0xc0044              
#define IP_DIAG_7_LEN                        (4U)                
#define IP_DIAG_7_MASK                       0xFFFFFFFFUL        
#define IP_DIAG_7_IPNOISEMEAN_BIT_OFFSET     (0U)                
#define IP_DIAG_7_IPNOISEMEAN_BIT_LEN        (22U)               
#define IP_DIAG_7_IPNOISEMEAN_BIT_MASK       0x3fffffUL           

/******************************************************************************
* @brief Bit definitions for register IP_DIAG_8
**/
#define IP_DIAG_8_ID                         0xc0048              
#define IP_DIAG_8_LEN                        (4U)                
#define IP_DIAG_8_MASK                       0xFFFFFFFFUL        
#define IP_DIAG_8_IPFPLOC_BIT_OFFSET         (0U)                
#define IP_DIAG_8_IPFPLOC_BIT_LEN            (16U)               
#define IP_DIAG_8_IPFPLOC_BIT_MASK           0xffffU              

