tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register IP_DIAG_9
**/
#define IP_DIAG_9_ID                         0xc004c              
#define IP_DIAG_9_LEN                        (4U)                
#define IP_DIAG_9_MASK                       0xFFFFFFFFUL        
#define IP_DIAG_9_IPFPCONFIDENCELEVEL_BIT_OFFSET (16U)               
#define IP_DIAG_9_IPFPCONFIDENCELEVEL_BIT_LEN (4U)                
#define IP_DIAG_9_IPFPCONFIDENCELEVEL_BIT_MASK 0xf0000UL            
#define IP_DIAG_9_IPEARLYFPLOC_BIT_OFFSET    (0U)                
#define IP_DIAG_9_IPEARLYFPLOC_BIT_LEN       (16U)               
#define IP_DIAG_9_IPEARLYFPLOC_BIT_MASK      0xffffU              

/******************************************************************************
* @brief Bit definitions for register IP_DIAG_10
**/
#define IP_DIAG_10_ID                        0xc0050              
#define IP_DIAG_10_LEN                       (4U)                
#define IP_DIAG_10_MASK                      0xFFFFFFFFUL        
#define IP_DIAG_10_IPCARRIERROTATION_BIT_OFFSET (14U)               
#define IP_DIAG_10_IPCARRIERROTATION_BIT_LEN (14U)               
#define IP_DIAG_10_IPCARRIERROTATION_BIT_MASK 0xfffc000UL          
#define IP_DIAG_10_IPFPANGLE_BIT_OFFSET      (0U)                
#define IP_DIAG_10_IPFPANGLE_BIT_LEN         (14U)               
#define IP_DIAG_10_IPFPANGLE_BIT_MASK        0x3fffU              

/******************************************************************************
* @brief Bit definitions for register IP_DIAG_11
**/
#define IP_DIAG_11_ID                        0xc0054              
#define IP_DIAG_11_LEN                       (4U)                
#define IP_DIAG_11_MASK                      0xFFFFFFFFUL        
#define IP_DIAG_11_IPTHRESHOLD_BIT_OFFSET    (0U)                
#define IP_DIAG_11_IPTHRESHOLD_BIT_LEN       (22U)               
#define IP_DIAG_11_IPTHRESHOLD_BIT_MASK      0x3fffffUL           

/******************************************************************************
* @brief Bit definitions for register IP_DIAG_12
**/
#define IP_DIAG_12_ID                        0xc0058              
#define IP_DIAG_12_LEN                       (4U)                
#define IP_DIAG_12_MASK                      0xFFFFFFFFUL        
#define IP_DIAG_12_IPNACC_BIT_OFFSET         (0U)                
#define IP_DIAG_12_IPNACC_BIT_LEN            (12U)               
#define IP_DIAG_12_IPNACC_BIT_MASK           0xfffU               

/******************************************************************************
* @brief Bit definitions for register CY0_DIAG_0
**/
#define CY0_DIAG_0_ID                        0xc005c              
#define CY0_DIAG_0_LEN                       (4U)                
#define CY0_DIAG_0_MASK                      0xFFFFFFFFUL        
#define CY0_DIAG_0_PEAKLOC_BIT_OFFSET        (21U)               
#define CY0_DIAG_0_PEAKLOC_BIT_LEN           (9U)                
#define CY0_DIAG_0_PEAKLOC_BIT_MASK          0x3fe00000UL         
#define CY0_DIAG_0_PEAKAMP_BIT_OFFSET        (0U)                
#define CY0_DIAG_0_PEAKAMP_BIT_LEN           (21U)               
#define CY0_DIAG_0_PEAKAMP_BIT_MASK          0x1fffffUL           

/******************************************************************************
* @brief Bit definitions for register CY0_DIAG_1
**/
#define CY0_DIAG_1_ID                        0xc0060              
#define CY0_DIAG_1_LEN                       (4U)                
#define CY0_DIAG_1_MASK                      0xFFFFFFFFUL        
#define CY0_DIAG_1_CY0CHANNELAREA_BIT_OFFSET (0U)                
#define CY0_DIAG_1_CY0CHANNELAREA_BIT_LEN    (16U)               
#define CY0_DIAG_1_CY0CHANNELAREA_BIT_MASK   0xffffU              

/******************************************************************************
* @brief Bit definitions for register CY0_DIAG_2
**/
#define CY0_DIAG_2_ID                        0xc0064              
#define CY0_DIAG_2_LEN                       (4U)                
#define CY0_DIAG_2_MASK                      0xFFFFFFFFUL        
#define CY0_DIAG_2_CY0F1_BIT_OFFSET          (0U)                
#define CY0_DIAG_2_CY0F1_BIT_LEN             (22U)               
#define CY0_DIAG_2_CY0F1_BIT_MASK            0x3fffffUL           

/******************************************************************************
* @brief Bit definitions for register CY0_DIAG_3
**/
#define CY0_DIAG_3_ID                        0xc0068              
#define CY0_DIAG_3_LEN                       (4U)                
#define CY0_DIAG_3_MASK                      0xFFFFFFFFUL        
#define CY0_DIAG_3_CY0F2_BIT_OFFSET          (0U)                
#define CY0_DIAG_3_CY0F2_BIT_LEN             (22U)               
#define CY0_DIAG_3_CY0F2_BIT_MASK            0x3fffffUL           

/******************************************************************************
* @brief Bit definitions for register CY0_DIAG_4
**/
#define CY0_DIAG_4_ID                        0xd0000              
#define CY0_DIAG_4_LEN                       (4U)                
#define CY0_DIAG_4_MASK                      0xFFFFFFFFUL        
#define CY0_DIAG_4_CY0F3_BIT_OFFSET          (0U)                
#define CY0_DIAG_4_CY0F3_BIT_LEN             (22U)               
#define CY0_DIAG_4_CY0F3_BIT_MASK            0x3fffffUL           

/******************************************************************************
* @brief Bit definitions for register CY0_DIAG_5
**/
#define CY0_DIAG_5_ID                        0xd0004              
#define CY0_DIAG_5_LEN                       (4U)                
#define CY0_DIAG_5_MASK                      0xFFFFFFFFUL        
#define CY0_DIAG_5_CY0NOISEMAD_BIT_OFFSET    (0U)                
#define CY0_DIAG_5_CY0NOISEMAD_BIT_LEN       (22U)               
#define CY0_DIAG_5_CY0NOISEMAD_BIT_MASK      0x3fffffUL           

/******************************************************************************
* @brief Bit definitions for register CY0_DIAG_6
**/
#define CY0_DIAG_6_ID                        0xd0008              
#define CY0_DIAG_6_LEN                       (4U)                
#define CY0_DIAG_6_MASK                      0xFFFFFFFFUL        
#define CY0_DIAG_6_CY0MAXLOC_BIT_OFFSET      (22U)               
#define CY0_DIAG_6_CY0MAXLOC_BIT_LEN         (9U)                
#define CY0_DIAG_6_CY0MAXLOC_BIT_MASK        0x7fc00000UL         
#define CY0_DIAG_6_CY0NOISEPEAK_BIT_OFFSET   (0U)                
#define CY0_DIAG_6_CY0NOISEPEAK_BIT_LEN      (22U)               
#define CY0_DIAG_6_CY0NOISEPEAK_BIT_MASK     0x3fffffUL           

