tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register CY0_DIAG_7
**/
#define CY0_DIAG_7_ID                        0xd000c              
#define CY0_DIAG_7_LEN                       (4U)                
#define CY0_DIAG_7_MASK                      0xFFFFFFFFUL        
#define CY0_DIAG_7_CY0NOISEMEAN_BIT_OFFSET   (0U)                
#define CY0_DIAG_7_CY0NOISEMEAN_BIT_LEN      (22U)               
#define CY0_DIAG_7_CY0NOISEMEAN_BIT_MASK     0x3fffffUL           

/******************************************************************************
* @brief Bit definitions for register CY0_DIAG_8
**/
#define CY0_DIAG_8_ID                        0xd0010              
#define CY0_DIAG_8_LEN                       (4U)                
#define CY0_DIAG_8_MASK                      0xFFFFFFFFUL        
#define CY0_DIAG_8_CY0FPLOC_BIT_OFFSET       (0U)                
#define CY0_DIAG_8_CY0FPLOC_BIT_LEN          (15U)               
#define CY0_DIAG_8_CY0FPLOC_BIT_MASK         0x7fffU              

/******************************************************************************
* @brief Bit definitions for register CY0_DIAG_9
**/
#define CY0_DIAG_9_ID                        0xd0014              
#define CY0_DIAG_9_LEN                       (4U)                
#define CY0_DIAG_9_MASK                      0xFFFFFFFFUL        
#define CY0_DIAG_9_CY0FPCONFIDENCELEVEL_BIT_OFFSET (16U)               
#define CY0_DIAG_9_CY0FPCONFIDENCELEVEL_BIT_LEN (4U)                
#define CY0_DIAG_9_CY0FPCONFIDENCELEVEL_BIT_MASK 0xf0000UL            
#define CY0_DIAG_9_CY0EARLYFPLOC_BIT_OFFSET  (0U)                
#define CY0_DIAG_9_CY0EARLYFPLOC_BIT_LEN     (15U)               
#define CY0_DIAG_9_CY0EARLYFPLOC_BIT_MASK    0x7fffU              

/******************************************************************************
* @brief Bit definitions for register CY0_DIAG_10
**/
#define CY0_DIAG_10_ID                       0xd0018              
#define CY0_DIAG_10_LEN                      (4U)                
#define CY0_DIAG_10_MASK                     0xFFFFFFFFUL        
#define CY0_DIAG_10_CY0CARRIERROTATION_BIT_OFFSET (14U)               
#define CY0_DIAG_10_CY0CARRIERROTATION_BIT_LEN (14U)               
#define CY0_DIAG_10_CY0CARRIERROTATION_BIT_MASK 0xfffc000UL          
#define CY0_DIAG_10_CY0FPANGLE_BIT_OFFSET    (0U)                
#define CY0_DIAG_10_CY0FPANGLE_BIT_LEN       (14U)               
#define CY0_DIAG_10_CY0FPANGLE_BIT_MASK      0x3fffU              

/******************************************************************************
* @brief Bit definitions for register CY0_DIAG_11
**/
#define CY0_DIAG_11_ID                       0xd001c              
#define CY0_DIAG_11_LEN                      (4U)                
#define CY0_DIAG_11_MASK                     0xFFFFFFFFUL        
#define CY0_DIAG_11_CY0THRESHOLD_BIT_OFFSET  (0U)                
#define CY0_DIAG_11_CY0THRESHOLD_BIT_LEN     (22U)               
#define CY0_DIAG_11_CY0THRESHOLD_BIT_MASK    0x3fffffUL           

/******************************************************************************
* @brief Bit definitions for register CY0_DIAG_12
**/
#define CY0_DIAG_12_ID                       0xd0020              
#define CY0_DIAG_12_LEN                      (4U)                
#define CY0_DIAG_12_MASK                     0xFFFFFFFFUL        
#define CY0_DIAG_12_SFDPHASECOUNT_BIT_OFFSET (0U)                
#define CY0_DIAG_12_SFDPHASECOUNT_BIT_LEN    (1U)                
#define CY0_DIAG_12_SFDPHASECOUNT_BIT_MASK   0x1U                 
#define CY0_DIAG_12_CYNACC_BIT_OFFSET        (0U)                
#define CY0_DIAG_12_CYNACC_BIT_LEN           (12U)               
#define CY0_DIAG_12_CYNACC_BIT_MASK          0xfffU               

#define CY0_DIAG_13_ID                       0xd0024    
#define CY0_DIAG_14_ID                       0xd0028    
#define CY0_DIAG_15_ID                       0xd002C    
#define CY0_DIAG_16_ID                       0xd0030    
#define CY0_DIAG_17_ID                       0xd0034    

/******************************************************************************
* @brief Bit definitions for register CY1_DIAG_0
**/
#define CY1_DIAG_0_ID                        0xd0038              
#define CY1_DIAG_0_LEN                       (4U)                
#define CY1_DIAG_0_MASK                      0xFFFFFFFFUL        
#define CY1_DIAG_0_PEAKLOC_BIT_OFFSET        (21U)               
#define CY1_DIAG_0_PEAKLOC_BIT_LEN           (9U)                
#define CY1_DIAG_0_PEAKLOC_BIT_MASK          0x3fe00000UL         
#define CY1_DIAG_0_PEAKAMP_BIT_OFFSET        (0U)                
#define CY1_DIAG_0_PEAKAMP_BIT_LEN           (21U)               
#define CY1_DIAG_0_PEAKAMP_BIT_MASK          0x1fffffUL           

/******************************************************************************
* @brief Bit definitions for register CY1_DIAG_1
**/
#define CY1_DIAG_1_ID                        0xd003c              
#define CY1_DIAG_1_LEN                       (4U)                
#define CY1_DIAG_1_MASK                      0xFFFFFFFFUL        
#define CY1_DIAG_1_CY1CHANNELAREA_BIT_OFFSET (0U)                
#define CY1_DIAG_1_CY1CHANNELAREA_BIT_LEN    (16U)               
#define CY1_DIAG_1_CY1CHANNELAREA_BIT_MASK   0xffffU              

/******************************************************************************
* @brief Bit definitions for register CY1_DIAG_2
**/
#define CY1_DIAG_2_ID                        0xd0040              
#define CY1_DIAG_2_LEN                       (4U)                
#define CY1_DIAG_2_MASK                      0xFFFFFFFFUL        
#define CY1_DIAG_2_CY1F1_BIT_OFFSET          (0U)                
#define CY1_DIAG_2_CY1F1_BIT_LEN             (22U)               
#define CY1_DIAG_2_CY1F1_BIT_MASK            0x3fffffUL           

/******************************************************************************
* @brief Bit definitions for register CY1_DIAG_3
**/
#define CY1_DIAG_3_ID                        0xd0044              
#define CY1_DIAG_3_LEN                       (4U)                
#define CY1_DIAG_3_MASK                      0xFFFFFFFFUL        
#define CY1_DIAG_3_CY1F2_BIT_OFFSET          (0U)                
#define CY1_DIAG_3_CY1F2_BIT_LEN             (22U)               
#define CY1_DIAG_3_CY1F2_BIT_MASK            0x3fffffUL           

