tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register CY1_DIAG_4
**/
#define CY1_DIAG_4_ID                        0xd0048              
#define CY1_DIAG_4_LEN                       (4U)                
#define CY1_DIAG_4_MASK                      0xFFFFFFFFUL        
#define CY1_DIAG_4_CY1F3_BIT_OFFSET          (0U)                
#define CY1_DIAG_4_CY1F3_BIT_LEN             (22U)               
#define CY1_DIAG_4_CY1F3_BIT_MASK            0x3fffffUL           

/******************************************************************************
* @brief Bit definitions for register CY1_DIAG_5
**/
#define CY1_DIAG_5_ID                        0xd004c              
#define CY1_DIAG_5_LEN                       (4U)                
#define CY1_DIAG_5_MASK                      0xFFFFFFFFUL        
#define CY1_DIAG_5_CY1NOISEMAD_BIT_OFFSET    (0U)                
#define CY1_DIAG_5_CY1NOISEMAD_BIT_LEN       (22U)               
#define CY1_DIAG_5_CY1NOISEMAD_BIT_MASK      0x3fffffUL           

/******************************************************************************
* @brief Bit definitions for register CY1_DIAG_6
**/
#define CY1_DIAG_6_ID                        0xd0050              
#define CY1_DIAG_6_LEN                       (4U)                
#define CY1_DIAG_6_MASK                      0xFFFFFFFFUL        
#define CY1_DIAG_6_CY1MAXLOC_BIT_OFFSET      (22U)               
#define CY1_DIAG_6_CY1MAXLOC_BIT_LEN         (9U)                
#define CY1_DIAG_6_CY1MAXLOC_BIT_MASK        0x7fc00000UL         
#define CY1_DIAG_6_CY1NOISEPEAK_BIT_OFFSET   (0U)                
#define CY1_DIAG_6_CY1NOISEPEAK_BIT_LEN      (22U)               
#define CY1_DIAG_6_CY1NOISEPEAK_BIT_MASK     0x3fffffUL           

/******************************************************************************
* @brief Bit definitions for register CY1_DIAG_7
**/
#define CY1_DIAG_7_ID                        0xd0054              
#define CY1_DIAG_7_LEN                       (4U)                
#define CY1_DIAG_7_MASK                      0xFFFFFFFFUL        
#define CY1_DIAG_7_CY1NOISEMEAN_BIT_OFFSET   (0U)                
#define CY1_DIAG_7_CY1NOISEMEAN_BIT_LEN      (22U)               
#define CY1_DIAG_7_CY1NOISEMEAN_BIT_MASK     0x3fffffUL           

/******************************************************************************
* @brief Bit definitions for register CY1_DIAG_8
**/
#define CY1_DIAG_8_ID                        0xd0058              
#define CY1_DIAG_8_LEN                       (4U)                
#define CY1_DIAG_8_MASK                      0xFFFFFFFFUL        
#define CY1_DIAG_8_CY1FPLOC_BIT_OFFSET       (0U)                
#define CY1_DIAG_8_CY1FPLOC_BIT_LEN          (15U)               
#define CY1_DIAG_8_CY1FPLOC_BIT_MASK         0x7fffU              

/******************************************************************************
* @brief Bit definitions for register CY1_DIAG_9
**/
#define CY1_DIAG_9_ID                        0xd005c              
#define CY1_DIAG_9_LEN                       (4U)                
#define CY1_DIAG_9_MASK                      0xFFFFFFFFUL        
#define CY1_DIAG_9_CY1FPCONFIDENCELEVEL_BIT_OFFSET (16U)               
#define CY1_DIAG_9_CY1FPCONFIDENCELEVEL_BIT_LEN (4U)                
#define CY1_DIAG_9_CY1FPCONFIDENCELEVEL_BIT_MASK 0xf0000UL            
#define CY1_DIAG_9_CY1EARLYFPLOC_BIT_OFFSET  (0U)                
#define CY1_DIAG_9_CY1EARLYFPLOC_BIT_LEN     (15U)               
#define CY1_DIAG_9_CY1EARLYFPLOC_BIT_MASK    0x7fffU              

/******************************************************************************
* @brief Bit definitions for register CY1_DIAG_10
**/
#define CY1_DIAG_10_ID                       0xd0060              
#define CY1_DIAG_10_LEN                      (4U)                
#define CY1_DIAG_10_MASK                     0xFFFFFFFFUL        
#define CY1_DIAG_10_CY1FPANGLE_BIT_OFFSET    (0U)                
#define CY1_DIAG_10_CY1FPANGLE_BIT_LEN       (14U)               
#define CY1_DIAG_10_CY1FPANGLE_BIT_MASK      0x3fffU              

/******************************************************************************
* @brief Bit definitions for register CY1_DIAG_11
**/
#define CY1_DIAG_11_ID                       0xd0064              
#define CY1_DIAG_11_LEN                      (4U)                
#define CY1_DIAG_11_MASK                     0xFFFFFFFFUL        
#define CY1_DIAG_11_CY1THRESHOLD_BIT_OFFSET  (0U)                
#define CY1_DIAG_11_CY1THRESHOLD_BIT_LEN     (22U)               
#define CY1_DIAG_11_CY1THRESHOLD_BIT_MASK    0x3fffffUL           

/******************************************************************************
* @brief Bit definitions for register CY1_DIAG_12
**/
#define CY1_DIAG_12_ID                       0xd0068              
#define CY1_DIAG_12_LEN                      (4U)                
#define CY1_DIAG_12_MASK                     0xFFFFFFFFUL        
#define CY1_DIAG_12_CY1NACC_BIT_OFFSET       (0U)                
#define CY1_DIAG_12_CY1NACC_BIT_LEN          (12U)               
#define CY1_DIAG_12_CY1NACC_BIT_MASK         0xfffU               

/******************************************************************************
* @brief Bit definitions for register RX_ANTENNA_DELAY
**/
#define RX_ANTENNA_DELAY_ID                  0xe0000              
#define RX_ANTENNA_DELAY_LEN                 (4U)                
#define RX_ANTENNA_DELAY_MASK                0xFFFFFFFFUL        
#define RX_ANTENNA_DELAY_MINDIAG_BIT_OFFSET  (20U)               
#define RX_ANTENNA_DELAY_MINDIAG_BIT_LEN     (1U)                
#define RX_ANTENNA_DELAY_MINDIAG_BIT_MASK    0x100000UL           
#define RX_ANTENNA_DELAY_REWINDOWLIMIT_BIT_OFFSET (0U)                
#define RX_ANTENNA_DELAY_REWINDOWLIMIT_BIT_LEN (1U)                
#define RX_ANTENNA_DELAY_REWINDOWLIMIT_BIT_MASK 0x1U                 
#define RX_ANTENNA_DELAY_RXANTENNADELAY_BIT_OFFSET (0U)                
#define RX_ANTENNA_DELAY_RXANTENNADELAY_BIT_LEN (16U)               
#define RX_ANTENNA_DELAY_RXANTENNADELAY_BIT_MASK 0xffffU              

