tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register FP_CONFIDENCE_LIMIT
**/
#define FP_CONFIDENCE_LIMIT_ID               0xe0004              
#define FP_CONFIDENCE_LIMIT_LEN              (4U)                
#define FP_CONFIDENCE_LIMIT_MASK             0xFFFFFFFFUL        
#define FP_CONFIDENCE_LIMIT_TEMPERATURE_DIFFERENCE_BIT_OFFSET (22U)               
#define FP_CONFIDENCE_LIMIT_TEMPERATURE_DIFFERENCE_BIT_LEN (10U)               
#define FP_CONFIDENCE_LIMIT_TEMPERATURE_DIFFERENCE_BIT_MASK 0xffc00000UL         
#define FP_CONFIDENCE_LIMIT_ACCUMULATOR_ANALYSIS_EN_BIT_OFFSET (21U)               
#define FP_CONFIDENCE_LIMIT_ACCUMULATOR_ANALYSIS_EN_BIT_LEN (1U)                
#define FP_CONFIDENCE_LIMIT_ACCUMULATOR_ANALYSIS_EN_BIT_MASK 0x200000UL           
#define FP_CONFIDENCE_LIMIT_TEMP_DELAY_COMPENSATION_EN_BIT_OFFSET (20U)               
#define FP_CONFIDENCE_LIMIT_TEMP_DELAY_COMPENSATION_EN_BIT_LEN (1U)                
#define FP_CONFIDENCE_LIMIT_TEMP_DELAY_COMPENSATION_EN_BIT_MASK 0x100000UL           
#define FP_CONFIDENCE_LIMIT_ARX_DELAY_COMPENSATION_EN_BIT_OFFSET (19U)               
#define FP_CONFIDENCE_LIMIT_ARX_DELAY_COMPENSATION_EN_BIT_LEN (1U)                
#define FP_CONFIDENCE_LIMIT_ARX_DELAY_COMPENSATION_EN_BIT_MASK 0x80000UL            
#define FP_CONFIDENCE_LIMIT_CAL_TEMPERATURE_BIT_OFFSET (11U)               
#define FP_CONFIDENCE_LIMIT_CAL_TEMPERATURE_BIT_LEN (8U)                
#define FP_CONFIDENCE_LIMIT_CAL_TEMPERATURE_BIT_MASK 0x7f800UL            
#define FP_CONFIDENCE_LIMIT_FP_AGREED_THRESHOLD_BIT_OFFSET (8U)                
#define FP_CONFIDENCE_LIMIT_FP_AGREED_THRESHOLD_BIT_LEN (3U)                
#define FP_CONFIDENCE_LIMIT_FP_AGREED_THRESHOLD_BIT_MASK 0x700U               
#define FP_CONFIDENCE_LIMIT_ARX_DELAY_TABLE_ENTRY_BIT_OFFSET (5U)                
#define FP_CONFIDENCE_LIMIT_ARX_DELAY_TABLE_ENTRY_BIT_LEN (3U)                
#define FP_CONFIDENCE_LIMIT_ARX_DELAY_TABLE_ENTRY_BIT_MASK 0xe0U                
#define FP_CONFIDENCE_LIMIT_FP_CONFIDENCE_LIM_BIT_OFFSET (0U)                
#define FP_CONFIDENCE_LIMIT_FP_CONFIDENCE_LIM_BIT_LEN (5U)                
#define FP_CONFIDENCE_LIMIT_FP_CONFIDENCE_LIM_BIT_MASK 0x1fU                

/******************************************************************************
* @brief Bit definitions for register FP_CONFIDENCE_THRESHOLDS
**/
#define FP_CONFIDENCE_THRESHOLDS_ID          0xe0008              
#define FP_CONFIDENCE_THRESHOLDS_LEN         (4U)                
#define FP_CONFIDENCE_THRESHOLDS_MASK        0xFFFFFFFFUL        
#define FP_CONFIDENCE_THRESHOLDS_IPATOV_FP_CONF_THRES_BIT_OFFSET (8U)                
#define FP_CONFIDENCE_THRESHOLDS_IPATOV_FP_CONF_THRES_BIT_LEN (5U)                
#define FP_CONFIDENCE_THRESHOLDS_IPATOV_FP_CONF_THRES_BIT_MASK 0x1f00U              
#define FP_CONFIDENCE_THRESHOLDS_CYPHER_FP_CONF_THRES_BIT_OFFSET (0U)                
#define FP_CONFIDENCE_THRESHOLDS_CYPHER_FP_CONF_THRES_BIT_LEN (5U)                
#define FP_CONFIDENCE_THRESHOLDS_CYPHER_FP_CONF_THRES_BIT_MASK 0x1fU                

/******************************************************************************
* @brief Bit definitions for register IP_CONFIG_LO
**/
#define IP_CONFIG_LO_ID                      0xe000c              
#define IP_CONFIG_LO_LEN                     (2U)                
#define IP_CONFIG_LO_MASK                    0xFFFFU             
#define IP_CONFIG_LO_MANUALIGNOREWINDOW_BIT_OFFSET (12U)               
#define IP_CONFIG_LO_MANUALIGNOREWINDOW_BIT_LEN (1U)                
#define IP_CONFIG_LO_MANUALIGNOREWINDOW_BIT_MASK 0x1000U              
#define IP_CONFIG_LO_REWINDOW_BIT_OFFSET     (11U)               
#define IP_CONFIG_LO_REWINDOW_BIT_LEN        (1U)                
#define IP_CONFIG_LO_REWINDOW_BIT_MASK       0x800U               
#define IP_CONFIG_LO_EARLYSEARCH_BIT_OFFSET  (10U)               
#define IP_CONFIG_LO_EARLYSEARCH_BIT_LEN     (1U)                
#define IP_CONFIG_LO_EARLYSEARCH_BIT_MASK    0x400U               
#define IP_CONFIG_LO_DCOFFSETREMOVAL_BIT_OFFSET (9U)                
#define IP_CONFIG_LO_DCOFFSETREMOVAL_BIT_LEN (1U)                
#define IP_CONFIG_LO_DCOFFSETREMOVAL_BIT_MASK 0x200U               
#define IP_CONFIG_LO_IPNOISELENGTH_BIT_OFFSET (7U)                
#define IP_CONFIG_LO_IPNOISELENGTH_BIT_LEN   (2U)                
#define IP_CONFIG_LO_IPNOISELENGTH_BIT_MASK  0x180U               
#define IP_CONFIG_LO_PEAKMULTIPLIER_BIT_OFFSET (5U)                
#define IP_CONFIG_LO_PEAKMULTIPLIER_BIT_LEN  (2U)                
#define IP_CONFIG_LO_PEAKMULTIPLIER_BIT_MASK 0x60U                
#define IP_CONFIG_LO_NOISETHRESHOLDMULTIPLIER_BIT_OFFSET (0U)                
#define IP_CONFIG_LO_NOISETHRESHOLDMULTIPLIER_BIT_LEN (5U)                
#define IP_CONFIG_LO_NOISETHRESHOLDMULTIPLIER_BIT_MASK 0x1fU                

/******************************************************************************
* @brief Bit definitions for register IP_CONFIG_HI
**/
#define IP_CONFIG_HI_ID                      0xe000e              /*  { aliased = true}  */
#define IP_CONFIG_HI_LEN                     (4U)
#define IP_CONFIG_HI_MASK                    0xFFFFFFFFUL
#define IP_CONFIG_HI_IGNOREWINDOW_BIT_OFFSET (22U)
#define IP_CONFIG_HI_IGNOREWINDOW_BIT_LEN    (9U)
#define IP_CONFIG_HI_IGNOREWINDOW_BIT_MASK   0x7fc00000UL
#define IP_CONFIG_HI_OVERRIDEREPLICACOEFFICIENT_BIT_OFFSET (6U)
#define IP_CONFIG_HI_OVERRIDEREPLICACOEFFICIENT_BIT_LEN (16U)
#define IP_CONFIG_HI_OVERRIDEREPLICACOEFFICIENT_BIT_MASK 0x3fffc0UL
#define IP_CONFIG_HI_USEOVERRIDEREPLICACOEFFICIENT_BIT_OFFSET (5U)
#define IP_CONFIG_HI_USEOVERRIDEREPLICACOEFFICIENT_BIT_LEN (1U)
#define IP_CONFIG_HI_USEOVERRIDEREPLICACOEFFICIENT_BIT_MASK 0x20U
#define IP_CONFIG_HI_REPLICATHRESHOLDMULTIPLIER_BIT_OFFSET (0U)
#define IP_CONFIG_HI_REPLICATHRESHOLDMULTIPLIER_BIT_LEN (5U)
#define IP_CONFIG_HI_REPLICATHRESHOLDMULTIPLIER_BIT_MASK 0x1fU

/******************************************************************************
* @brief Bit definitions for register CY_CONFIG_LO
**/
#define CY_CONFIG_LO_ID                      0xe0012              /*  { aliased = true}  */
#define CY_CONFIG_LO_LEN                     (4U)
#define CY_CONFIG_LO_MASK                    0xFFFFFFFFUL
#define CY_CONFIG_LO_MANUALLOWERBOUND_BIT_OFFSET (16U)
#define CY_CONFIG_LO_MANUALLOWERBOUND_BIT_LEN (7U)
#define CY_CONFIG_LO_MANUALLOWERBOUND_BIT_MASK 0x7f0000UL
#define CY_CONFIG_LO_CYIGNOREWINDOW_BIT_OFFSET (11U)
#define CY_CONFIG_LO_CYIGNOREWINDOW_BIT_LEN  (4U)
#define CY_CONFIG_LO_CYIGNOREWINDOW_BIT_MASK 0x7800U
#define CY_CONFIG_LO_REWINDOW_BIT_OFFSET     (10U)
#define CY_CONFIG_LO_REWINDOW_BIT_LEN        (1U)
#define CY_CONFIG_LO_REWINDOW_BIT_MASK       0x400U
#define CY_CONFIG_LO_EARLYSEARCH_BIT_OFFSET  (9U)
#define CY_CONFIG_LO_EARLYSEARCH_BIT_LEN     (1U)
#define CY_CONFIG_LO_EARLYSEARCH_BIT_MASK    0x200U
#define CY_CONFIG_LO_DCOFFSETREMOVAL_BIT_OFFSET (8U)
#define CY_CONFIG_LO_DCOFFSETREMOVAL_BIT_LEN (1U)
#define CY_CONFIG_LO_DCOFFSETREMOVAL_BIT_MASK 0x100U
#define CY_CONFIG_LO_CYNOISELENGTH_BIT_OFFSET (7U)
#define CY_CONFIG_LO_CYNOISELENGTH_BIT_LEN   (1U)
#define CY_CONFIG_LO_CYNOISELENGTH_BIT_MASK  0x80U
#define CY_CONFIG_LO_PEAKMULTIPLIER_BIT_OFFSET (5U)
#define CY_CONFIG_LO_PEAKMULTIPLIER_BIT_LEN  (2U)
#define CY_CONFIG_LO_PEAKMULTIPLIER_BIT_MASK 0x60U
#define CY_CONFIG_LO_NOISETHRESHOLDMULTIPLIER_BIT_OFFSET (0U)
#define CY_CONFIG_LO_NOISETHRESHOLDMULTIPLIER_BIT_LEN (5U)
#define CY_CONFIG_LO_NOISETHRESHOLDMULTIPLIER_BIT_MASK 0x1fU

