tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register CY_CONFIG_HI
**/
#define CY_CONFIG_HI_ID                      0xe0016              /*  { aliased = true}  */
#define CY_CONFIG_HI_LEN                     (4U)
#define CY_CONFIG_HI_MASK                    0xFFFFFFFFUL
#define CY_CONFIG_HI_PEAK_GROWTH_EN_BIT_OFFSET (31U)
#define CY_CONFIG_HI_PEAK_GROWTH_EN_BIT_LEN  (1U)
#define CY_CONFIG_HI_PEAK_GROWTH_EN_BIT_MASK 0x80000000UL
#define CY_CONFIG_HI_ADC_COUNT_EN_BIT_OFFSET (30U)
#define CY_CONFIG_HI_ADC_COUNT_EN_BIT_LEN    (1U)
#define CY_CONFIG_HI_ADC_COUNT_EN_BIT_MASK   0x40000000UL
#define CY_CONFIG_HI_SFD_COUNT_EN_BIT_OFFSET (29U)
#define CY_CONFIG_HI_SFD_COUNT_EN_BIT_LEN    (1U)
#define CY_CONFIG_HI_SFD_COUNT_EN_BIT_MASK   0x20000000UL
#define CY_CONFIG_HI_FP_AGREED_EN_BIT_OFFSET (28U)
#define CY_CONFIG_HI_FP_AGREED_EN_BIT_LEN    (1U)
#define CY_CONFIG_HI_FP_AGREED_EN_BIT_MASK   0x10000000UL
#define CY_CONFIG_HI_LOGISTIC_REGRESSION_EN_BIT_OFFSET (27U)
#define CY_CONFIG_HI_LOGISTIC_REGRESSION_EN_BIT_LEN (1U)
#define CY_CONFIG_HI_LOGISTIC_REGRESSION_EN_BIT_MASK 0x8000000UL
#define CY_CONFIG_HI_PEAKGROWTHHIGHTHRESHOLD_BIT_OFFSET (17U)
#define CY_CONFIG_HI_PEAKGROWTHHIGHTHRESHOLD_BIT_LEN (5U)
#define CY_CONFIG_HI_PEAKGROWTHHIGHTHRESHOLD_BIT_MASK 0x3e0000UL
#define CY_CONFIG_HI_PEAKGROWTHLOWTHRESHOLD_BIT_OFFSET (12U)
#define CY_CONFIG_HI_PEAKGROWTHLOWTHRESHOLD_BIT_LEN (5U)
#define CY_CONFIG_HI_PEAKGROWTHLOWTHRESHOLD_BIT_MASK 0x1f000UL
#define CY_CONFIG_HI_ADCCOUNTHIGHTHRESHOLD_BIT_OFFSET (8U)
#define CY_CONFIG_HI_ADCCOUNTHIGHTHRESHOLD_BIT_LEN (4U)
#define CY_CONFIG_HI_ADCCOUNTHIGHTHRESHOLD_BIT_MASK 0xf00U
#define CY_CONFIG_HI_ADCCOUNTLOWTHRESHOLD_BIT_OFFSET (4U)
#define CY_CONFIG_HI_ADCCOUNTLOWTHRESHOLD_BIT_LEN (4U)
#define CY_CONFIG_HI_ADCCOUNTLOWTHRESHOLD_BIT_MASK 0xf0U
#define CY_CONFIG_HI_SFDCOUNTTHRESHOLD_BIT_OFFSET (0U)
#define CY_CONFIG_HI_SFDCOUNTTHRESHOLD_BIT_LEN (4U)
#define CY_CONFIG_HI_SFDCOUNTTHRESHOLD_BIT_MASK 0xfU

/******************************************************************************
* @brief Bit definitions for register CIA_COEFFICIENT_ADJUST
**/
#define CIA_COEFFICIENT_ADJUST_ID            0xe001a              /* {aliased=true} */
#define CIA_COEFFICIENT_ADJUST_LEN           (4U)
#define CIA_COEFFICIENT_ADJUST_MASK          0xFFFFFFFFUL
#define CIA_COEFFICIENT_ADJUST_PDOA_ISOLATION_SCALING_BIT_OFFSET (24U)
#define CIA_COEFFICIENT_ADJUST_PDOA_ISOLATION_SCALING_BIT_LEN (4U)
#define CIA_COEFFICIENT_ADJUST_PDOA_ISOLATION_SCALING_BIT_MASK 0xf000000UL
#define CIA_COEFFICIENT_ADJUST_TEMP_CORRECTION_COEFF_BIT_OFFSET (16U)
#define CIA_COEFFICIENT_ADJUST_TEMP_CORRECTION_COEFF_BIT_LEN (7U)
#define CIA_COEFFICIENT_ADJUST_TEMP_CORRECTION_COEFF_BIT_MASK 0x7f0000UL
#define CIA_COEFFICIENT_ADJUST_PDOA_ADJUST_OFFSET_BIT_OFFSET (0U)
#define CIA_COEFFICIENT_ADJUST_PDOA_ADJUST_OFFSET_BIT_LEN (14U)
#define CIA_COEFFICIENT_ADJUST_PDOA_ADJUST_OFFSET_BIT_MASK 0x3fffU

/******************************************************************************
* @brief Bit definitions for register PGF_DELAY_COMP_LO
**/
#define PGF_DELAY_COMP_LO_ID                 0xe001e              /* {aliased=true} */
#define PGF_DELAY_COMP_LO_LEN                (4U)
#define PGF_DELAY_COMP_LO_MASK               0xFFFFFFFFUL
#define PGF_DELAY_COMP_LO_PGF_DELAY_OFFSET3_BIT_OFFSET (24U)
#define PGF_DELAY_COMP_LO_PGF_DELAY_OFFSET3_BIT_LEN (6U)
#define PGF_DELAY_COMP_LO_PGF_DELAY_OFFSET3_BIT_MASK 0x3f000000UL
#define PGF_DELAY_COMP_LO_PGF_DELAY_OFFSET2_BIT_OFFSET (16U)
#define PGF_DELAY_COMP_LO_PGF_DELAY_OFFSET2_BIT_LEN (6U)
#define PGF_DELAY_COMP_LO_PGF_DELAY_OFFSET2_BIT_MASK 0x3f0000UL
#define PGF_DELAY_COMP_LO_PGF_DELAY_OFFSET1_BIT_OFFSET (8U)
#define PGF_DELAY_COMP_LO_PGF_DELAY_OFFSET1_BIT_LEN (6U)
#define PGF_DELAY_COMP_LO_PGF_DELAY_OFFSET1_BIT_MASK 0x3f00U
#define PGF_DELAY_COMP_LO_PGF_DELAY_OFFSET0_BIT_OFFSET (0U)
#define PGF_DELAY_COMP_LO_PGF_DELAY_OFFSET0_BIT_LEN (6U)
#define PGF_DELAY_COMP_LO_PGF_DELAY_OFFSET0_BIT_MASK 0x3fU

/******************************************************************************
* @brief Bit definitions for register PGF_DELAY_COMP_HI
**/
#define PGF_DELAY_COMP_HI_ID                 0xe0022              /* {aliased=true} */
#define PGF_DELAY_COMP_HI_LEN                (4U)
#define PGF_DELAY_COMP_HI_MASK               0xFFFFFFFFUL
#define PGF_DELAY_COMP_HI_PGF_DELAY_OFFSET6_BIT_OFFSET (16U)
#define PGF_DELAY_COMP_HI_PGF_DELAY_OFFSET6_BIT_LEN (6U)
#define PGF_DELAY_COMP_HI_PGF_DELAY_OFFSET6_BIT_MASK 0x3f0000UL
#define PGF_DELAY_COMP_HI_PGF_DELAY_OFFSET5_BIT_OFFSET (8U)
#define PGF_DELAY_COMP_HI_PGF_DELAY_OFFSET5_BIT_LEN (6U)
#define PGF_DELAY_COMP_HI_PGF_DELAY_OFFSET5_BIT_MASK 0x3f00U
#define PGF_DELAY_COMP_HI_PGF_DELAY_OFFSET4_BIT_OFFSET (0U)
#define PGF_DELAY_COMP_HI_PGF_DELAY_OFFSET4_BIT_LEN (6U)
#define PGF_DELAY_COMP_HI_PGF_DELAY_OFFSET4_BIT_MASK 0x3fU

/******************************************************************************
* @brief Bit definitions for register EVENT_CTRL
**/
#define EVENT_CTRL_ID                        0xf0000              
#define EVENT_CTRL_LEN                       (4U)                
#define EVENT_CTRL_MASK                      0xFFFFFFFFUL        
#define EVENT_CTRL_EVENT_COUNT_CLR_BIT_OFFSET (1U)                
#define EVENT_CTRL_EVENT_COUNT_CLR_BIT_LEN   (1U)                
#define EVENT_CTRL_EVENT_COUNT_CLR_BIT_MASK  0x2U                 
#define EVENT_CTRL_EVENT_COUNT_EN_BIT_OFFSET (0U)                
#define EVENT_CTRL_EVENT_COUNT_EN_BIT_LEN    (1U)                
#define EVENT_CTRL_EVENT_COUNT_EN_BIT_MASK   0x1U                 

/******************************************************************************
* @brief Bit definitions for register EVENT_COUNT0
**/
#define EVENT_COUNT0_ID                      0xf0004              
#define EVENT_COUNT0_LEN                     (4U)                
#define EVENT_COUNT0_MASK                    0xFFFFFFFFUL        
#define EVENT_COUNT0_COUNT_RXFSL_BIT_OFFSET  (16U)               
#define EVENT_COUNT0_COUNT_RXFSL_BIT_LEN     (12U)               
#define EVENT_COUNT0_COUNT_RXFSL_BIT_MASK    0xfff0000UL          
#define EVENT_COUNT0_COUNT_RXPHE_BIT_OFFSET  (0U)                
#define EVENT_COUNT0_COUNT_RXPHE_BIT_LEN     (12U)               
#define EVENT_COUNT0_COUNT_RXPHE_BIT_MASK    0xfffU               

