tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register EVENT_COUNT1
**/
#define EVENT_COUNT1_ID                      0xf0008              
#define EVENT_COUNT1_LEN                     (4U)                
#define EVENT_COUNT1_MASK                    0xFFFFFFFFUL        
#define EVENT_COUNT1_COUNT_RXFCE_BIT_OFFSET  (16U)               
#define EVENT_COUNT1_COUNT_RXFCE_BIT_LEN     (12U)               
#define EVENT_COUNT1_COUNT_RXFCE_BIT_MASK    0xfff0000UL          
#define EVENT_COUNT1_COUNT_RXFCG_BIT_OFFSET  (0U)                
#define EVENT_COUNT1_COUNT_RXFCG_BIT_LEN     (12U)               
#define EVENT_COUNT1_COUNT_RXFCG_BIT_MASK    0xfffU               

/******************************************************************************
* @brief Bit definitions for register EVENT_COUNT2
**/
#define EVENT_COUNT2_ID                      0xf000c              
#define EVENT_COUNT2_LEN                     (4U)                
#define EVENT_COUNT2_MASK                    0xFFFFFFFFUL        
#define EVENT_COUNT2_COUNT_RXOVRR_BIT_OFFSET (16U)               
#define EVENT_COUNT2_COUNT_RXOVRR_BIT_LEN    (8U)                
#define EVENT_COUNT2_COUNT_RXOVRR_BIT_MASK   0xff0000UL           
#define EVENT_COUNT2_COUNT_ARFE_BIT_OFFSET   (0U)                
#define EVENT_COUNT2_COUNT_ARFE_BIT_LEN      (8U)                
#define EVENT_COUNT2_COUNT_ARFE_BIT_MASK     0xffU                

/******************************************************************************
* @brief Bit definitions for register EVENT_COUNT3
**/
#define EVENT_COUNT3_ID                      0xf0010              
#define EVENT_COUNT3_LEN                     (4U)                
#define EVENT_COUNT3_MASK                    0xFFFFFFFFUL        
#define EVENT_COUNT3_COUNT_RXPTO_BIT_OFFSET  (16U)               
#define EVENT_COUNT3_COUNT_RXPTO_BIT_LEN     (12U)               
#define EVENT_COUNT3_COUNT_RXPTO_BIT_MASK    0xfff0000UL          
#define EVENT_COUNT3_COUNT_RXSTO_BIT_OFFSET  (0U)                
#define EVENT_COUNT3_COUNT_RXSTO_BIT_LEN     (12U)               
#define EVENT_COUNT3_COUNT_RXSTO_BIT_MASK    0xfffU               

/******************************************************************************
* @brief Bit definitions for register EVENT_COUNT4
**/
#define EVENT_COUNT4_ID                      0xf0014              
#define EVENT_COUNT4_LEN                     (4U)                
#define EVENT_COUNT4_MASK                    0xFFFFFFFFUL        
#define EVENT_COUNT4_COUNT_TXFRS_BIT_OFFSET  (16U)               
#define EVENT_COUNT4_COUNT_TXFRS_BIT_LEN     (12U)               
#define EVENT_COUNT4_COUNT_TXFRS_BIT_MASK    0xfff0000UL          
#define EVENT_COUNT4_COUNT_FWTO_BIT_OFFSET   (0U)                
#define EVENT_COUNT4_COUNT_FWTO_BIT_LEN      (8U)                
#define EVENT_COUNT4_COUNT_FWTO_BIT_MASK     0xffU                

/******************************************************************************
* @brief Bit definitions for register EVENT_COUNT5
**/
#define EVENT_COUNT5_ID                      0xf0018              
#define EVENT_COUNT5_LEN                     (4U)                
#define EVENT_COUNT5_MASK                    0xFFFFFFFFUL        
#define EVENT_COUNT5_COUNT_SPICRC_BIT_OFFSET (16U)               
#define EVENT_COUNT5_COUNT_SPICRC_BIT_LEN    (8U)                
#define EVENT_COUNT5_COUNT_SPICRC_BIT_MASK   0xff0000UL           
#define EVENT_COUNT5_COUNT_HPWARN_BIT_OFFSET (0U)                
#define EVENT_COUNT5_COUNT_HPWARN_BIT_LEN    (8U)                
#define EVENT_COUNT5_COUNT_HPWARN_BIT_MASK   0xffU                

/******************************************************************************
* @brief Bit definitions for register EVENT_COUNT6
**/
#define EVENT_COUNT6_ID                      0xf001c              
#define EVENT_COUNT6_LEN                     (4U)                
#define EVENT_COUNT6_MASK                    0xFFFFFFFFUL        
#define EVENT_COUNT6_COUNT_RXPREJ_BIT_OFFSET (0U)                
#define EVENT_COUNT6_COUNT_RXPREJ_BIT_LEN    (12U)               
#define EVENT_COUNT6_COUNT_RXPREJ_BIT_MASK   0xfffU               

/******************************************************************************
* @brief Bit definitions for register ADC_MEM_PTR
**/
#define ADC_MEM_PTR_ID                       0xf0020              
#define ADC_MEM_PTR_LEN                      (4U)                
#define ADC_MEM_PTR_MASK                     0xFFFFFFFFUL        
#define ADC_MEM_PTR_ADC_MEM_PTR_BIT_OFFSET   (0U)                
#define ADC_MEM_PTR_ADC_MEM_PTR_BIT_LEN      (12U)               
#define ADC_MEM_PTR_ADC_MEM_PTR_BIT_MASK     0xfffU               

/******************************************************************************
* @brief Bit definitions for register TEST_CTRL0
**/
#define TEST_CTRL0_ID                        0xf0024              
#define TEST_CTRL0_LEN                       (4U)                
#define TEST_CTRL0_MASK                      0xFFFFFFFFUL        
#define TEST_CTRL0_CIA_MAN_RUN_BIT_OFFSET    (26U)               
#define TEST_CTRL0_CIA_MAN_RUN_BIT_LEN       (1U)                
#define TEST_CTRL0_CIA_MAN_RUN_BIT_MASK      0x4000000UL          
#define TEST_CTRL0_CIA_ABORT_BIT_OFFSET      (25U)               
#define TEST_CTRL0_CIA_ABORT_BIT_LEN         (1U)                
#define TEST_CTRL0_CIA_ABORT_BIT_MASK        0x2000000UL          
#define TEST_CTRL0_CIA_WDOG_EN_BIT_OFFSET    (24U)               
#define TEST_CTRL0_CIA_WDOG_EN_BIT_LEN       (1U)                
#define TEST_CTRL0_CIA_WDOG_EN_BIT_MASK      0x1000000UL          
#define TEST_CTRL0_CIA_BOOT_SEL_BIT_OFFSET   (23U)               
#define TEST_CTRL0_CIA_BOOT_SEL_BIT_LEN      (1U)                
#define TEST_CTRL0_CIA_BOOT_SEL_BIT_MASK     0x800000UL           
#define TEST_CTRL0_CIA_ROMCPY_BIT_OFFSET     (22U)               
#define TEST_CTRL0_CIA_ROMCPY_BIT_LEN        (1U)                
#define TEST_CTRL0_CIA_ROMCPY_BIT_MASK       0x400000UL           
#define TEST_CTRL0_HIRQ_POL_BIT_OFFSET       (21U)               
#define TEST_CTRL0_HIRQ_POL_BIT_LEN          (1U)                
#define TEST_CTRL0_HIRQ_POL_BIT_MASK         0x200000UL           
#define TEST_CTRL0_FCS_INIT_BIT_OFFSET       (20U)               
#define TEST_CTRL0_FCS_INIT_BIT_LEN          (1U)                
#define TEST_CTRL0_FCS_INIT_BIT_MASK         0x100000UL           
#define TEST_CTRL0_DIS_RSDE_BIT_OFFSET       (19U)               
#define TEST_CTRL0_DIS_RSDE_BIT_LEN          (1U)                
#define TEST_CTRL0_DIS_RSDE_BIT_MASK         0x80000UL            
#define TEST_CTRL0_PRNG_LFSR_RD_BIT_OFFSET   (18U)               
#define TEST_CTRL0_PRNG_LFSR_RD_BIT_LEN      (1U)                
#define TEST_CTRL0_PRNG_LFSR_RD_BIT_MASK     0x40000UL            
#define TEST_CTRL0_TXB_DBG_BIT_OFFSET        (17U)               
#define TEST_CTRL0_TXB_DBG_BIT_LEN           (1U)                
#define TEST_CTRL0_TXB_DBG_BIT_MASK          0x20000UL            
#define TEST_CTRL0_SPICRC_DBG_BIT_OFFSET     (16U)               
#define TEST_CTRL0_SPICRC_DBG_BIT_LEN        (1U)                
#define TEST_CTRL0_SPICRC_DBG_BIT_MASK       0x10000UL            
#define TEST_CTRL0_TST_LCSS_BIT_OFFSET       (15U)               
#define TEST_CTRL0_TST_LCSS_BIT_LEN          (1U)                
#define TEST_CTRL0_TST_LCSS_BIT_MASK         0x8000U              
#define TEST_CTRL0_DIG_LOOPBACK_MODE_BIT_OFFSET (13U)               
#define TEST_CTRL0_DIG_LOOPBACK_MODE_BIT_LEN (2U)                
#define TEST_CTRL0_DIG_LOOPBACK_MODE_BIT_MASK 0x6000U              
#define TEST_CTRL0_ADCTST_RXON_BIT_OFFSET    (12U)               
#define TEST_CTRL0_ADCTST_RXON_BIT_LEN       (1U)                
#define TEST_CTRL0_ADCTST_RXON_BIT_MASK      0x1000U              
#define TEST_CTRL0_TXDATONLY_BIT_OFFSET      (11U)               
#define TEST_CTRL0_TXDATONLY_BIT_LEN         (1U)                
#define TEST_CTRL0_TXDATONLY_BIT_MASK        0x800U               
#define TEST_CTRL0_RX_ALWAYS_EN_BIT_OFFSET   (10U)               
#define TEST_CTRL0_RX_ALWAYS_EN_BIT_LEN      (1U)                
#define TEST_CTRL0_RX_ALWAYS_EN_BIT_MASK     0x400U               
#define TEST_CTRL0_TRD_BIT_OFFSET            (9U)                
#define TEST_CTRL0_TRD_BIT_LEN               (1U)                
#define TEST_CTRL0_TRD_BIT_MASK              0x200U               
#define TEST_CTRL0_CRD_BIT_OFFSET            (8U)                
#define TEST_CTRL0_CRD_BIT_LEN               (1U)                
#define TEST_CTRL0_CRD_BIT_MASK              0x100U               
#define TEST_CTRL0_RSDDIS_BIT_OFFSET         (7U)                
#define TEST_CTRL0_RSDDIS_BIT_LEN            (1U)                
#define TEST_CTRL0_RSDDIS_BIT_MASK           0x80U                
#define TEST_CTRL0_ADC_MEMWRAP_BIT_OFFSET    (6U)                
#define TEST_CTRL0_ADC_MEMWRAP_BIT_LEN       (1U)                
#define TEST_CTRL0_ADC_MEMWRAP_BIT_MASK      0x40U                
#define TEST_CTRL0_ADC_MEMTEST_BIT_OFFSET    (5U)                
#define TEST_CTRL0_ADC_MEMTEST_BIT_LEN       (1U)                
#define TEST_CTRL0_ADC_MEMTEST_BIT_MASK      0x20U                
#define TEST_CTRL0_TPSTM_BIT_OFFSET          (4U)                
#define TEST_CTRL0_TPSTM_BIT_LEN             (1U)                
#define TEST_CTRL0_TPSTM_BIT_MASK            0x10U                
#define TEST_CTRL0_TXSYNC_BIT_OFFSET         (3U)                
#define TEST_CTRL0_TXSYNC_BIT_LEN            (1U)                
#define TEST_CTRL0_TXSYNC_BIT_MASK           0x8U                 
#define TEST_CTRL0_TXPRE_BIT_OFFSET          (2U)                
#define TEST_CTRL0_TXPRE_BIT_LEN             (1U)                
#define TEST_CTRL0_TXPRE_BIT_MASK            0x4U                 
#define TEST_CTRL0_RF_LOOPBACK_BIT_OFFSET    (1U)                
#define TEST_CTRL0_RF_LOOPBACK_BIT_LEN       (1U)                
#define TEST_CTRL0_RF_LOOPBACK_BIT_MASK      0x2U                 
#define TEST_CTRL0_DIG_LOOPBACK_BIT_OFFSET   (0U)                
#define TEST_CTRL0_DIG_LOOPBACK_BIT_LEN      (1U)                
#define TEST_CTRL0_DIG_LOOPBACK_BIT_MASK     0x1U                 

