tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register EVENT_COUNT7
**/
#define EVENT_COUNT7_ID                      0xf0028              
#define EVENT_COUNT7_LEN                     (4U)                
#define EVENT_COUNT7_MASK                    0xFFFFFFFFUL        
#define EVENT_COUNT7_COUNT_VWARN_BIT_OFFSET  (16U)               
#define EVENT_COUNT7_COUNT_VWARN_BIT_LEN     (8U)                
#define EVENT_COUNT7_COUNT_VWARN_BIT_MASK    0xff0000UL           
#define EVENT_COUNT7_COUNT_CPERR_BIT_OFFSET  (0U)                
#define EVENT_COUNT7_COUNT_CPERR_BIT_LEN     (8U)                
#define EVENT_COUNT7_COUNT_CPERR_BIT_MASK    0xffU                

/******************************************************************************
* @brief Bit definitions for register SPI_MODE
**/
#define SPI_MODE_ID                          0xf002c              
#define SPI_MODE_LEN                         (4U)                
#define SPI_MODE_MASK                        0xFFFFFFFFUL        
#define SPI_MODE_SPI_MODE_BIT_OFFSET         (0U)                
#define SPI_MODE_SPI_MODE_BIT_LEN            (2U)                
#define SPI_MODE_SPI_MODE_BIT_MASK           0x3U                 

/******************************************************************************
* @brief Bit definitions for register SYS_STATE_LO
**/
#define SYS_STATE_LO_ID                      0xf0030              
#define SYS_STATE_LO_LEN                     (4U)                
#define SYS_STATE_LO_MASK                    0xFFFFFFFFUL        
#define SYS_STATE_LO_ACC_STATE_BIT_OFFSET    (24U)               
#define SYS_STATE_LO_ACC_STATE_BIT_LEN       (8U)                
#define SYS_STATE_LO_ACC_STATE_BIT_MASK      0xff000000UL         
#define SYS_STATE_LO_TSE_STATE_BIT_OFFSET    (16U)               
#define SYS_STATE_LO_TSE_STATE_BIT_LEN       (5U)                
#define SYS_STATE_LO_TSE_STATE_BIT_MASK      0x1f0000UL           
#define SYS_STATE_LO_RX_STATE_BIT_OFFSET     (8U)                
#define SYS_STATE_LO_RX_STATE_BIT_LEN        (6U)                
#define SYS_STATE_LO_RX_STATE_BIT_MASK       0x3f00U              
#define SYS_STATE_LO_TX_STATE_BIT_OFFSET     (0U)                
#define SYS_STATE_LO_TX_STATE_BIT_LEN        (4U)                
#define SYS_STATE_LO_TX_STATE_BIT_MASK       0xfU                 

/******************************************************************************
* @brief Bit definitions for register BIST_CTRL
**/
#define BIST_CTRL_ID                         0xf0034              
#define BIST_CTRL_LEN                        (4U)                
#define BIST_CTRL_MASK                       0xFFFFFFFFUL        
#define BIST_CTRL_ROM_WSOR_BIT_OFFSET        (23U)               
#define BIST_CTRL_ROM_WSOR_BIT_LEN           (1U)                
#define BIST_CTRL_ROM_WSOR_BIT_MASK          0x800000UL           
#define BIST_CTRL_ROM_BIST_WSO_BIT_OFFSET    (22U)               
#define BIST_CTRL_ROM_BIST_WSO_BIT_LEN       (1U)                
#define BIST_CTRL_ROM_BIST_WSO_BIT_MASK      0x400000UL           
#define BIST_CTRL_ROM_BIST_FAIL_BIT_OFFSET   (21U)               
#define BIST_CTRL_ROM_BIST_FAIL_BIT_LEN      (1U)                
#define BIST_CTRL_ROM_BIST_FAIL_BIT_MASK     0x200000UL           
#define BIST_CTRL_ROM_BIST_READY_BIT_OFFSET  (20U)               
#define BIST_CTRL_ROM_BIST_READY_BIT_LEN     (1U)                
#define BIST_CTRL_ROM_BIST_READY_BIT_MASK    0x100000UL           
#define BIST_CTRL_BIST_WSOR_BIT_OFFSET       (19U)               
#define BIST_CTRL_BIST_WSOR_BIT_LEN          (1U)                
#define BIST_CTRL_BIST_WSOR_BIT_MASK         0x80000UL            
#define BIST_CTRL_BIST_WSO_BIT_OFFSET        (18U)               
#define BIST_CTRL_BIST_WSO_BIT_LEN           (1U)                
#define BIST_CTRL_BIST_WSO_BIT_MASK          0x40000UL            
#define BIST_CTRL_BIST_FAIL_BIT_OFFSET       (17U)               
#define BIST_CTRL_BIST_FAIL_BIT_LEN          (1U)                
#define BIST_CTRL_BIST_FAIL_BIT_MASK         0x20000UL            
#define BIST_CTRL_BIST_READY_BIT_OFFSET      (16U)               
#define BIST_CTRL_BIST_READY_BIT_LEN         (1U)                
#define BIST_CTRL_BIST_READY_BIT_MASK        0x10000UL            
#define BIST_CTRL_SEL_ROM_BIST_SERIAL_BIT_OFFSET (14U)               
#define BIST_CTRL_SEL_ROM_BIST_SERIAL_BIT_LEN (1U)                
#define BIST_CTRL_SEL_ROM_BIST_SERIAL_BIT_MASK 0x4000U              
#define BIST_CTRL_RUN_ROM_BIST_BIT_OFFSET    (13U)               
#define BIST_CTRL_RUN_ROM_BIST_BIT_LEN       (1U)                
#define BIST_CTRL_RUN_ROM_BIST_BIT_MASK      0x2000U              
#define BIST_CTRL_AON_BIST_RUN_BIT_OFFSET    (12U)               
#define BIST_CTRL_AON_BIST_RUN_BIT_LEN       (1U)                
#define BIST_CTRL_AON_BIST_RUN_BIT_MASK      0x1000U              
#define BIST_CTRL_BIST_DM2_BIT_OFFSET        (11U)               
#define BIST_CTRL_BIST_DM2_BIT_LEN           (1U)                
#define BIST_CTRL_BIST_DM2_BIT_MASK          0x800U               
#define BIST_CTRL_BIST_DM1_BIT_OFFSET        (10U)               
#define BIST_CTRL_BIST_DM1_BIT_LEN           (1U)                
#define BIST_CTRL_BIST_DM1_BIT_MASK          0x400U               
#define BIST_CTRL_BIST_DM0_BIT_OFFSET        (9U)                
#define BIST_CTRL_BIST_DM0_BIT_LEN           (1U)                
#define BIST_CTRL_BIST_DM0_BIT_MASK          0x200U               
#define BIST_CTRL_BIST_WRSTN_BIT_OFFSET      (8U)                
#define BIST_CTRL_BIST_WRSTN_BIT_LEN         (1U)                
#define BIST_CTRL_BIST_WRSTN_BIT_MASK        0x100U               
#define BIST_CTRL_BIST_WSI_BIT_OFFSET        (7U)                
#define BIST_CTRL_BIST_WSI_BIT_LEN           (1U)                
#define BIST_CTRL_BIST_WSI_BIT_MASK          0x80U                
#define BIST_CTRL_BIST_UPDATE_WR_BIT_OFFSET  (6U)                
#define BIST_CTRL_BIST_UPDATE_WR_BIT_LEN     (1U)                
#define BIST_CTRL_BIST_UPDATE_WR_BIT_MASK    0x40U                
#define BIST_CTRL_BIST_SHIFT_WR_BIT_OFFSET   (5U)                
#define BIST_CTRL_BIST_SHIFT_WR_BIT_LEN      (1U)                
#define BIST_CTRL_BIST_SHIFT_WR_BIT_MASK     0x20U                
#define BIST_CTRL_BIST_SELECT_WIR_BIT_OFFSET (4U)                
#define BIST_CTRL_BIST_SELECT_WIR_BIT_LEN    (1U)                
#define BIST_CTRL_BIST_SELECT_WIR_BIT_MASK   0x10U                
#define BIST_CTRL_BIST_CAPTURE_WR_BIT_OFFSET (3U)                
#define BIST_CTRL_BIST_CAPTURE_WR_BIT_LEN    (1U)                
#define BIST_CTRL_BIST_CAPTURE_WR_BIT_MASK   0x8U                 
#define BIST_CTRL_BIST_WCLK_BIT_OFFSET       (2U)                
#define BIST_CTRL_BIST_WCLK_BIT_LEN          (1U)                
#define BIST_CTRL_BIST_WCLK_BIT_MASK         0x4U                 
#define BIST_CTRL_BIST_SMART_EN_BIT_OFFSET   (1U)                
#define BIST_CTRL_BIST_SMART_EN_BIT_LEN      (1U)                
#define BIST_CTRL_BIST_SMART_EN_BIT_MASK     0x2U                 
#define BIST_CTRL_SRAM_BIST_RUN_BIT_OFFSET   (0U)                
#define BIST_CTRL_SRAM_BIST_RUN_BIT_LEN      (1U)                
#define BIST_CTRL_SRAM_BIST_RUN_BIT_MASK     0x1U                 

