tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register TST_DBG
**/
#define TST_DBG_ID                           0xf0038              
#define TST_DBG_LEN                          (4U)                
#define TST_DBG_MASK                         0xFFFFFFFFUL        
#define TST_DBG_DBUG_MUX_SEL_BIT_OFFSET      (2U)                
#define TST_DBG_DBUG_MUX_SEL_BIT_LEN         (6U)                
#define TST_DBG_DBUG_MUX_SEL_BIT_MASK        0xfcU                
#define TST_DBG_TST_DBG_BIT_OFFSET           (0U)                
#define TST_DBG_TST_DBG_BIT_LEN              (2U)                
#define TST_DBG_TST_DBG_BIT_MASK             0x3U                 

/******************************************************************************
* @brief Bit definitions for register FCMD_STATUS
**/
#define FCMD_STATUS_ID                       0xf003c              
#define FCMD_STATUS_LEN                      (4U)                
#define FCMD_STATUS_MASK                     0xFFFFFFFFUL        
#define FCMD_STATUS_FCMD_STATUS_BIT_OFFSET   (0U)                
#define FCMD_STATUS_FCMD_STATUS_BIT_LEN      (5U)                
#define FCMD_STATUS_FCMD_STATUS_BIT_MASK     0x1fU                

/******************************************************************************
* @brief Bit definitions for register TEST_LOGGING
**/
#define TEST_LOGGING_ID                      0xf0040              
#define TEST_LOGGING_LEN                     (4U)                
#define TEST_LOGGING_MASK                    0xFFFFFFFFUL        
#define TEST_LOGGING_LOGGER_CLR_BIT_OFFSET   (8U)                
#define TEST_LOGGING_LOGGER_CLR_BIT_LEN      (1U)                
#define TEST_LOGGING_LOGGER_CLR_BIT_MASK     0x100U               
#define TEST_LOGGING_LOGGER_TRIG_BIT_OFFSET  (2U)                
#define TEST_LOGGING_LOGGER_TRIG_BIT_LEN     (3U)                
#define TEST_LOGGING_LOGGER_TRIG_BIT_MASK    0x1cU                
#define TEST_LOGGING_LOGGER_MODE_BIT_OFFSET  (0U)                
#define TEST_LOGGING_LOGGER_MODE_BIT_LEN     (2U)                
#define TEST_LOGGING_LOGGER_MODE_BIT_MASK    0x3U                 

/******************************************************************************
* @brief Bit definitions for register STATUS_LOGGING
**/
#define STATUS_LOGGING_ID                    0xf0044              
#define STATUS_LOGGING_LEN                   (4U)                
#define STATUS_LOGGING_MASK                  0xFFFFFFFFUL        
#define STATUS_LOGGING_LOGGED_LOCS_BIT_OFFSET (0U)                
#define STATUS_LOGGING_LOGGED_LOCS_BIT_LEN   (10U)               
#define STATUS_LOGGING_LOGGED_LOCS_BIT_MASK  0x3ffU               

/******************************************************************************
* @brief Bit definitions for register CTR_DBG
**/
#define CTR_DBG_ID                           0xf0048              
#define CTR_DBG_LEN                          (4U)                
#define CTR_DBG_MASK                         0xFFFFFFFFUL        
#define CTR_DBG_CTR_DBG_BIT_OFFSET           (0U)                
#define CTR_DBG_CTR_DBG_BIT_LEN              (32U)               
#define CTR_DBG_CTR_DBG_BIT_MASK             0xffffffffUL         

/******************************************************************************
* @brief Bit definitions for register INIT
**/
#define INIT_ID                              0xf004c              
#define INIT_LEN                             (4U)                
#define INIT_MASK                            0xFFFFFFFFUL        
#define INIT_INIT_BIT_OFFSET                 (0U)                
#define INIT_INIT_BIT_LEN                    (8U)                
#define INIT_INIT_BIT_MASK                   0xffU                

/******************************************************************************
* @brief Bit definitions for register SOFT_RST
**/
#define SOFT_RST_ID                          0x110000             
#define SOFT_RST_LEN                         (4U)                
#define SOFT_RST_MASK                        0xFFFFFFFFUL        
#define SOFT_RST_BLOCK_CLR_BIT_OFFSET        (9U)                
#define SOFT_RST_BLOCK_CLR_BIT_LEN           (7U)                
#define SOFT_RST_BLOCK_CLR_BIT_MASK          0xfe00U              
#define SOFT_RST_GPIO_RST_N_BIT_OFFSET       (8U)                
#define SOFT_RST_GPIO_RST_N_BIT_LEN          (1U)                
#define SOFT_RST_GPIO_RST_N_BIT_MASK         0x100U               
#define SOFT_RST_PMSC_RST_N_BIT_OFFSET       (7U)                
#define SOFT_RST_PMSC_RST_N_BIT_LEN          (1U)                
#define SOFT_RST_PMSC_RST_N_BIT_MASK         0x80U                
#define SOFT_RST_HIF_RST_N_BIT_OFFSET        (6U)                
#define SOFT_RST_HIF_RST_N_BIT_LEN           (1U)                
#define SOFT_RST_HIF_RST_N_BIT_MASK          0x40U                
#define SOFT_RST_TX_RST_N_BIT_OFFSET         (5U)                
#define SOFT_RST_TX_RST_N_BIT_LEN            (1U)                
#define SOFT_RST_TX_RST_N_BIT_MASK           0x20U                
#define SOFT_RST_RX_RST_N_BIT_OFFSET         (4U)                
#define SOFT_RST_RX_RST_N_BIT_LEN            (1U)                
#define SOFT_RST_RX_RST_N_BIT_MASK           0x10U                
#define SOFT_RST_BIST_RST_N_BIT_OFFSET       (3U)                
#define SOFT_RST_BIST_RST_N_BIT_LEN          (1U)                
#define SOFT_RST_BIST_RST_N_BIT_MASK         0x8U                 
#define SOFT_RST_CIA_RST_N_BIT_OFFSET        (2U)                
#define SOFT_RST_CIA_RST_N_BIT_LEN           (1U)                
#define SOFT_RST_CIA_RST_N_BIT_MASK          0x4U                 
#define SOFT_RST_PRNG_RST_N_BIT_OFFSET       (1U)                
#define SOFT_RST_PRNG_RST_N_BIT_LEN          (1U)                
#define SOFT_RST_PRNG_RST_N_BIT_MASK         0x2U                 
#define SOFT_RST_ARM_RST_N_BIT_OFFSET        (0U)                
#define SOFT_RST_ARM_RST_N_BIT_LEN           (1U)                
#define SOFT_RST_ARM_RST_N_BIT_MASK          0x1U                 

