tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register CLK_CTRL
**/
#define CLK_CTRL_ID                          0x110004             
#define CLK_CTRL_LEN                         (4U)                
#define CLK_CTRL_MASK                        0xFFFFFFFFUL        
#define CLK_CTRL_BIST_CLK_EN_BIT_OFFSET      (26U)               
#define CLK_CTRL_BIST_CLK_EN_BIT_LEN         (1U)                
#define CLK_CTRL_BIST_CLK_EN_BIT_MASK        0x4000000UL          
#define CLK_CTRL_PLL_LOCK_TIMER_EN_BIT_OFFSET (25U)               
#define CLK_CTRL_PLL_LOCK_TIMER_EN_BIT_LEN   (1U)                
#define CLK_CTRL_PLL_LOCK_TIMER_EN_BIT_MASK  0x2000000UL          
#define CLK_CTRL_SLEEP_MODE_BIT_OFFSET       (24U)               
#define CLK_CTRL_SLEEP_MODE_BIT_LEN          (1U)                
#define CLK_CTRL_SLEEP_MODE_BIT_MASK         0x1000000UL          
#define CLK_CTRL_LP_CLK_EN_BIT_OFFSET        (23U)               
#define CLK_CTRL_LP_CLK_EN_BIT_LEN           (1U)                
#define CLK_CTRL_LP_CLK_EN_BIT_MASK          0x800000UL           
#define CLK_CTRL_CIA_WR_CLK_EN_BIT_OFFSET    (22U)               
#define CLK_CTRL_CIA_WR_CLK_EN_BIT_LEN       (1U)                
#define CLK_CTRL_CIA_WR_CLK_EN_BIT_MASK      0x400000UL           
#define CLK_CTRL_RX_BUFF_AUTO_CLK_BIT_OFFSET (21U)               
#define CLK_CTRL_RX_BUFF_AUTO_CLK_BIT_LEN    (1U)                
#define CLK_CTRL_RX_BUFF_AUTO_CLK_BIT_MASK   0x200000UL           
#define CLK_CTRL_CODE_MEM_AUTO_CLK_BIT_OFFSET (20U)               
#define CLK_CTRL_CODE_MEM_AUTO_CLK_BIT_LEN   (1U)                
#define CLK_CTRL_CODE_MEM_AUTO_CLK_BIT_MASK  0x100000UL           
#define CLK_CTRL_GPIO_DBNC_RST_N_BIT_OFFSET  (19U)               
#define CLK_CTRL_GPIO_DBNC_RST_N_BIT_LEN     (1U)                
#define CLK_CTRL_GPIO_DBNC_RST_N_BIT_MASK    0x80000UL            
#define CLK_CTRL_GPIO_DBNC_CLK_EN_BIT_OFFSET (18U)               
#define CLK_CTRL_GPIO_DBNC_CLK_EN_BIT_LEN    (1U)                
#define CLK_CTRL_GPIO_DBNC_CLK_EN_BIT_MASK   0x40000UL            
#define CLK_CTRL_GPIO_CLK_EN_BIT_OFFSET      (16U)               
#define CLK_CTRL_GPIO_CLK_EN_BIT_LEN         (1U)                
#define CLK_CTRL_GPIO_CLK_EN_BIT_MASK        0x10000UL            
#define CLK_CTRL_ACC_MEM_CLK_ON_BIT_OFFSET   (15U)               
#define CLK_CTRL_ACC_MEM_CLK_ON_BIT_LEN      (1U)                
#define CLK_CTRL_ACC_MEM_CLK_ON_BIT_MASK     0x8000U              
#define CLK_CTRL_RSD_CLK_ON_BIT_OFFSET       (14U)               
#define CLK_CTRL_RSD_CLK_ON_BIT_LEN          (1U)                
#define CLK_CTRL_RSD_CLK_ON_BIT_MASK         0x4000U              
#define CLK_CTRL_LOOPBACK_CLK_EN_BIT_OFFSET  (13U)               
#define CLK_CTRL_LOOPBACK_CLK_EN_BIT_LEN     (1U)                
#define CLK_CTRL_LOOPBACK_CLK_EN_BIT_MASK    0x2000U              
#define CLK_CTRL_TX_BUF_CLK_ON_BIT_OFFSET    (12U)               
#define CLK_CTRL_TX_BUF_CLK_ON_BIT_LEN       (1U)                
#define CLK_CTRL_TX_BUF_CLK_ON_BIT_MASK      0x1000U              
#define CLK_CTRL_RX_BUF_CLK_ON_BIT_OFFSET    (11U)               
#define CLK_CTRL_RX_BUF_CLK_ON_BIT_LEN       (1U)                
#define CLK_CTRL_RX_BUF_CLK_ON_BIT_MASK      0x800U               
#define CLK_CTRL_FORCE_SAR_CLK_EN_BIT_OFFSET (10U)               
#define CLK_CTRL_FORCE_SAR_CLK_EN_BIT_LEN    (1U)                
#define CLK_CTRL_FORCE_SAR_CLK_EN_BIT_MASK   0x400U               
#define CLK_CTRL_FORCE_NVM_CLK_EN_BIT_OFFSET (9U)                
#define CLK_CTRL_FORCE_NVM_CLK_EN_BIT_LEN    (1U)                
#define CLK_CTRL_FORCE_NVM_CLK_EN_BIT_MASK   0x200U               
#define CLK_CTRL_FORCE_CIA_CLKS_ON_BIT_OFFSET (8U)                
#define CLK_CTRL_FORCE_CIA_CLKS_ON_BIT_LEN   (1U)                
#define CLK_CTRL_FORCE_CIA_CLKS_ON_BIT_MASK  0x100U               
#define CLK_CTRL_RX_CLK_GATE_DISABLE_BIT_OFFSET (7U)                
#define CLK_CTRL_RX_CLK_GATE_DISABLE_BIT_LEN (1U)                
#define CLK_CTRL_RX_CLK_GATE_DISABLE_BIT_MASK 0x80U                
#define CLK_CTRL_FORCE_ACC_CLK_BIT_OFFSET    (6U)                
#define CLK_CTRL_FORCE_ACC_CLK_BIT_LEN       (1U)                
#define CLK_CTRL_FORCE_ACC_CLK_BIT_MASK      0x40U                
#define CLK_CTRL_TX_CLK_SEL_BIT_OFFSET       (4U)                
#define CLK_CTRL_TX_CLK_SEL_BIT_LEN          (2U)                
#define CLK_CTRL_TX_CLK_SEL_BIT_MASK         0x30U                
#define CLK_CTRL_RX_CLK_SEL_BIT_OFFSET       (2U)                
#define CLK_CTRL_RX_CLK_SEL_BIT_LEN          (2U)                
#define CLK_CTRL_RX_CLK_SEL_BIT_MASK         0xcU                 
#define CLK_CTRL_SYS_CLK_SEL_BIT_OFFSET      (0U)                
#define CLK_CTRL_SYS_CLK_SEL_BIT_LEN         (2U)                
#define CLK_CTRL_SYS_CLK_SEL_BIT_MASK        0x3U                 

/******************************************************************************
* @brief Bit definitions for register SEQ_CTRL
**/
#define SEQ_CTRL_ID                          0x110008             
#define SEQ_CTRL_LEN                         (4U)                
#define SEQ_CTRL_MASK                        0xFFFFFFFFUL        
#define SEQ_CTRL_LP_CLK_DIV_BIT_OFFSET       (26U)               
#define SEQ_CTRL_LP_CLK_DIV_BIT_LEN          (6U)                
#define SEQ_CTRL_LP_CLK_DIV_BIT_MASK         0xfc000000UL         
#define SEQ_CTRL_FORCE_SYNC_BIT_OFFSET       (25U)               
#define SEQ_CTRL_FORCE_SYNC_BIT_LEN          (1U)                
#define SEQ_CTRL_FORCE_SYNC_BIT_MASK         0x2000000UL          
#define SEQ_CTRL_FORCE2RC_BIT_OFFSET         (24U)               
#define SEQ_CTRL_FORCE2RC_BIT_LEN            (1U)                
#define SEQ_CTRL_FORCE2RC_BIT_MASK           0x1000000UL          
#define SEQ_CTRL_FORCE2INIT_BIT_OFFSET       (23U)               
#define SEQ_CTRL_FORCE2INIT_BIT_LEN          (1U)                
#define SEQ_CTRL_FORCE2INIT_BIT_MASK         0x800000UL           
#define SEQ_CTRL_FORCE2IDLE_BIT_OFFSET       (22U)               
#define SEQ_CTRL_FORCE2IDLE_BIT_LEN          (1U)                
#define SEQ_CTRL_FORCE2IDLE_BIT_MASK         0x400000UL           
#define SEQ_CTRL_RX_RST_MODE_BIT_OFFSET      (21U)               
#define SEQ_CTRL_RX_RST_MODE_BIT_LEN         (1U)                
#define SEQ_CTRL_RX_RST_MODE_BIT_MASK        0x200000UL           
#define SEQ_CTRL_FORCE_RX_STATE_BIT_OFFSET   (20U)               
#define SEQ_CTRL_FORCE_RX_STATE_BIT_LEN      (1U)                
#define SEQ_CTRL_FORCE_RX_STATE_BIT_MASK     0x100000UL           
#define SEQ_CTRL_FORCE_TX_STATE_BIT_OFFSET   (19U)               
#define SEQ_CTRL_FORCE_TX_STATE_BIT_LEN      (1U)                
#define SEQ_CTRL_FORCE_TX_STATE_BIT_MASK     0x80000UL            
#define SEQ_CTRL_FORCE_CAL_MODE_BIT_OFFSET   (18U)               
#define SEQ_CTRL_FORCE_CAL_MODE_BIT_LEN      (1U)                
#define SEQ_CTRL_FORCE_CAL_MODE_BIT_MASK     0x40000UL            
#define SEQ_CTRL_CIA_SEQ_EN_BIT_OFFSET       (17U)               
#define SEQ_CTRL_CIA_SEQ_EN_BIT_LEN          (1U)                
#define SEQ_CTRL_CIA_SEQ_EN_BIT_MASK         0x20000UL            
#define SEQ_CTRL_RX_OFF_EARLY_EN_BIT_OFFSET  (16U)               
#define SEQ_CTRL_RX_OFF_EARLY_EN_BIT_LEN     (1U)                
#define SEQ_CTRL_RX_OFF_EARLY_EN_BIT_MASK    0x10000UL            
#define SEQ_CTRL_PLL_SYNC_MODE_BIT_OFFSET    (15U)               
#define SEQ_CTRL_PLL_SYNC_MODE_BIT_LEN       (1U)                
#define SEQ_CTRL_PLL_SYNC_MODE_BIT_MASK      0x8000U              
#define SEQ_CTRL_SNOOZE_REPEAT_BIT_OFFSET    (14U)               
#define SEQ_CTRL_SNOOZE_REPEAT_BIT_LEN       (1U)                
#define SEQ_CTRL_SNOOZE_REPEAT_BIT_MASK      0x4000U              
#define SEQ_CTRL_SNOOZE_EN_BIT_OFFSET        (13U)               
#define SEQ_CTRL_SNOOZE_EN_BIT_LEN           (1U)                
#define SEQ_CTRL_SNOOZE_EN_BIT_MASK          0x2000U              
#define SEQ_CTRL_AUTO_RX2SLP_BIT_OFFSET      (12U)               
#define SEQ_CTRL_AUTO_RX2SLP_BIT_LEN         (1U)                
#define SEQ_CTRL_AUTO_RX2SLP_BIT_MASK        0x1000U              
#define SEQ_CTRL_AUTO_TX2SLP_BIT_OFFSET      (11U)               
#define SEQ_CTRL_AUTO_TX2SLP_BIT_LEN         (1U)                
#define SEQ_CTRL_AUTO_TX2SLP_BIT_MASK        0x800U               
#define SEQ_CTRL_AUTO_RX_SEQ_BIT_OFFSET      (10U)               
#define SEQ_CTRL_AUTO_RX_SEQ_BIT_LEN         (1U)                
#define SEQ_CTRL_AUTO_RX_SEQ_BIT_MASK        0x400U               
#define SEQ_CTRL_AUTO_TX_SEQ_BIT_OFFSET      (9U)                
#define SEQ_CTRL_AUTO_TX_SEQ_BIT_LEN         (1U)                
#define SEQ_CTRL_AUTO_TX_SEQ_BIT_MASK        0x200U               
#define SEQ_CTRL_AUTO_INIT2IDLE_BIT_OFFSET   (8U)                
#define SEQ_CTRL_AUTO_INIT2IDLE_BIT_LEN      (1U)                
#define SEQ_CTRL_AUTO_INIT2IDLE_BIT_MASK     0x100U               
#define SEQ_CTRL_AUTOINIT_MODE_BIT_OFFSET    (7U)                
#define SEQ_CTRL_AUTOINIT_MODE_BIT_LEN       (1U)                
#define SEQ_CTRL_AUTOINIT_MODE_BIT_MASK      0x80U                
#define SEQ_CTRL_DA_CAL_MASK_BIT_OFFSET      (6U)                
#define SEQ_CTRL_DA_CAL_MASK_BIT_LEN         (1U)                
#define SEQ_CTRL_DA_CAL_MASK_BIT_MASK        0x40U                
#define SEQ_CTRL_AON_CLK_CTRL_BIT_OFFSET     (5U)                
#define SEQ_CTRL_AON_CLK_CTRL_BIT_LEN        (1U)                
#define SEQ_CTRL_AON_CLK_CTRL_BIT_MASK       0x20U                
#define SEQ_CTRL_LDO_CTRL_BIT_OFFSET         (4U)                
#define SEQ_CTRL_LDO_CTRL_BIT_LEN            (1U)                
#define SEQ_CTRL_LDO_CTRL_BIT_MASK           0x10U                
#define SEQ_CTRL_RF_CTRL_BIT_OFFSET          (3U)                
#define SEQ_CTRL_RF_CTRL_BIT_LEN             (1U)                
#define SEQ_CTRL_RF_CTRL_BIT_MASK            0x8U                 
#define SEQ_CTRL_AUTOTX2INIT_BIT_OFFSET      (2U)                
#define SEQ_CTRL_AUTOTX2INIT_BIT_LEN         (1U)                
#define SEQ_CTRL_AUTOTX2INIT_BIT_MASK        0x4U                 
#define SEQ_CTRL_AUTORX2INIT_BIT_OFFSET      (1U)                
#define SEQ_CTRL_AUTORX2INIT_BIT_LEN         (1U)                
#define SEQ_CTRL_AUTORX2INIT_BIT_MASK        0x2U                 
#define SEQ_CTRL_SYS_TIME_ON_BIT_OFFSET      (0U)                
#define SEQ_CTRL_SYS_TIME_ON_BIT_LEN         (1U)                
#define SEQ_CTRL_SYS_TIME_ON_BIT_MASK        0x1U                 

