tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register SNOOZE_CNT
**/
#define SNOOZE_CNT_ID                        0x11000c             
#define SNOOZE_CNT_LEN                       (4U)                
#define SNOOZE_CNT_MASK                      0xFFFFFFFFUL        
#define SNOOZE_CNT_SNZ_CNT_BIT_OFFSET        (0U)                
#define SNOOZE_CNT_SNZ_CNT_BIT_LEN           (8U)                
#define SNOOZE_CNT_SNZ_CNT_BIT_MASK          0xffU                

/******************************************************************************
* @brief Bit definitions for register PWR_UP_TIMES_LO
**/
#define PWR_UP_TIMES_LO_ID                   0x110010             
#define PWR_UP_TIMES_LO_LEN                  (4U)                
#define PWR_UP_TIMES_LO_MASK                 0xFFFFFFFFUL        
#define PWR_UP_TIMES_LO_EXT_DA_DLY_BIT_OFFSET (29U)               
#define PWR_UP_TIMES_LO_EXT_DA_DLY_BIT_LEN   (3U)                
#define PWR_UP_TIMES_LO_EXT_DA_DLY_BIT_MASK  0xe0000000UL         
#define PWR_UP_TIMES_LO_TXC_RF_OFF_DLY_BIT_OFFSET (27U)               
#define PWR_UP_TIMES_LO_TXC_RF_OFF_DLY_BIT_LEN (2U)                
#define PWR_UP_TIMES_LO_TXC_RF_OFF_DLY_BIT_MASK 0x18000000UL         
#define PWR_UP_TIMES_LO_TXC_MIX_DLY_BIT_OFFSET (24U)               
#define PWR_UP_TIMES_LO_TXC_MIX_DLY_BIT_LEN  (3U)                
#define PWR_UP_TIMES_LO_TXC_MIX_DLY_BIT_MASK 0x7000000UL          
#define PWR_UP_TIMES_LO_TXC_DA_DLY_BIT_OFFSET (21U)               
#define PWR_UP_TIMES_LO_TXC_DA_DLY_BIT_LEN   (3U)                
#define PWR_UP_TIMES_LO_TXC_DA_DLY_BIT_MASK  0xe00000UL           
#define PWR_UP_TIMES_LO_TX_HOP_DLY_BIT_OFFSET (18U)               
#define PWR_UP_TIMES_LO_TX_HOP_DLY_BIT_LEN   (3U)                
#define PWR_UP_TIMES_LO_TX_HOP_DLY_BIT_MASK  0x1c0000UL           
#define PWR_UP_TIMES_LO_HIF_TIM_CLK_DLY_BIT_OFFSET (14U)               
#define PWR_UP_TIMES_LO_HIF_TIM_CLK_DLY_BIT_LEN (4U)                
#define PWR_UP_TIMES_LO_HIF_TIM_CLK_DLY_BIT_MASK 0x3c000UL            
#define PWR_UP_TIMES_LO_HIF_TIM_DAC_DLY_BIT_OFFSET (10U)               
#define PWR_UP_TIMES_LO_HIF_TIM_DAC_DLY_BIT_LEN (4U)                
#define PWR_UP_TIMES_LO_HIF_TIM_DAC_DLY_BIT_MASK 0x3c00U              
#define PWR_UP_TIMES_LO_HIF_TIM_LDO_DLY_BIT_OFFSET (6U)                
#define PWR_UP_TIMES_LO_HIF_TIM_LDO_DLY_BIT_LEN (4U)                
#define PWR_UP_TIMES_LO_HIF_TIM_LDO_DLY_BIT_MASK 0x3c0U               
#define PWR_UP_TIMES_LO_PLL_LOCK_CNT_EN_BIT_OFFSET (5U)                
#define PWR_UP_TIMES_LO_PLL_LOCK_CNT_EN_BIT_LEN (1U)                
#define PWR_UP_TIMES_LO_PLL_LOCK_CNT_EN_BIT_MASK 0x20U                
#define PWR_UP_TIMES_LO_PLL_LOCK_TIME_BIT_OFFSET (0U)                
#define PWR_UP_TIMES_LO_PLL_LOCK_TIME_BIT_LEN (5U)                
#define PWR_UP_TIMES_LO_PLL_LOCK_TIME_BIT_MASK 0x1fU                

/******************************************************************************
* @brief Bit definitions for register PWR_UP_TIMES_HI
**/
#define PWR_UP_TIMES_HI_ID                   0x110014             
#define PWR_UP_TIMES_HI_LEN                  (2U)                
#define PWR_UP_TIMES_HI_MASK                 0xFFFFU             
#define PWR_UP_TIMES_HI_TXC_LONG_DATA_EN_BIT_OFFSET (12U)               
#define PWR_UP_TIMES_HI_TXC_LONG_DATA_EN_BIT_LEN (1U)                
#define PWR_UP_TIMES_HI_TXC_LONG_DATA_EN_BIT_MASK 0x1000U              
#define PWR_UP_TIMES_HI_TXC_MIX_LO_EN_BIT_OFFSET (9U)                
#define PWR_UP_TIMES_HI_TXC_MIX_LO_EN_BIT_LEN (3U)                
#define PWR_UP_TIMES_HI_TXC_MIX_LO_EN_BIT_MASK 0xe00U               
#define PWR_UP_TIMES_HI_DX_DSPRD_OFF_DLY_BIT_OFFSET (5U)                
#define PWR_UP_TIMES_HI_DX_DSPRD_OFF_DLY_BIT_LEN (4U)                
#define PWR_UP_TIMES_HI_DX_DSPRD_OFF_DLY_BIT_MASK 0x1e0U               
#define PWR_UP_TIMES_HI_RX_DSPRD_ON_DLY_BIT_OFFSET (0U)                
#define PWR_UP_TIMES_HI_RX_DSPRD_ON_DLY_BIT_LEN (5U)                
#define PWR_UP_TIMES_HI_RX_DSPRD_ON_DLY_BIT_MASK 0x1fU                

/******************************************************************************
* @brief Bit definitions for register LED_CTRL
**/
#define LED_CTRL_ID                          0x110016             /*  */
#define LED_CTRL_LEN                         (4U)                
#define LED_CTRL_MASK                        0xFFFFFFFFUL        
#define LED_CTRL_FORCE_SOLID_BIT_OFFSET      (24U)               
#define LED_CTRL_FORCE_SOLID_BIT_LEN         (4U)                
#define LED_CTRL_FORCE_SOLID_BIT_MASK        0xf000000UL          
#define LED_CTRL_FORCE_TOGGLE_BIT_OFFSET     (20U)               
#define LED_CTRL_FORCE_TOGGLE_BIT_LEN        (4U)                
#define LED_CTRL_FORCE_TOGGLE_BIT_MASK       0xf00000UL           
#define LED_CTRL_FORCE_TRIGGER_BIT_OFFSET    (16U)               
#define LED_CTRL_FORCE_TRIGGER_BIT_LEN       (4U)                
#define LED_CTRL_FORCE_TRIGGER_BIT_MASK      0xf0000UL            
#define LED_CTRL_BLINK_EN_BIT_OFFSET         (8U)                
#define LED_CTRL_BLINK_EN_BIT_LEN            (1U)                
#define LED_CTRL_BLINK_EN_BIT_MASK           0x100U               
#define LED_CTRL_BLINK_CNT_BIT_OFFSET        (0U)                
#define LED_CTRL_BLINK_CNT_BIT_LEN           (8U)                
#define LED_CTRL_BLINK_CNT_BIT_MASK          0xffU                

/******************************************************************************
* @brief Bit definitions for register RX_PPM
**/
#define RX_PPM_ID                            0x11001a             /*  { aliased = true}  */
#define RX_PPM_LEN                           (4U)                
#define RX_PPM_MASK                          0xFFFFFFFFUL        
#define RX_PPM_PPM_OFF_BIT_OFFSET            (8U)                
#define RX_PPM_PPM_OFF_BIT_LEN               (8U)                
#define RX_PPM_PPM_OFF_BIT_MASK              0xff00U              
#define RX_PPM_PPM_ON_BIT_OFFSET             (0U)                
#define RX_PPM_PPM_ON_BIT_LEN                (4U)                
#define RX_PPM_PPM_ON_BIT_MASK               0xfU                 

