tom38121605/RD_02_mcu_nrf52_TXT/NRF_01_nrf52833_01_SES/_Awork37_GS361_Qorvo-txt/tag_blink_1_10Hz_28_af_add_adc_module_一直开着mainpower和pwm_测试_k/Src/deca_driver/deca_regs.h
/******************************************************************************
* @brief Bit definitions for register FOSC_CTRL
**/
#define FOSC_CTRL_ID                         0x11001e            /*  { aliased = true}  */
#define FOSC_CTRL_LEN                        (1U)                
#define FOSC_CTRL_MASK                       0xFFU               
#define FOSC_CTRL_FOSC_TRIM_BIT_OFFSET       (0U)                
#define FOSC_CTRL_FOSC_TRIM_BIT_LEN          (6U)                
#define FOSC_CTRL_FOSC_TRIM_BIT_MASK         0x3fU                

/******************************************************************************
* @brief Bit definitions for register BIAS_CTRL
**/
#define BIAS_CTRL_ID                         0x11001f             /*  */
#define BIAS_CTRL_LEN                        (4U)                
#define BIAS_CTRL_MASK                       0xFFFFFFFFUL        
#define BIAS_CTRL_DIG_BIAS_CTRL_TC_R3_ULV_BIT_OFFSET (12U)               
#define BIAS_CTRL_DIG_BIAS_CTRL_TC_R3_ULV_BIT_LEN (2U)                
#define BIAS_CTRL_DIG_BIAS_CTRL_TC_R3_ULV_BIT_MASK 0x3000U              
#define BIAS_CTRL_DIG_BIAS_TESTSEL_ULV_BIT_OFFSET (9U)                
#define BIAS_CTRL_DIG_BIAS_TESTSEL_ULV_BIT_LEN (3U)                
#define BIAS_CTRL_DIG_BIAS_TESTSEL_ULV_BIT_MASK 0xe00U               
#define BIAS_CTRL_DIG_BIAS_CTRL_TC_R1_ULV_BIT_OFFSET (5U)                
#define BIAS_CTRL_DIG_BIAS_CTRL_TC_R1_ULV_BIT_LEN (4U)                
#define BIAS_CTRL_DIG_BIAS_CTRL_TC_R1_ULV_BIT_MASK 0x1e0U               
#define BIAS_CTRL_DIG_BIAS_DAC_ULV_BIT_OFFSET (0U)                
#define BIAS_CTRL_DIG_BIAS_DAC_ULV_BIT_LEN   (5U)                
#define BIAS_CTRL_DIG_BIAS_DAC_ULV_BIT_MASK  0x1fU                

/******************************************************************************
* @brief Bit definitions for register FINT_STAT
**/
#define FINT_STAT_ID                         0x1F0000             
#define FINT_STAT_LEN                        (4U)                
#define FINT_STAT_MASK                       0xFFFFFFFFUL        
#define FINT_STAT_SYS_PANIC_BIT_OFFSET       (7U)                
#define FINT_STAT_SYS_PANIC_BIT_LEN          (1U)                
#define FINT_STAT_SYS_PANIC_BIT_MASK         0x80U                
#define FINT_STAT_SYS_EVENT_BIT_OFFSET       (6U)                
#define FINT_STAT_SYS_EVENT_BIT_LEN          (1U)                
#define FINT_STAT_SYS_EVENT_BIT_MASK         0x40U                
#define FINT_STAT_RXTO_BIT_OFFSET            (5U)                
#define FINT_STAT_RXTO_BIT_LEN               (1U)                
#define FINT_STAT_RXTO_BIT_MASK              0x20U                
#define FINT_STAT_RXERR_BIT_OFFSET           (4U)                
#define FINT_STAT_RXERR_BIT_LEN              (1U)                
#define FINT_STAT_RXERR_BIT_MASK             0x10U                
#define FINT_STAT_RXOK_BIT_OFFSET            (3U)                
#define FINT_STAT_RXOK_BIT_LEN               (1U)                
#define FINT_STAT_RXOK_BIT_MASK              0x8U                 
#define FINT_STAT_RXTSERR_BIT_OFFSET         (2U)                
#define FINT_STAT_RXTSERR_BIT_LEN            (1U)                
#define FINT_STAT_RXTSERR_BIT_MASK           0x4U                 
#define FINT_STAT_CCA_FAIL_AAT_BIT_OFFSET    (1U)                
#define FINT_STAT_CCA_FAIL_AAT_BIT_LEN       (1U)                
#define FINT_STAT_CCA_FAIL_AAT_BIT_MASK      0x2U                 
#define FINT_STAT_TXOK_BIT_OFFSET            (0U)                
#define FINT_STAT_TXOK_BIT_LEN               (1U)                
#define FINT_STAT_TXOK_BIT_MASK              0x1U                 

/******************************************************************************
* @brief Bit definitions for register INDIRECT_ADDR_A
**/
#define INDIRECT_ADDR_A_ID                   0x1f0004             
#define INDIRECT_ADDR_A_LEN                  (4U)                
#define INDIRECT_ADDR_A_MASK                 0xFFFFFFFFUL        
#define INDIRECT_ADDR_A_INDIRECT_ADDR_A_BIT_OFFSET (0U)                
#define INDIRECT_ADDR_A_INDIRECT_ADDR_A_BIT_LEN (5U)                
#define INDIRECT_ADDR_A_INDIRECT_ADDR_A_BIT_MASK 0x1fU                

/******************************************************************************
* @brief Bit definitions for register ADDR_OFFSET_A
**/
#define ADDR_OFFSET_A_ID                     0x1f0008             
#define ADDR_OFFSET_A_LEN                    (4U)                
#define ADDR_OFFSET_A_MASK                   0xFFFFFFFFUL        
#define ADDR_OFFSET_A_ADDR_OFFSET_A_BIT_OFFSET (0U)                
#define ADDR_OFFSET_A_ADDR_OFFSET_A_BIT_LEN  (15U)               
#define ADDR_OFFSET_A_ADDR_OFFSET_A_BIT_MASK 0x7fffU              

/******************************************************************************
* @brief Bit definitions for register INDIRECT_ADDR_B
**/
#define INDIRECT_ADDR_B_ID                   0x1f000c             
#define INDIRECT_ADDR_B_LEN                  (4U)                
#define INDIRECT_ADDR_B_MASK                 0xFFFFFFFFUL        
#define INDIRECT_ADDR_B_INDIRECT_ADDR_B_BIT_OFFSET (0U)                
#define INDIRECT_ADDR_B_INDIRECT_ADDR_B_BIT_LEN (5U)                
#define INDIRECT_ADDR_B_INDIRECT_ADDR_B_BIT_MASK 0x1fU                

/******************************************************************************
* @brief Bit definitions for register ADDR_OFFSET_B
**/
#define ADDR_OFFSET_B_ID                     0x1f0010             
#define ADDR_OFFSET_B_LEN                    (4U)                
#define ADDR_OFFSET_B_MASK                   0xFFFFFFFFUL        
#define ADDR_OFFSET_B_ADDR_OFFSET_B_BIT_OFFSET (0U)                
#define ADDR_OFFSET_B_ADDR_OFFSET_B_BIT_LEN  (15U)               
#define ADDR_OFFSET_B_ADDR_OFFSET_B_BIT_MASK 0x7fffU              

#ifdef __cplusplus
}
#endif
#endif /* __DECA_REGS_H */
